In [1]:
import pandas as pd
import numpy as np
import sqlalchemy
import os
import glob
import xlrd
import xlsxwriter
import openpyxl
import psycopg2
import urllib
import openpyxl
import re
import os
import string

from datetime import datetime
from openpyxl.styles import Font, Color, Alignment, Border, Side, NamedStyle, PatternFill
from openpyxl.worksheet.dimensions import ColumnDimension
from datetime import datetime
from openpyxl import  load_workbook
from openpyxl.utils.cell import get_column_letter
from urllib.parse import quote
from psycopg2.extensions import AsIs
from sqlalchemy import create_engine
from datetime import datetime
from dateutil.relativedelta import relativedelta
from openpyxl.styles import Font, Color, Alignment, Border, Side, NamedStyle, PatternFill
from openpyxl.worksheet.dimensions import ColumnDimension
from datetime import datetime
from openpyxl import  load_workbook
from openpyxl.utils.cell import get_column_letter
from openpyxl.utils.dataframe import dataframe_to_rows

import warnings
warnings.filterwarnings("ignore")

* **Start time of Data preparation**

In [2]:
# Dataread Start time
t1= datetime.now()

In [3]:
path = r'C:\Users\FIU\Desktop\Ravi\Monthly Report'
path

'C:\\Users\\FIU\\Desktop\\Ravi\\Monthly Report'

In [4]:
# Create function for CamelCase
from re import sub

def Camel_Case(st):
    st = st[:-(len(st)-1)].upper()+st[1:len(st)].lower()
    return st

In [174]:
min_batchid = 2304010000
print('Start BATCHID:',min_batchid)
max_batchid = 2304309999
print('End BATCHID:',max_batchid)

Start BATCHID: 2304010000
End BATCHID: 2304309999

In [176]:
month = 'apr23'
print('Analysis month -',month)
month_cc = Camel_Case(month)
print('Analysis month in Camel Case -',month_cc)
month_report_format = format(month_cc[0:3] +' '+'20'+month[3:5])
print('Analysis month in reporting format -',month_report_format)

Analysis month - apr23
Analysis month in Camel Case - Apr23
Analysis month in reporting format - Apr 2023

* **Setting up the output directory**

In [177]:
output_dir = path + f'\\{month_report_format}\\Output\\'
output_dir

'C:\\Users\\FIU\\Desktop\\Ravi\\Monthly Report\\Apr 2023\\Output\\'

#### Create Postgres Connection

In [178]:
try:
    pengine = create_engine('postgresql+psycopg2://postgres:postgres@localhost:5432/postgres')
    #pengine=create_engine('postgresql+psycopg2://postgres:postgres@172.16.22.15:5432/postgres')

    conn = psycopg2.connect(database = 'postgres', user = 'postgres', password = 'postgres',host = "localhost",port= 5432)
    conn.autocommit = True

    cursor = conn.cursor()
    
    db_conn=pengine.connect()
    print("\n Postgres database connected succesfully")
except:
    print("Unable to create the Postgres DB connection")

 Postgres database connected succesfully

##### Supporting documents - RE Master and RE Category Master

In [179]:
#* **RE MASTER**
re_master = pd.read_csv(path + '\\Supporting_docs\\re_master.csv')
re_master.columns = re_master.columns.str.lower()
re_master.head(2)
# * **RE CATEGORY MASTER**
re_category_master = pd.read_csv(path + '\\Supporting_docs\\recategorymaster.csv')
re_category_master.columns = re_category_master.columns.str.lower()
re_category_master.columns=[col.lower() for col in re_category_master.columns]
re_category_master.head(2)

,recategory,categorydesc,reprefix,creationdate,createdby
0,INCRE,Credit Rating Agencies ...,INCRE,2011-02-19,FINGATE
1,INVCD,Domestic Venture Capital Funds ...,INVCD,2011-02-19,FINGATE

* **Run the below data insertion query  only for the first time**

In [180]:
# # **** Data Push to Postgres ***
# re_master.to_sql(f're_master',pengine,schema='monthly_report',if_exists='replace',index=False)
# print(f"batch file inserted into re_master with dimensions{ re_master.shape}")

In [181]:
# # **** Data Push to Postgres ***
# re_category_master.to_sql(f'recategorymaster',pengine,schema='monthly_report',if_exists='replace',index=False)
# print(f"batch file inserted into recategorymaster with dimensions{ re_category_master.shape}")

* **Source of Alert**

In [182]:
source_of_alert = pd.read_csv(path + '\\Supporting_docs\\source_of_alert.csv')
source_of_alert.columns = source_of_alert.columns.str.lower()
source_of_alert.columns=[col.lower() for col in source_of_alert.columns]
source_of_alert.head(2)

  source of alert      alert description
0              CV  Customer Verification
1              WL             Watch List

* **Run the below data insertion query  only for the first time**

In [183]:
# # **** Data Push to Postgres ***
# source_of_alert.to_sql(f'source_of_alert',pengine,schema='monthly_report',if_exists='replace',index=False)
# print(f"Source of alert file inserted into source_of_alert table")

In [286]:
REs_list = pd.read_csv(path + '\\Supporting_docs\\RE_LIST_13-MAR-2023.csv',encoding = 'latin1')
REs_list.head(1)

,REPKID,FIUREID,ENTITYNAME,RECATEGORY,UNIQUECODE,ADDRESS,CITY,STATECODE,PINCODE,COUNTRYCODE,...,PROFILESTATUS,POID,GROUPFLAG,MONITORED,AMALGAMATED,DATEOFAMALGAMATION,REFREID,CREATIONDATE,CREATEDBY,PRIORITY
0,163,BADCB00001,Agra Zilla Sahakari Bank Limited,BADCB,NaN,"Wardhawar House Nai Ki Mandi 71, Mahatma Gandh...",NaN,XX,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,30-Dec-10,Migration,NaN

In [252]:
#REs_apr = pd.read_csv(path + '\\Supporting_docs\\RE_LIST_APR_2023.csv',encoding = 'latin1')

In [287]:
REs_list.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 61765 entries, 0 to 61764
Data columns (total 28 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   REPKID              61765 non-null  int64
 1   FIUREID             61765 non-null  object
 2   ENTITYNAME          61765 non-null  object
 3   RECATEGORY          61765 non-null  object
 4   UNIQUECODE          41278 non-null  object
 5   ADDRESS             53287 non-null  object
 6   CITY                12678 non-null  object
 7   STATECODE           61765 non-null  object
 8   PINCODE             26373 non-null  float64
 9   COUNTRYCODE         12498 non-null  object
 10  TELEPHONE           14244 non-null  object
 11  FAX                 710 non-null    object
 12  WEBSITE             481 non-null    object
 13  REGIONALOFFICE      35025 non-null  object
 14  CONTACTPERSON       41427 non-null  object
 15  CONTACTPERSONEMAIL  13128 non-null  object
 16  REGISTRATIONDATE    34510 non-null  object
 17  RESTATUS            61726 non-null  object
 18  PROFILESTATUS       476 non-null    object
 19  POID                13010 non-null  float64
 20  GROUPFLAG           0 non-null      float64
 21  MONITORED           784 non-null    object
 22  AMALGAMATED         135 non-null    object
 23  DATEOFAMALGAMATION  114 non-null    object
 24  REFREID             1185 non-null   float64
 25  CREATIONDATE        61765 non-null  object
 26  CREATEDBY           61765 non-null  object
 27  PRIORITY            576 non-null    object
dtypes: float64(4), int64(1), object(23)
memory usage: 13.2+ MB

In [295]:
#REs_apr
REs_list['CREATIONDATE'] = pd.to_datetime(REs_list['CREATIONDATE'])
,format='%dd-%mm-%YY')
#,format='%dd-%mmm-%YY')

In [241]:
#REs_list.tail()

In [275]:
REs_list.columns=[col.lower() for col in REs_list.columns]
REs_list.to_sql(f'{month}_re_list',pengine,schema='monthly_report',if_exists='append',index=False)
print(f"RE list inserted into {month}_re_list with dimensions{ REs_list.shape}")

RE list inserted into apr23_re_list with dimensions(61765, 28)

In [244]:
#pd.to_datetime('13-APR-23', format='%dd-%mmm-%YY', errors='ignore')

'13-APR-23'

In [301]:
REs_list['CREATIONDATE']

0       2010-12-30
1       2010-12-30
2       2010-12-30
3       2010-12-30
4       2010-12-30
           ...
61760   2023-04-26
61761   2023-04-26
61762   2023-04-26
61763   2023-04-05
61764   2023-04-13
Name: CREATIONDATE, Length: 61765, dtype: datetime64[ns]

#### Create Schema-Monthly Report ignore if already created

In [289]:
monthly_ctr_query = "CREATE SCHEMA IF NOT EXISTS %s AUTHORIZATION %s;"
monthly_ctr = (AsIs(f'monthly_report'),AsIs('postgres'))
cursor.execute(monthly_ctr_query,monthly_ctr)

InterfaceError: cursor already closed

#### Create Combined tables - Materialized view

* Combined RE Master and RE Category Master

In [198]:
combined_re_master = db_conn.execute(f"CREATE MATERIALIZED VIEW IF NOT EXISTS monthly_report.combined_remaster_{month} TABLESPACE pg_default AS  SELECT re.fiureid,     re.entityname,     re.recategory,     rc.categorydesc    FROM monthly_report.{month}_re_list re      left JOIN monthly_report.re_master rm ON re.fiureid = rm.fiureid      left JOIN monthly_report.recategorymaster rc ON re.recategory = rc.recategory")
print(f"Materialized view created : monthly_report.combined_remaster_{month}")

Materialized view created : monthly_report.combined_remaster_apr23

* Combined Batch table for all the report types

In [199]:
# Combined table for july
combined_batch = db_conn.execute(f"CREATE MATERIALIZED VIEW IF NOT EXISTS monthly_report.combined_batch_{month} TABLESPACE pg_default AS  SELECT batchid, fiureid, entityname, reporttype, originalbatchid,batchtype, recategory   FROM monthly_str.{month}_batch_str UNION  SELECT batchid, fiureid, entityname, reporttype, originalbatchid, batchtype, recategory   FROM monthly_ctr.{month}_batch_ctr UNION  SELECT batchid, fiureid, entityname, reporttype, originalbatchid, batchtype, recategory   FROM monthly_eft.{month}_batch_eft UNION  SELECT batchid, fiureid, entityname, reporttype, originalbatchid, batchtype, recategory   FROM monthly_ntr.{month}_batch_ntr UNION  SELECT batchid, fiureid, entityname, reporttype, originalbatchid, batchtype, recategory   FROM monthly_ccr.{month}_batch_ccr")
print(f"Materialized view created : monthly_report.combined_batch_{month}")

Materialized view created : monthly_report.combined_batch_apr23

* Combined Report table for all the report types

In [200]:
# Combined table for july
combined_report = db_conn.execute(f"CREATE MATERIALIZED VIEW IF NOT EXISTS monthly_report.combined_report_{month} TABLESPACE pg_default AS  SELECT {month}_report_str.batchid, {month}_report_str.rptsernum    FROM monthly_str.{month}_report_str UNION  SELECT {month}_report_ctr.batchid,   {month}_report_ctr.rptsernum    FROM monthly_ctr.{month}_report_ctr UNION  SELECT {month}_report_eft.batchid,   {month}_report_eft.rptsernum    FROM monthly_eft.{month}_report_eft UNION  SELECT {month}_report_ntr.batchid,   {month}_report_ntr.rptsernum    FROM monthly_ntr.{month}_report_ntr UNION  SELECT {month}_report_ccr.batchid,   {month}_report_ccr.rptsernum    FROM monthly_ccr.{month}_report_ccr       ")
print(f"Materialized view created : monthly_report.combined_report_{month}")

Materialized view created : monthly_report.combined_report_apr23

* **File Creation**

#### 1-List of New Registered REs

In [290]:
re_registration_month = '01'
print(f'For first sheet {re_registration_month} is the month of creation date')

For first sheet 01 is the month of creation date

* **Change the creation date for the analysis month**

In [297]:
month[:3].upper()

'APR'

In [307]:
colnames = []
data = []

with conn as connection:
    with connection.cursor() as cursor:
        cursor.execute(f"select distinct re_list.fiureid,coalesce(re_list.entityname,re.entityname) as entityname,re_list.recategory,categorydesc,city,pincode from monthly_report.{month}_re_list re_list inner join monthly_report.combined_remaster_{month} re on re_list.recategory = re.recategory where substring(CREATIONDATE,4,3) = '{month[:3].upper()}' and substring(CREATIONDATE,8,2) = '23'")
        
        colnames = [desc[0] for desc in cursor.description]
        for row in cursor:
            data.append(row)
REs_registered = pd.DataFrame(data,columns=[colnames])
REs_registered.columns = [i[0] for i in REs_registered.columns]
REs_registered = REs_registered.reset_index()
REs_registered['index'] = REs_registered['index']+1
REs_registered = REs_registered.rename(columns={'index':'sl. no.'})
REs_registered.to_csv(output_dir + f'1-LIST OF NEW REs REGISTERED_{month}.csv')

print(f'New registered REs in {month[:3].upper()} :' ,REs_registered.shape[0])
REs_registered.head(2)

New registered REs in APR : 0

Empty DataFrame
Columns: [sl. no., fiureid, entityname, recategory, categorydesc, city, pincode]
Index: []

In [299]:
f"select distinct re_list.fiureid,coalesce(re_list.entityname,re.entityname) as entityname,re_list.recategory,categorydesc,city,pincode from monthly_report.{month}_re_list re_list inner join monthly_report.combined_remaster_{month} re on re_list.recategory = re.recategory where substring(creationdate,4,3) = '{month[:3].upper()}' and substring(creationdate,8,2) = '23'"

"select distinct re_list.fiureid,coalesce(re_list.entityname,re.entityname) as entityname,re_list.recategory,categorydesc,city,pincode from monthly_report.apr23_re_list re_list inner join monthly_report.combined_remaster_apr23 re on re_list.recategory = re.recategory where substring(creationdate,4,3) = 'APR' and substring(creationdate,8,2) = '23'"

#### 2. Number of batches filed for each type: New, Replacement, Deletion

In [23]:
colnames = []
data = []

with conn as connection:
    with connection.cursor() as cursor:
        cursor.execute(f"select BATCHTYPE, sum(case when REPORTTYPE='CTR' then Batch_Count  else 0 end) as CTR,\
                            sum(case when REPORTTYPE='STR' then Batch_Count  else 0 end) as STR,\
                            sum(case when REPORTTYPE='EFT' then Batch_Count  else 0 end)as EFT,\
                            sum(case when REPORTTYPE='NTR' then Batch_Count  else 0 end) as NTR,\
                            sum(case when REPORTTYPE='CCR' then Batch_Count  else 0 end) as CCR,\
                            sum(case when REPORTTYPE is null then Batch_Count  else 0 end) as NULLREPORT,\
                            sum(Batch_Count)as Total_Batch_Count\
                            from\
                            (select BATCHTYPE, REPORTTYPE ,count(distinct batchid) as Batch_Count  \
                             FROM  monthly_report.combined_batch_{month}\
                            group by batchtype,REPORTTYPE\
                            order by count(distinct batchid) desc)z\
                            group by batchtype\
                            order by Total_Batch_Count desc")
        
        colnames = [desc[0] for desc in cursor.description]
        for row in cursor:
            data.append(row)
tot_batch_filed_raw = pd.DataFrame(data,columns=[colnames])
tot_batch_filed_raw.columns = [i[0] for i in tot_batch_filed_raw.columns]
tot_batch_filed = tot_batch_filed_raw[['batchtype','str', 'ctr', 'ntr','eft','ccr','total_batch_count']]
tot_batch_filed_raw = tot_batch_filed_raw[['batchtype','str', 'ctr', 'ntr','eft','ccr','nullreport','total_batch_count']]
tot_batch_filed.to_csv(output_dir + f'2-NUMBER_BATCH_FILED_{month}.csv')
tot_batch_filed_raw.to_csv(output_dir + f'2-NUMBER_BATCH_FILED_raw_{month}.csv')
tot_batch_filed

  batchtype    str   ctr  ntr   eft  ccr total_batch_count
0         N  15251  4090  402  1634  205             21582
1         D     17     4    2   136    2               161
2         R     67     9    3    16    0                95

In [24]:
tot_batch_filed_raw

  batchtype    str   ctr  ntr   eft  ccr nullreport total_batch_count
0         N  15251  4090  402  1634  205          0             21582
1         D     17     4    2   136    2          0               161
2         R     67     9    3    16    0          0                95

####  This point is removed from the analysis sincce july
3. List of REs filing deficient batches (missing Report File)

In [25]:
# colnames = []
# data = []

# with conn as connection:
#     with connection.cursor() as cursor:
#         cursor.execute(f"SELECT upper(coalesce(rr.entityname,b.entityname)) as entityname, b.FIUREID ,b.batchid  \
#                         FROM (select b.entityname, b.FIUREID,b.batchid \
#                               from monthly_report.combined_batch_{month} b \
#                        where b.fiureid not in ( 'XXXXX00001', 'XXXXX99999','XXXXXXXXXX')) b \
#                         left join monthly_report.combined_report_{month} r on b.batchid = r.batchid  \
#                         left join monthly_report.combined_remaster_{month}  rr on rr.fiureid=b.fiureid \
#                         where (r.batchid is null and b.batchid is null) \
#                         and b.batchid not IN (select originalbatchid from monthly_report.combined_batch_{month} b2 \
#                                               where  batchtype in ('D','R') union \
#                                               select batchid from monthly_report.combined_batch_{month} b2 \
#                                               where  batchtype ='D' )")
        
#         colnames = [desc[0] for desc in cursor.description]
#         for row in cursor:
#             data.append(row)
# deficient_batches = pd.DataFrame(data,columns=[colnames])
# deficient_batches.to_csv(output_dir + f'3- REs FILING DEFICIENT BATCH_{month}.csv')
# deficient_batches

#### 3A. No. of Reports Filed across all REs
* **Total no. of Reports Filed across all REs**

In [26]:
colnames = []
data = []

with conn as connection:
    with connection.cursor() as cursor:
        cursor.execute(f"with cte1 as( select batchid,b.fiureid, reporttype,batchtype, 	coalesce(b.entityname,rm.entityname) as entityname,coalesce(b.recategory,rm.recategory) as recategory 	from monthly_report.combined_batch_{month} b 	inner join monthly_report.combined_remaster_{month} rm 	on b.fiureid = rm.fiureid and b.recategory = rm.recategory 	where b.fiureid not in ( 'XXXXX00001', 'XXXXX99999','XXXXXXXXXX') 	and  batchid not IN (select originalbatchid from monthly_report.combined_batch_{month} where batchtype in ('D','R')  	union select batchid from monthly_report.combined_batch_{month} where  batchtype ='D' ) ), cte2 as ( select b.batchid, rptsernum, BATCHTYPE, REPORTTYPE ,count(distinct rptsernum) as Batch_Count  	FROM cte1 b inner join monthly_report.combined_report_{month} r on b.batchid = r.batchid  	group by b.batchid,rptsernum, BATCHTYPE, REPORTTYPE order by count(distinct rptsernum) ) , cte3 as ( select c2.batchid, rptsernum,                     case when c1.REPORTTYPE='STR' then Batch_Count  else 0 end as STR,                     case when c1.REPORTTYPE='CTR' then Batch_Count  else 0 end as CTR,                     case when c1.REPORTTYPE='NTR' then Batch_Count  else 0 end as NTR,                     case when c1.REPORTTYPE='EFT' then Batch_Count  else 0 end as EFT,                     case when c1.REPORTTYPE='CCR' then Batch_Count  else 0 end as CCR,                     case when c1.REPORTTYPE is null then Batch_Count  else 0 end as NULLREPORT,                     Batch_Count as Total_Batch_Count 	from cte1 c1 inner join cte2 c2 on c1.batchid = c2.batchid )  select substring(c3.batchid :: text,3,2) as month, sum(STR) STR,sum(CTR) CTR,sum(NTR) NTR,sum(EFT) EFT,sum(CCR) CCR,sum(NULLREPORT) NULL_REPORT,sum(Total_Batch_Count) as Total_Batch_Count from cte3 c3 group by substring(c3.batchid :: text,3,2) order by Total_Batch_Count desc")
        
        colnames = [desc[0] for desc in cursor.description]
        for row in cursor:
            data.append(row)
total_reports = pd.DataFrame(data,columns=[colnames])
total_reports.columns = [i[0] for i in total_reports.columns]
total_reports.to_csv(output_dir + f'3A-NO.OF REPORTS ACROSS ALL REs_{month}.csv')
total_reports_raw = total_reports[['month', 'str', 'ctr', 'ntr', 'eft', 'ccr', 'null_report', 'total_batch_count']]
total_reports = total_reports[['month', 'str', 'ctr', 'ntr', 'eft', 'ccr', 'total_batch_count']]
total_reports_raw

  month    str      ctr     ntr      eft    ccr null_report total_batch_count
0    04  77742  3474654  190394  2958640  31610           0           6733040

In [27]:
total_reports

  month    str      ctr     ntr      eft    ccr total_batch_count
0    04  77742  3474654  190394  2958640  31610           6733040

#### 3B. RE NAME WISE_REPORT_COUNT
* **Number of reports filed by each RE sorted in descending order along with percentage of total**

In [28]:
colnames = []
data = []

with conn as connection:
    with connection.cursor() as cursor:
        cursor.execute(f"with cte1 as( select batchid,b.fiureid, reporttype,batchtype, 	coalesce(rm.entityname,b.entityname) as entityname,coalesce(rm.recategory,b.recategory) as recategory 	from monthly_report.combined_batch_{month} b 	inner join monthly_report.combined_remaster_{month} rm 	on b.fiureid = rm.fiureid and b.recategory = rm.recategory 	where b.fiureid not in ( 'XXXXX00001', 'XXXXX99999','XXXXXXXXXX') 	and  batchid not IN (select originalbatchid from monthly_report.combined_batch_{month} where batchtype in ('D','R')  	union select batchid from monthly_report.combined_batch_{month} where  batchtype ='D' ) ), cte2 as ( select b.batchid, rptsernum, BATCHTYPE, REPORTTYPE ,count(distinct rptsernum) as Batch_Count  	FROM cte1 b inner join monthly_report.combined_report_{month} r on b.batchid = r.batchid  	group by b.batchid,rptsernum, BATCHTYPE, REPORTTYPE order by count(distinct rptsernum) ) , cte3 as ( select c2.batchid, rptsernum, case when c1.REPORTTYPE='STR' then Batch_Count  else 0 end as STR, case when c1.REPORTTYPE='CTR' then Batch_Count  else 0 end as CTR, case when c1.REPORTTYPE='NTR' then Batch_Count  else 0 end as NTR, case when c1.REPORTTYPE='EFT' then Batch_Count  else 0 end as EFT, case when c1.REPORTTYPE='CCR' then Batch_Count  else 0 end as CCR, case when c1.REPORTTYPE is null then Batch_Count  else 0 end as NULLREPORT, Batch_Count as Total_Batch_Count 	from cte1 c1 inner join cte2 c2 on c1.batchid = c2.batchid )  select c1.fiureid,c1.entityname, sum(STR) STR,sum(CTR) CTR,sum(NTR) NTR,sum(EFT) EFT,sum(CCR) CCR,sum(NULLREPORT) NULL_REPORT,sum(Total_Batch_Count) as Total_Batch_Count from cte3 c3 left join cte1 c1 on c1.batchid = c3.batchid group by c1.fiureid,c1.entityname order by Total_Batch_Count desc")
        
        colnames = [desc[0] for desc in cursor.description]
        for row in cursor:
            data.append(row)
re_wise_total_reports = pd.DataFrame(data,columns=[colnames])
re_wise_total_reports.columns = [i[0] for i in re_wise_total_reports.columns]
re_wise_total_reports = re_wise_total_reports.reset_index()
re_wise_total_reports['index'] = re_wise_total_reports['index']+1
re_wise_total_reports = re_wise_total_reports.rename(columns={'index':'sl. no.'})
re_wise_total_reports.to_csv(output_dir + f'3B-RE NAME WISE_REPORT_COUNT_{month}.csv')

re_wise_total_reports_raw = re_wise_total_reports[['sl. no.','fiureid', 'entityname', 'str', 'ctr', 'ntr', 'eft', 'ccr', 'null_report', 'total_batch_count']]
re_wise_total_reports = re_wise_total_reports[['sl. no.','fiureid', 'entityname', 'str', 'ctr', 'ntr', 'eft', 'ccr', 'total_batch_count']]

re_wise_total_reports.head(2)

,sl. no.,fiureid,entityname,str,ctr,ntr,eft,ccr,total_batch_count
0,1,BASCB00072,ICICI Bank Limited,10448,388400,73572,1486388,14704,1973512
1,2,BASCB00078,Karur Vysya Bank Limited,404,1595632,2968,18660,440,1618104

In [29]:
re_wise_total_reports_raw.head(2)

,sl. no.,fiureid,entityname,str,ctr,ntr,eft,ccr,null_report,total_batch_count
0,1,BASCB00072,ICICI Bank Limited,10448,388400,73572,1486388,14704,0,1973512
1,2,BASCB00078,Karur Vysya Bank Limited,404,1595632,2968,18660,440,0,1618104

* Validation of total reports and RE_NAME wise report count

In [165]:
int(re_wise_total_reports[['total_batch_count']].sum()) ==  int(total_reports[['total_batch_count']].sum())

False

In [34]:
int(total_reports[['total_batch_count']].sum())

6733040

#### 4. RE CATEGORY_REPORT_COUNT
* **Number of reports filed by each RE category sorted in descending order along with percentage of total.**

In [35]:
colnames = []
data = []

with conn as connection:
    with connection.cursor() as cursor:
        cursor.execute(f"with cte1 as( select batchid,b.fiureid, reporttype,batchtype, 	coalesce(rm.entityname,b.entityname) as entityname,coalesce(b.recategory,rm.recategory) as recategory,categorydesc 	from monthly_report.combined_batch_{month} b 	inner join monthly_report.combined_remaster_{month} rm 	on b.fiureid = rm.fiureid and b.recategory = rm.recategory 	where b.fiureid not in ( 'XXXXX00001', 'XXXXX99999','XXXXXXXXXX') 	and  batchid not IN (select originalbatchid from monthly_report.combined_batch_{month} where batchtype in ('D','R')  	union select batchid from monthly_report.combined_batch_{month} where  batchtype ='D' ) ), cte2 as ( select b.batchid, rptsernum, BATCHTYPE, REPORTTYPE ,count(distinct rptsernum) as Batch_Count  	FROM cte1 b inner join monthly_report.combined_report_{month} r on b.batchid = r.batchid  	group by b.batchid,rptsernum, BATCHTYPE, REPORTTYPE order by count(distinct rptsernum) ) , cte3 as ( select c2.batchid, rptsernum,                     case when c1.REPORTTYPE='STR' then Batch_Count  else 0 end as STR,                     case when c1.REPORTTYPE='CTR' then Batch_Count  else 0 end as CTR,                     case when c1.REPORTTYPE='NTR' then Batch_Count  else 0 end as NTR,                     case when c1.REPORTTYPE='EFT' then Batch_Count  else 0 end as EFT,                     case when c1.REPORTTYPE='CCR' then Batch_Count  else 0 end as CCR,                     case when c1.REPORTTYPE is null then Batch_Count  else 0 end as NULLREPORT,                     Batch_Count as Total_Batch_Count 	from cte1 c1 inner join cte2 c2 on c1.batchid = c2.batchid )  select c1.recategory,c1.categorydesc, count(distinct c1.entityname) as re_count,sum(STR) STR,sum(CTR) CTR,sum(NTR) NTR,sum(EFT) EFT,sum(CCR) CCR,sum(NULLREPORT) NULL_REPORT,sum(Total_Batch_Count) as Total_Batch_Count from cte3 c3 left join cte1 c1 on c1.batchid = c3.batchid group by c1.recategory,c1.categorydesc order by Total_Batch_Count desc")
        
        colnames = [desc[0] for desc in cursor.description]
        for row in cursor:
            data.append(row)
category_wise_total_reports = pd.DataFrame(data,columns=[colnames])

category_wise_total_reports.columns = [i[0] for i in category_wise_total_reports.columns]
category_wise_total_reports = category_wise_total_reports.reset_index()
category_wise_total_reports['index'] = category_wise_total_reports['index']+1
category_wise_total_reports = category_wise_total_reports.rename(columns={'index':'sl. no.'})

category_wise_total_reports.to_csv(output_dir + f'4-RE CATEGORY_REPORT_COUNT_{month}.csv')

category_wise_total_reports_raw = category_wise_total_reports[['sl. no.','recategory', 'categorydesc','re_count', 'str', 'ctr', 'ntr', 'eft', 'ccr', 'null_report', 'total_batch_count']]
category_wise_total_reports = category_wise_total_reports[['sl. no.','recategory', 'categorydesc', 're_count','str', 'ctr', 'ntr', 'eft', 'ccr', 'total_batch_count']]

category_wise_total_reports.head(2)

,sl. no.,recategory,categorydesc,re_count,str,ctr,ntr,eft,ccr,total_batch_count
0,1,BAPVT,Private Sector Banks ...,22,50388,3587752,203644,4157728,53224,8052736
1,2,BAPUB,Public Sector Banks ...,12,66812,3210876,196492,851244,7136,4332560

In [36]:
category_wise_total_reports_raw.head(2)

,sl. no.,recategory,categorydesc,re_count,str,ctr,ntr,eft,ccr,null_report,total_batch_count
0,1,BAPVT,Private Sector Banks ...,22,50388,3587752,203644,4157728,53224,0,8052736
1,2,BAPUB,Public Sector Banks ...,12,66812,3210876,196492,851244,7136,0,4332560

 * Validation of RE_NAME wise report count and RE_Category wise report count

In [37]:
int(re_wise_total_reports[['total_batch_count']].sum()) == int(category_wise_total_reports[['total_batch_count']].sum())

True

#### 5. RE LIST_BATCH_WITHOUT_TRN 
* **Top REs Filing Batches Without TRN File**

* Create Materialize view for Batches without TRN - **CTR**

In [38]:
batch_without_trn_ctr = db_conn.execute(f"CREATE MATERIALIZED VIEW IF NOT EXISTS monthly_report.batches_without_trn_{month} TABLESPACE pg_default AS  WITH cte1 AS ( SELECT batchid, originalbatchid, reporttype, batchtype, fiureid, entityname           			  FROM monthly_ctr.{month}_batch_ctr UNION 			  SELECT batchid, originalbatchid, reporttype, batchtype, fiureid, entityname 			  FROM monthly_ntr.{month}_batch_ntr union 		SELECT batchid, originalbatchid, reporttype, batchtype, fiureid, entityname           			  FROM monthly_eft.{month}_batch_eft )  , 			  cte2 AS ( SELECT batchid AS trn_batch, rptsernum 		 FROM monthly_ctr.{month}_arftrn_ctr UNION 		 SELECT batchid AS trn_batch, rptsernum 		 FROM monthly_ntr.{month}_arftrn_ntr union 		SELECT batchid AS trn_batch, rptsernum 		 FROM monthly_eft.{month}_trftrn_eft ) 		 		 SELECT c1.batchid, c2.trn_batch, c2.rptsernum, c1.reporttype, c1.batchtype, c1.fiureid, c1.entityname FROM cte1 c1 LEFT JOIN cte2 c2 ON c1.batchid = c2.trn_batch WHERE NOT (c1.batchid IN ( SELECT cte1.originalbatchid FROM cte1 WHERE cte1.batchtype in  ('D', 'R') AND cte1.fiureid not in  ('XXXXX00001', 'XXXXX99999', 'XXXXXXXXXX') UNION SELECT cte1.batchid FROM cte1 WHERE cte1.batchtype = 'D')) AND c2.trn_batch IS NULL ")

In [39]:
colnames = []
data = []

with conn as connection:
    with connection.cursor() as cursor:
        cursor.execute(f"SELECT fiureid, entityname,CTR, NTR,EFT,SUM(NTR+CTR+EFT) AS TOTAL_BATCH \
                        FROM ( select trn.fiureid, upper(coalesce(re.entityname,trn.entityname)) as entityname, \
                        COUNT(distinct batchid) filter (where reporttype='CTR')CTR, \
                        COUNT(distinct batchid) filter (where reporttype='NTR')NTR,\
                        COUNT(distinct batchid) filter (where reporttype='EFT')EFT \
                        from monthly_report.batches_without_trn_{month}  trn \
                        inner join monthly_report.combined_remaster_{month} re on re.fiureid = trn.fiureid  \
                        group by trn.fiureid, coalesce(re.entityname,trn.entityname) ) Z  \
                        GROUP BY fiureid, entityname, CTR, NTR,EFT ORDER BY 6 DESC")
 
        
        colnames = [desc[0] for desc in cursor.description]
        for row in cursor:
            data.append(row)
batch_without_trn_ctr = pd.DataFrame(data,columns=[colnames])

batch_without_trn_ctr.columns = [i[0] for i in batch_without_trn_ctr.columns]
batch_without_trn_ctr = batch_without_trn_ctr.reset_index()
batch_without_trn_ctr['index'] = batch_without_trn_ctr['index']+1
batch_without_trn_ctr = batch_without_trn_ctr.rename(columns={'index':'sl. no.'})

batch_without_trn_ctr.to_csv(output_dir + f'5-RE LIST_BATCH_WITHOUT_TRN_CTR_{month}.csv')
batch_without_trn_ctr.head(2)

   sl. no.     fiureid            entityname  ctr  ntr  eft total_batch
0        1  BASCB00047  PUNJAB NATIONAL BANK    0    0  324         324
1        2  BASCB00072    ICICI BANK LIMITED    0    0  234         234

* **RAW - 5. Top REs Filing Batches Without TRN File**

In [40]:
colnames = []
data = []

with conn as connection:
    with connection.cursor() as cursor:
        cursor.execute(f" select trn.fiureid, upper(coalesce(re.entityname,trn.entityname)) as entityname, batchid, string_agg(reporttype,',') as reporttype from monthly_report.batches_without_trn_{month}  trn  inner join monthly_report.combined_remaster_{month} re on re.fiureid = trn.fiureid  group by trn.fiureid, upper(coalesce(re.entityname,trn.entityname)),batchid")
        
        colnames = [desc[0] for desc in cursor.description]
        for row in cursor:
            data.append(row)
batch_without_trn_ctr_raw = pd.DataFrame(data,columns=[colnames])

batch_without_trn_ctr_raw.columns = [i[0] for i in batch_without_trn_ctr_raw.columns]
batch_without_trn_ctr_raw = batch_without_trn_ctr_raw.reset_index()
batch_without_trn_ctr_raw['index'] = batch_without_trn_ctr_raw['index']+1
batch_without_trn_ctr_raw = batch_without_trn_ctr_raw.rename(columns={'index':'sl. no.'})

batch_without_trn_ctr_raw.to_csv(output_dir + f'5-RE LIST_BATCH_WITHOUT_TRN_CTR_{month}_RAW.csv')
batch_without_trn_ctr_raw.head(2)

,sl. no.,fiureid,entityname,batchid,reporttype
0,1,BADCB00078,DAKSHIN DINAJPUR (BALURGHAT) DISTRICT CENTRAL ...,2304133610,"CTR,CTR"
1,2,BADCB00123,HASSAN DISTRICT CENTRAL CO-OPERATIVE BANK LIMITED,2304157109,"CTR,CTR"

* Validation of Main file and RAW

In [41]:
int(batch_without_trn_ctr[['total_batch']].sum()) == len(batch_without_trn_ctr_raw[['fiureid']])

True

#### 6. ARF BATCH WITHOUT INP&LPE
 * **List of Top REs filing ARF batches (excluding STR) without INP & LPE File with total batch sorted in descending order**

* **Combined inp_lpe - Materialized View**

In [42]:
combined_inp_lpe = db_conn.execute(f"CREATE MATERIALIZED VIEW IF NOT EXISTS monthly_report.combined_inp_lpe_ctr_ntr_{month} TABLESPACE pg_default AS  SELECT batchid, rptsernum, personname,pan   FROM monthly_ctr.{month}_arfinp_lpe_ctr UNION  SELECT batchid, rptsernum, personname,pan   FROM monthly_ntr.{month}_arfinp_lpe_ntr ")

In [43]:
colnames = []
data = []

with conn as connection:
    with connection.cursor() as cursor:
        cursor.execute(f"WITH cte1 as ( select  batchid, fiureid, entityname from monthly_report.combined_batch_{month} where reporttype in ('CTR','NTR') ), cte2 as (select fiureid,entityname from monthly_report.combined_remaster_{month} )  		  select c1.fiureid, coalesce(c2.entityname,c1.entityname) as entityname,count(distinct c1.batchid) as batch_count from cte1 c1 left join cte2 c2 on c1.fiureid = c2.fiureid  left join monthly_report.combined_inp_lpe_ctr_ntr_{month} c3 on c1.batchid = c3.batchid  left join  monthly_report.combined_remaster_{month} rr on rr.fiureid = c1.fiureid 		 where c3.batchid is null  group by c1.fiureid,coalesce(c2.entityname,c1.entityname) order by  batch_count desc")
        
        colnames = [desc[0] for desc in cursor.description]
        for row in cursor:
            data.append(row)
arf_without_inplpe = pd.DataFrame(data,columns=[colnames])
arf_without_inplpe.columns = [i[0] for i in arf_without_inplpe.columns]
arf_without_inplpe = arf_without_inplpe.reset_index()
arf_without_inplpe['index'] = arf_without_inplpe['index']+1
arf_without_inplpe = arf_without_inplpe.rename(columns={'index':'sl. no.'})
arf_without_inplpe.to_csv(output_dir + f'6-ARF BATCH WITHOUT INP&LPE_{month}.csv')
arf_without_inplpe.head(2)

,sl. no.,fiureid,entityname,batch_count
0,1,BAUCB00465,Jambusar People's Coop Bank Limited,12
1,2,FIAPR01125,Unimoni Financial Services LTD(Formerly UAE Ex...,5

#### Raw Data

In [44]:
colnames = []
data = []

with conn as connection:
    with connection.cursor() as cursor:
        cursor.execute(f"WITH cte1 as (select  batchid, fiureid, entityname,recategory  from monthly_report.combined_batch_{month}  where reporttype in('CTR','NTR')), cte2 as (select fiureid,entityname,recategory,categorydesc  from monthly_report.combined_remaster_{month} )  		  select c1.fiureid, coalesce(c1.entityname,c2.entityname) as entityname, coalesce(c1.recategory,c2.recategory) as recategory,  c2.categorydesc,c1.batchid  from cte1 c1 left join cte2 c2 on c1.fiureid = c2.fiureid  left join monthly_report.combined_inp_lpe_ctr_ntr_{month} c3 on c1.batchid = c3.batchid  left join  monthly_report.combined_remaster_{month} rr on rr.fiureid = c1.fiureid 		 where c3.batchid is null ")
 
        
        colnames = [desc[0] for desc in cursor.description]
        for row in cursor:
            data.append(row)
arf_without_inplpe_raw = pd.DataFrame(data,columns=[colnames])

arf_without_inplpe_raw.columns = [i[0] for i in arf_without_inplpe_raw.columns]
arf_without_inplpe_raw = arf_without_inplpe_raw.reset_index()
arf_without_inplpe_raw['index'] = arf_without_inplpe_raw['index']+1
arf_without_inplpe_raw = arf_without_inplpe_raw.rename(columns={'index':'sl. no.'})

arf_without_inplpe_raw.to_csv(output_dir + f'6-ARF BATCH WITHOUT INP&LPE_{month}_RAW.csv')
arf_without_inplpe_raw.head(2)

,sl. no.,fiureid,entityname,recategory,categorydesc,batchid
0,1,BAUCB00745,"MATTANCHERRY SARVAJANIK CO-OPERATIVE BANK LTD,...",BANUC,Non Scheduled Urban Cooperative Banks ...,2304200630
1,2,BAUCB00745,"MATTANCHERRY SARVAJANIK CO-OPERATIVE BANK LTD,...",BANUC,Non Scheduled Urban Cooperative Banks ...,2304200630

* Validation of Main file and RAW

In [45]:
int(arf_without_inplpe[['batch_count']].sum()) == len(arf_without_inplpe_raw[['fiureid']])

False

#### 7. RE LIST_INSUFFICIENT_GOS
* **List of Top REs filing STRs with insufficient Grounds of Suspicion (GoS) & Details of Investigation (DOI) i.e. less than 500 characters**

In [46]:
colnames = []
data = []

with conn as connection:
    with connection.cursor() as cursor:
        cursor.execute(f"select b.fiureid,coalesce(rr.entityname,b.entityname) as entityname,count(distinct B.BATCHID::text || r.rptsernum::text) as total_batches from monthly_report.combined_batch_{month} b inner join monthly_str.{month}_report_str r on b.batchid=r.batchid left join  monthly_report.combined_remaster_{month} rr on rr.fiureid=b.fiureid where b.reporttype = 'STR' and (length(r.GROUNDSOFSUSP) + length(r.detailsofinvestigations)) < 500 group by 1,2 order by 3 desc")
        colnames = [desc[0] for desc in cursor.description]
        for row in cursor:
            data.append(row)
insufficient_gos = pd.DataFrame(data,columns=[colnames])

insufficient_gos.columns = [i[0] for i in insufficient_gos.columns]
insufficient_gos = insufficient_gos.reset_index()
insufficient_gos['index'] = insufficient_gos['index']+1
insufficient_gos = insufficient_gos.rename(columns={'index':'sl. no.'})

insufficient_gos.to_csv(output_dir + f'7-RE LIST_INSUFFICIENT_GOS_{month}.csv')
insufficient_gos.head(2)

,sl. no.,fiureid,entityname,total_batches
0,1,BAUCB00998,Railway Shramik Sahakari Bank Limited Bikaner,58
1,2,BAUCB01812,Wai Urban Coop Bank Limited,16

#### Raw Data

In [47]:
colnames = []
data = []

with conn as connection:
    with connection.cursor() as cursor:
        cursor.execute(f"select coalesce(rr.recategory,b.recategory) as recategory, b.fiureid,coalesce(rr.entityname,b.entityname) as entityname, 		b.batchid, r.rptsernum,  r.GROUNDSOFSUSP from monthly_report.combined_batch_{month} b inner join monthly_str.{month}_report_str r on b.batchid=r.batchid left join  monthly_report.combined_remaster_{month} rr on rr.fiureid=b.fiureid where b.reporttype = 'STR' and (length(r.GROUNDSOFSUSP) + length(r.detailsofinvestigations)) < 500 ")
 
        
        colnames = [desc[0] for desc in cursor.description]
        for row in cursor:
            data.append(row)
insufficient_gos_raw = pd.DataFrame(data,columns=[colnames])

insufficient_gos_raw.columns = [i[0] for i in insufficient_gos_raw.columns]
insufficient_gos_raw = insufficient_gos_raw.reset_index()
insufficient_gos_raw['index'] = insufficient_gos_raw['index']+1
insufficient_gos_raw = insufficient_gos_raw.rename(columns={'index':'sl. no.'})

insufficient_gos_raw.to_csv(output_dir + f'7-RE LIST_INSUFFICIENT_GOS_{month}_RAW.csv')
insufficient_gos_raw.head(2)

,sl. no.,recategory,fiureid,entityname,batchid,rptsernum,groundsofsusp
0,1,BANUC,BAUCB00998,Railway Shramik Sahakari Bank Limited Bikaner,2304111397,15,NOT SUSPICIOUS
1,2,BANUC,BAUCB00998,Railway Shramik Sahakari Bank Limited Bikaner,2304111397,15,NOT SUSPICIOUS

* Validation of Main data and RAW

In [48]:
int(insufficient_gos[['total_batches']].sum()) == len(insufficient_gos_raw[['fiureid']])

False

#### 8. NTR_WITH NON RECEIPTS
* **List of Top REs filing NTRs with Non-Receipts.**

In [49]:
colnames = []
data = []

with conn as connection:
    with connection.cursor() as cursor:
        cursor.execute(f"select fiureid, upper(entityname) as entityname, sum(Non_receipts) as total_Non_receipts from ( select b.fiureid,b.entityname,t.batchid,t.rptsernum,count(distinct t.batchid::text||t.rptsernum::text)as Non_receipts from  monthly_ntr.{month}_arftrn_ntr t inner join monthly_ntr.{month}_batch_ntr b on t.batchid=b.batchid inner join monthly_ntr.{month}_report_ntr r on b.batchid=r.batchid and b.fiureid not in ( 'XXXXX00001', 'XXXXX99999','XXXXXXXXXX') and t.DEBITCREDIT='D' and b.batchid not IN (select originalbatchid from monthly_report.combined_batch_{month} b2 where  batchtype in ('D','R') union select batchid from monthly_report.combined_batch_{month} b2 where  batchtype ='D' ) group by b.fiureid,b.entityname,t.batchid,t.rptsernum order by  Non_receipts desc ) z group by fiureid, entityname order by 3 desc")
 
        
        colnames = [desc[0] for desc in cursor.description]
        for row in cursor:
            data.append(row)
ntr_non_receipts = pd.DataFrame(data,columns=[colnames])

ntr_non_receipts.columns = [i[0] for i in ntr_non_receipts.columns]
ntr_non_receipts = ntr_non_receipts.reset_index()
ntr_non_receipts['index'] = ntr_non_receipts['index']+1
ntr_non_receipts = ntr_non_receipts.rename(columns={'index':'sl. no.'})

ntr_non_receipts.to_csv(output_dir + f'8-NTR_WITH NON RECEIPTS_{month}.csv')
ntr_non_receipts.head(2)

,sl. no.,fiureid,entityname,total_non_receipts
0,1,BARRB00136,MAHARASHTRA GRAMIN BANK,123
1,2,INCOL00004,AXIS ASSET MANAGEMENT COMPANY LIMITED,50

* **RAW Data - NTRs with Non-Receipts**

In [50]:
colnames = []
data = []

with conn as connection:
    with connection.cursor() as cursor:
        cursor.execute(f"select fiureid, entityname, batchid, rptsernum from (select b.fiureid,b.entityname,t.batchid,t.rptsernum,count(distinct t.batchid::text||t.rptsernum::text)as Non_receipts from  monthly_ntr.{month}_arftrn_ntr t inner join monthly_ntr.{month}_batch_ntr b on t.batchid=b.batchid inner join monthly_ntr.{month}_report_ntr r on b.batchid=r.batchid and b.fiureid not in ( 'XXXXX00001', 'XXXXX99999','XXXXXXXXXX') and t.DEBITCREDIT='D' and b.batchid not IN (select originalbatchid from monthly_report.combined_batch_{month} b2 where  batchtype in ('D','R') 					  union 					  select batchid from monthly_report.combined_batch_{month} b2 where  batchtype ='D' ) group by b.fiureid,b.entityname,t.batchid,t.rptsernum order by  Non_receipts desc)z ")
 
        
        colnames = [desc[0] for desc in cursor.description]
        for row in cursor:
            data.append(row)
ntr_non_receipts_raw = pd.DataFrame(data,columns=[colnames])

ntr_non_receipts_raw.columns = [i[0] for i in ntr_non_receipts_raw.columns]
ntr_non_receipts_raw = ntr_non_receipts_raw.reset_index()
ntr_non_receipts_raw['index'] = ntr_non_receipts_raw['index']+1
ntr_non_receipts_raw = ntr_non_receipts_raw.rename(columns={'index':'sl. no.'})

ntr_non_receipts_raw.to_csv(output_dir + f'8-NTR_WITH NON RECEIPTS_{month}_RAW.csv')
ntr_non_receipts_raw.head(2)

   sl. no.     fiureid                   entityname     batchid  rptsernum
0        1  BANUC00518  THE JHUNAGAD CO-OP BANK LTD  2304200538          2
1        2  BANUC00518  THE JHUNAGAD CO-OP BANK LTD  2304200538          3

* Validation

In [51]:
int(ntr_non_receipts[['total_non_receipts']].sum()) == len(ntr_non_receipts_raw[['fiureid']])

True

#### 9. RE LIST_BELOW_THRESHOLD

* **Materialized View - ntr_below_threshold**

In [52]:
ntr_below_threshold = db_conn.execute(f"CREATE MATERIALIZED VIEW IF NOT EXISTS monthly_report.below_threshold_{month} TABLESPACE pg_default AS  SELECT batchid, rptsernum, sum(amount) as amount  FROM monthly_ctr.{month}_arftrn_ctr   group by batchid, rptsernum UNION  SELECT batchid, rptsernum, sum(amount)  as amount  FROM monthly_ntr.{month}_arftrn_ntr group by batchid, rptsernum UNION  SELECT batchid, rptsernum, sum(amountrupees)  as amount FROM monthly_eft.{month}_trftrn_eft group by batchid, rptsernum WITH DATA;  ALTER TABLE IF EXISTS monthly_report.below_threshold_{month} OWNER TO postgres;")

* **9. List of Top REs filing NTRs below threshold values**

In [53]:
colnames = []
data = []

with conn as connection:
    with connection.cursor() as cursor:
        cursor.execute(f"select  fiureid , entityname, sum(case when reporttype='NTR' and Amount < 1000000 then ntr_reports else 0 end) as NTR_Below_Threshold, sum(case when reporttype='NTR' then ntr_reports else 0 end) as Total_NTR_reports from (select upper(coalesce(rr.entityname,b.entityname)) as entityname,b.fiureid, b.reporttype, zz.amount ,count(distinct b.batchid::text||r.rptsernum::text) as ntr_reports  from monthly_ntr.{month}_batch_ntr b inner join monthly_ntr.{month}_report_ntr r on b.batchid = r.batchid and b.batchid not IN (select originalbatchid from monthly_ntr.{month}_batch_ntr b2 where  batchtype in ('D','R') 					  union 					  select batchid from monthly_ntr.{month}_batch_ntr b2 where  batchtype ='D' )  inner join  (select batchid, rptsernum, sum(AMOUNT) as amount from monthly_ntr.{month}_arftrn_ntr group by batchid, rptsernum union select batchid, rptsernum,sum(AMOUNTRUPEES) as amount from monthly_eft.{month}_trftrn_eft group by batchid, rptsernum )zz on r.batchid=zz.batchid and r.rptsernum = zz.RPTSERNUM left join monthly_report.{month}_re_list  rr on rr.fiureid=b.fiureid where b.fiureid not in ( 'XXXXX00001', 'XXXXX99999','XXXXXXXXXX') group by b.fiureid,b.reporttype, zz.amount, upper(coalesce(rr.entityname,b.entityname))  ) zzz  group by fiureid , entityname order by NTR_Below_Threshold desc")
        #cursor.execute(f"with cte1 as (select b.batchid, r.rptsernum, b.fiureid, b.entityname,reporttype  from monthly_ntr.{month}_batch_ntr b 			  inner join monthly_ntr.{month}_report_ntr r on b.batchid = r.batchid 			  where b.fiureid not in ( 'XXXXX00001', 'XXXXX99999','XXXXXXXXXX')  			  and b.batchid not IN (select originalbatchid from monthly_ntr.{month}_batch_ntr where  batchtype in ('D','R') 									union 									select batchid from monthly_ntr.{month}_batch_ntr where  batchtype ='D' ) ), cte2 as (select batchid, rptsernum, sum(AMOUNT) as amount from monthly_ntr.{month}_arftrn_ntr group by batchid, rptsernum 		  union 		  select batchid, rptsernum,sum(AMOUNTRUPEES) as amount 		  from monthly_eft.{month}_trftrn_eft group by batchid, rptsernum ), cte3 as (select c1.fiureid,upper(coalesce(rr.entityname, c1.entityname)) as entityname,c1.batchid,c1.rptsernum,c1.reporttype, c2.amount 		 from cte1 c1 inner join cte2 c2 on c1.batchid = c2.batchid and c1.rptsernum = c2.rptsernum 		 left join monthly_report.{month}_re_list rr on rr.fiureid = c1.fiureid) 		 		 select fiureid, entityname, NTR_Below_Threshold,Total_NTR_reports from (		 		 select fiureid, entityname, 		 sum(case when reporttype='NTR' and amount < 1000000 then ntr_reports else 0 end) as NTR_Below_Threshold, 		 sum(case when reporttype='NTR' then ntr_reports else 0 end) as Total_NTR_reports 		 from (select fiureid, entityname, reporttype, amount, count(distinct batchid::text||rptsernum::text) as ntr_reports 		from cte3 group by fiureid, entityname, reporttype, amount) z group by fiureid, entityname order by 3 desc)zzwhere NTR_Below_Threshold > 0")
        colnames = [desc[0] for desc in cursor.description]
        print(colnames)
        for row in cursor:
            data.append(row)
ntr_below_threshold = pd.DataFrame(data,columns=[colnames])

ntr_below_threshold.columns = [i[0] for i in ntr_below_threshold.columns]
ntr_below_threshold = ntr_below_threshold.reset_index()
ntr_below_threshold['index'] = ntr_below_threshold['index']+1
ntr_below_threshold = ntr_below_threshold.rename(columns={'index':'sl. no.'})
ntr_below_threshold.to_csv(output_dir + f'9-RE LIST_BELOW_THRESHOLD_full_{month}.csv')

ntr_below_threshold_1 = ntr_below_threshold[ntr_below_threshold['ntr_below_threshold']>1]
ntr_below_threshold_1.to_csv(output_dir + f'9-RE LIST_BELOW_THRESHOLD_final_{month}.csv')
ntr_below_threshold_1.head(2)

['fiureid', 'entityname', 'ntr_below_threshold', 'total_ntr_reports']

,sl. no.,fiureid,entityname,ntr_below_threshold,total_ntr_reports
0,1,BASCB00047,PUNJAB NATIONAL BANK,52,9978
1,2,FIHFC00018,HOUSING DEVELOPMENT FINANCE CORPORATION LIMITED,33,925

#### Raw Data

In [54]:
colnames = []
data = []

with conn as connection:
    with connection.cursor() as cursor:        
        cursor.execute(f"with cte1 as (select b.batchid, r.rptsernum, b.fiureid, b.entityname,reporttype from monthly_ntr.{month}_batch_ntr b inner join monthly_ntr.{month}_report_ntr r on b.batchid = r.batchid where b.fiureid not in ( 'XXXXX00001', 'XXXXX99999','XXXXXXXXXX')  and b.batchid not IN (select originalbatchid from monthly_ntr.{month}_batch_ntr where  batchtype in ('D','R') union select batchid from monthly_ntr.{month}_batch_ntr where  batchtype ='D' ) ), cte2 as (select batchid, rptsernum, sum(AMOUNT) as amount from monthly_ntr.{month}_arftrn_ntr group by batchid, rptsernum union select batchid, rptsernum,sum(AMOUNTRUPEES) as amount from monthly_eft.{month}_trftrn_eft group by batchid, rptsernum ), cte3 as (select c1.fiureid,upper(coalesce(rr.entityname, c1.entityname)) as entityname,c1.batchid,c1.rptsernum,c1.reporttype, 	   c2.amount from cte1 c1 inner join cte2 c2 on c1.batchid = c2.batchid and c1.rptsernum = c2.rptsernum left join monthly_report.{month}_re_list rr on rr.fiureid = c1.fiureid ), cte4 as (select fiureid, entityname, batchid, rptsernum,amount from cte3 where reporttype='NTR' ) select * from cte4 where amount <1000000")
        colnames = [desc[0] for desc in cursor.description]
        #print(colnames)
        for row in cursor:
            data.append(row)
ntr_below_threshold_raw = pd.DataFrame(data,columns=[colnames])

ntr_below_threshold_raw.columns = [i[0] for i in ntr_below_threshold_raw.columns]
ntr_below_threshold_raw = ntr_below_threshold_raw.reset_index()
ntr_below_threshold_raw['index'] = ntr_below_threshold_raw['index']+1
ntr_below_threshold_raw = ntr_below_threshold_raw.rename(columns={'index':'sl. no.'})

ntr_below_threshold_raw.to_csv(output_dir + f'9-RE LIST_BELOW_THRESHOLD_{month}_RAW.csv')
ntr_below_threshold_raw.head(2)

,sl. no.,fiureid,entityname,batchid,rptsernum,amount
0,1,BAUCB01864,MEHSANA URBAN CO-OP BANK LIMITED,2304109670,162042,481820
1,2,BAUCB01864,MEHSANA URBAN CO-OP BANK LIMITED,2304109670,162042,481820

* Validation of main file and RAW data

In [55]:
int(ntr_below_threshold[['ntr_below_threshold']].sum()) == ntr_below_threshold_raw[['rptsernum']].count()

rptsernum    False
dtype: bool

### EFT Anomalies

#### Materialized View Creation

In [56]:
eft_anomalies_9a = db_conn.execute(f"CREATE MATERIALIZED VIEW IF NOT EXISTS monthly_eft.{month}_eft_anamoly_9a TABLESPACE pg_default AS  \
                    SELECT * FROM monthly_eft.{month}_trftrn_eft WHERE (({month}_trftrn_eft.batchid, {month}_trftrn_eft.rptsernum, \
                    {month}_trftrn_eft.transactionrefnum) IN (SELECT DISTINCT {month}_trftrn_eft_1.batchid, {month}_trftrn_eft_1.rptsernum, \
                    {month}_trftrn_eft_1.transactionrefnum FROM monthly_eft.{month}_trftrn_eft {month}_trftrn_eft_1 \
                    WHERE {month}_trftrn_eft_1.tytype_in = 0)) WITH DATA;")
print(f"Materialized view created : monthly_report.eft_anomalies_9a_{month}")

Materialized view created : monthly_report.eft_anomalies_9a_apr23

In [57]:
eft_anomalies_9b = db_conn.execute( f"CREATE MATERIALIZED VIEW IF NOT EXISTS monthly_eft.{month}_eft_anamoly_9b TABLESPACE pg_default AS\
                    SELECT * FROM monthly_eft.{month}_trftrn_eft WHERE (({month}_trftrn_eft.batchid, {month}_trftrn_eft.rptsernum, {month}_trftrn_eft.transactionrefnum) IN\
                    (SELECT {month}_trftrn_eft.batchid, {month}_trftrn_eft.rptsernum,{month}_trftrn_eft.transactionrefnum \
                    WHERE {month}_trftrn_eft.amountrupees = {month}_trftrn_eft.amountforeigncurrency AND {month}_trftrn_eft.currencyoftransaction <> 'INR'::text))  WITH DATA; ")
print(f"Materialized view created : monthly_report.eft_anomalies_9b_{month}")

Materialized view created : monthly_report.eft_anomalies_9b_apr23

In [58]:
eft_anomalies_9c =db_conn.execute(f"CREATE MATERIALIZED VIEW IF NOT EXISTS monthly_eft.{month}_eft_anamoly_9c TABLESPACE pg_default AS\
                    SELECT * FROM monthly_eft.{month}_trftrn_eft WHERE (({month}_trftrn_eft.batchid, {month}_trftrn_eft.rptsernum, {month}_trftrn_eft.transactionrefnum) IN\
                    (SELECT DISTINCT {month}_trftrn_eft_1.batchid, {month}_trftrn_eft_1.rptsernum,{month}_trftrn_eft_1.transactionrefnum\
                    FROM monthly_eft.{month}_trftrn_eft {month}_trftrn_eft_1 WHERE {month}_trftrn_eft_1.country_in = 0))  WITH DATA; ")
print(f"Materialized view created : monthly_report.eft_anomalies_9c_{month}")

Materialized view created : monthly_report.eft_anomalies_9c_apr23

In [59]:
eft_anomalies_9d = db_conn.execute(f"CREATE MATERIALIZED VIEW IF NOT EXISTS monthly_eft.{month}_eft_anamoly_9d TABLESPACE pg_default AS\
                    SELECT * FROM monthly_eft.{month}_trftrn_eft WHERE (({month}_trftrn_eft.batchid, {month}_trftrn_eft.rptsernum, {month}_trftrn_eft.transactionrefnum) IN\
                    (SELECT DISTINCT {month}_trftrn_eft_1.batchid,{month}_trftrn_eft_1.rptsernum,{month}_trftrn_eft_1.transactionrefnum  FROM monthly_eft.{month}_trftrn_eft {month}_trftrn_eft_1\
                    WHERE {month}_trftrn_eft_1.identificationnum IS NULL AND {month}_trftrn_eft_1.accountnum IS NULL)) with data")
print(f"Materialized view created : monthly_report.eft_anomalies_9d_{month}")

Materialized view created : monthly_report.eft_anomalies_9d_apr23

In [60]:
eft_anomalies_9e = db_conn.execute(f"CREATE MATERIALIZED VIEW IF NOT EXISTS monthly_eft.{month}_eft_anamoly_9e TABLESPACE pg_default AS\
                    SELECT * FROM monthly_eft.{month}_trftrn_eft WHERE (({month}_trftrn_eft.batchid, {month}_trftrn_eft.rptsernum, {month}_trftrn_eft.transactionrefnum) IN\
                    (SELECT DISTINCT a.batchid, a.rptsernum, a.transactionrefnum FROM monthly_eft.{month}_trftrn_eft a \
                    WHERE a.transactioncountrycode = 'IN'::text AND (a.transactionstatecode = 'XX'::text OR a.transactionstatecode IS NULL))) with data")
print(f"Materialized view created : monthly_report.eft_anomalies_9e_{month}")

Materialized view created : monthly_report.eft_anomalies_9e_apr23

In [61]:
eft_anomalies_9f = db_conn.execute(f"CREATE MATERIALIZED VIEW IF NOT EXISTS monthly_eft.{month}_eft_anamoly_9f TABLESPACE pg_default AS\
                    SELECT * FROM monthly_eft.{month}_trftrn_eft WHERE (({month}_trftrn_eft.batchid, {month}_trftrn_eft.rptsernum, {month}_trftrn_eft.transactionrefnum) IN\
                    (SELECT DISTINCT a.batchid,a.rptsernum,a.transactionrefnum FROM monthly_eft.{month}_trftrn_eft a\
                    WHERE a.amountrupees < 500000 AND a.tytype_in = 0 AND a.country_in = 1)) with data")
print(f"Materialized view created : monthly_report.eft_anomalies_9f_{month}")

Materialized view created : monthly_report.eft_anomalies_9f_apr23

In [62]:
eft_anomalies_9f_p = db_conn.execute(f"CREATE MATERIALIZED VIEW IF NOT EXISTS monthly_eft.{month}_eft_anamoly_9f_p TABLESPACE pg_default AS  \
                        SELECT * FROM monthly_eft.{month}_trftrn_eft WHERE (({month}_trftrn_eft.batchid, {month}_trftrn_eft.rptsernum, \
                        {month}_trftrn_eft.transactionrefnum) IN\
                        (SELECT a.batchid, a.rptsernum, a.transactionrefnum FROM monthly_eft.{month}_trftrn_eft a WHERE a.transactiontype = 'P'::text \
                        GROUP BY a.batchid, a.rptsernum, a.transactionrefnum HAVING sum(a.amountrupees) < 500000::numeric)) \
                        ORDER BY {month}_trftrn_eft.batchid, {month}_trftrn_eft.rptsernum, {month}_trftrn_eft.transactionrefnum WITH DATA;")
print(f"Materialized view created : monthly_report.eft_anomalies_9f_p_{month}")

Materialized view created : monthly_report.eft_anomalies_9f_p_apr23

In [63]:
eft_anomalies_9f_r = db_conn.execute(f"CREATE MATERIALIZED VIEW IF NOT EXISTS monthly_eft.{month}_eft_anamoly_9f_r TABLESPACE pg_default AS\
                        SELECT *  FROM monthly_eft.{month}_trftrn_eft   WHERE (({month}_trftrn_eft.batchid, {month}_trftrn_eft.rptsernum, {month}_trftrn_eft.transactionrefnum) IN\
                        (SELECT a.batchid,a.rptsernum, a.transactionrefnum FROM monthly_eft.{month}_trftrn_eft a \
                        WHERE a.transactiontype = 'R'::text GROUP BY a.batchid, a.rptsernum, a.transactionrefnum HAVING sum(a.amountrupees) < 500000::numeric))\
                        ORDER BY {month}_trftrn_eft.batchid, {month}_trftrn_eft.rptsernum, {month}_trftrn_eft.transactionrefnum WITH DATA;")
print(f"Materialized view created : monthly_report.eft_anomalies_9f_r_{month}")

Materialized view created : monthly_report.eft_anomalies_9f_r_apr23

##### 9a. Each transaction needs to necessarily have P & R and it was observed CBQTRs having single Transaction type only 'P' or 'R' ( Purchase and Redemption)

In [64]:
colnames = []
data = []

with conn as connection:
    with connection.cursor() as cursor:        
        cursor.execute(f"with cte1 as (select y.fiureid,  count(distinct x.batchid::text || rptsernum::text) total_efts  from monthly_eft.mar23_trftrn_eft x  inner join monthly_eft.mar23_batch_eft y on  x.batchid = y.batchid  group by fiureid order by 2 desc ), cte2 as ( select b.fiureid, count(distinct a.batchid::text || a.rptsernum::text) anamoly_efts from monthly_eft.mar23_eft_anamoly_9a a inner join monthly_eft.mar23_batch_eft b on  a.batchid = b.batchid group by fiureid ), cte3 as ( select c1.fiureid, total_efts, anamoly_efts from     cte1 c1 inner join cte2 c2 on c1.fiureid = c2.fiureid       )  select c3.fiureid, c4.entityname entity_name, c3.total_efts, c3.anamoly_efts from cte3 c3 inner join  monthly_report.combined_remaster_mar23 c4 on c3.fiureid = c4.fiureid --group by c3.fiureid, entity_name order by 3 desc")
        colnames = [desc[0] for desc in cursor.description]
        #print(colnames)
        for row in cursor:
            data.append(row)
eft_anolamy_9a = pd.DataFrame(data,columns=[colnames])

In [65]:
eft_anolamy_9a.columns = [i[0] for i in eft_anolamy_9a.columns]
eft_anolamy_9a = eft_anolamy_9a.sort_values('anamoly_efts',ascending= False).reset_index()

eft_anolamy_9a['index'] = eft_anolamy_9a['index']+1
eft_anolamy_9a = eft_anolamy_9a.rename(columns={'index':'sl. no.'})
eft_anolamy_9a = eft_anolamy_9a.reset_index()

eft_anolamy_9a = eft_anolamy_9a[['index','fiureid','entity_name','total_efts','anamoly_efts']]
eft_anolamy_9a['index'] = eft_anolamy_9a['index']+1
eft_anolamy_9a = eft_anolamy_9a.rename(columns={'index':'sl. no.'})

eft_anolamy_9a.to_csv(output_dir + f'EFT_Anamoly_9-a_{month}.csv')
eft_anolamy_9a.head(5)

,sl. no.,fiureid,entity_name,total_efts,anamoly_efts
0,1,BASCB00058,Union Bank Of India,6737,4655
1,2,BASCB00003,American Express Banking Corporation,2604,2604
2,3,BASCB00117,KEB Hana Bank,652,652
3,4,BASCB00009,Bank Of Bahrain & Kuwait,619,619
4,5,BASCB00101,Australia and New Zealand Banking Group Limited,1864,589

##### 9b. There were cases when both amount in INR and amount in foreign currency were equal which means proper conversion to foreign currency was not done

In [66]:
colnames = []
data = []

with conn as connection:
    with connection.cursor() as cursor:        
        cursor.execute(f"with cte1 as (select y.fiureid,  count(distinct x.batchid::text || rptsernum::text) total_efts  from monthly_eft.mar23_trftrn_eft x  inner join monthly_eft.mar23_batch_eft y on  x.batchid = y.batchid  group by fiureid ), cte2 as ( select b.fiureid, count(distinct a.batchid::text || a.rptsernum::text) anamoly_efts from monthly_eft.mar23_eft_anamoly_9b a inner join monthly_eft.mar23_batch_eft b on  a.batchid = b.batchid group by fiureid ), cte3 as ( select c1.fiureid, total_efts, anamoly_efts from     cte1 c1 inner join cte2 c2 on c1.fiureid = c2.fiureid       )  select c3.fiureid, c4.entityname entity_name, c3.total_efts, c3.anamoly_efts from cte3 c3 inner join  monthly_report.combined_remaster_mar23 c4 on c3.fiureid = c4.fiureid --group by c3.fiureid, entity_name order by 3 desc")
        colnames = [desc[0] for desc in cursor.description]
        #print(colnames)
        for row in cursor:
            data.append(row)
eft_anolamy_9b = pd.DataFrame(data,columns=[colnames])

In [67]:
eft_anolamy_9b.columns = [i[0] for i in eft_anolamy_9b.columns]
eft_anolamy_9b = eft_anolamy_9b.sort_values('anamoly_efts',ascending= False).reset_index()

eft_anolamy_9b['index'] = eft_anolamy_9b['index']+1
eft_anolamy_9b = eft_anolamy_9b.rename(columns={'index':'sl. no.'})
eft_anolamy_9b = eft_anolamy_9b.reset_index()

eft_anolamy_9b = eft_anolamy_9b[['index','fiureid','entity_name','total_efts','anamoly_efts']]
eft_anolamy_9b['index'] = eft_anolamy_9b['index']+1
eft_anolamy_9b = eft_anolamy_9b.rename(columns={'index':'sl. no.'})

eft_anolamy_9b.to_csv(output_dir + f'EFT_Anamoly_9-b_{month}.csv')
eft_anolamy_9b.head(5)

,sl. no.,fiureid,entity_name,total_efts,anamoly_efts
0,1,BASCB00068,DHANLAXMI BANK LIMITED,228,85
1,2,BASCB00089,Yes Bank Limited,48523,19
2,3,BASCB00043,Indian Bank,4440,11
3,4,BASCB00075,Industrial Development Bank Of India Limited,7634,7
4,5,BASCB00072,ICICI Bank Limited,368752,6

##### 9c. CBWTRs filed with transaction country code only 'IN' or no 'IN' counterpart

In [68]:
colnames = []
data = []

with conn as connection:
    with connection.cursor() as cursor:        
        cursor.execute(f"with cte1 as (select y.fiureid,  count(distinct x.batchid::text || rptsernum::text) total_efts  from monthly_eft.mar23_trftrn_eft x  inner join monthly_eft.mar23_batch_eft y on  x.batchid = y.batchid  group by fiureid ), cte2 as ( select b.fiureid, count(distinct a.batchid::text || a.rptsernum::text) anamoly_efts from monthly_eft.mar23_eft_anamoly_9c a inner join monthly_eft.mar23_batch_eft b on  a.batchid = b.batchid group by fiureid ), cte3 as ( select c1.fiureid, total_efts, anamoly_efts from     cte1 c1 inner join cte2 c2 on c1.fiureid = c2.fiureid       )  select c3.fiureid, c4.entityname entity_name, c3.total_efts, c3.anamoly_efts from cte3 c3 inner join  monthly_report.combined_remaster_mar23 c4 on c3.fiureid = c4.fiureid --group by c3.fiureid, entity_name order by 3 desc")
        colnames = [desc[0] for desc in cursor.description]
        #print(colnames)
        for row in cursor:
            data.append(row)
eft_anolamy_9c = pd.DataFrame(data,columns=[colnames])

In [69]:
eft_anolamy_9c.columns = [i[0] for i in eft_anolamy_9c.columns]
eft_anolamy_9c = eft_anolamy_9c.sort_values('anamoly_efts',ascending= False)

eft_anolamy_9c = eft_anolamy_9c.reset_index()
eft_anolamy_9c['index'] = eft_anolamy_9c['index'] + 1
eft_anolamy_9c = eft_anolamy_9c.rename(columns={'index':'sl. no.'})

In [70]:
eft_anolamy_9c = eft_anolamy_9c.reset_index()
eft_anolamy_9c = eft_anolamy_9c[['index','fiureid','entity_name','total_efts','anamoly_efts']]
eft_anolamy_9c['index'] = eft_anolamy_9c['index']+1
eft_anolamy_9c = eft_anolamy_9c.rename(columns={'index':'sl. no.'})

eft_anolamy_9c.to_csv(output_dir + f'EFT_Anamoly_9-c_{month}.csv')
eft_anolamy_9c.head(5)

,sl. no.,fiureid,entity_name,total_efts,anamoly_efts
0,1,BASCB00072,ICICI Bank Limited,368752,120439
1,2,BASCB00089,Yes Bank Limited,48523,37858
2,3,BASCB00058,Union Bank Of India,6737,4699
3,4,BASCB00003,American Express Banking Corporation,2604,2604
4,5,BASCB00087,Tamilnad Mercantile Bank Limited,2363,2363

##### 9d. Cases where REs have not reported both account number and identification number

In [71]:
colnames = []
data = []

with conn as connection:
    with connection.cursor() as cursor:        
        cursor.execute(f"with cte1 as (select y.fiureid,  count(distinct x.batchid::text || rptsernum::text) total_efts  from monthly_eft.mar23_trftrn_eft x  inner join monthly_eft.mar23_batch_eft y on  x.batchid = y.batchid  group by fiureid ), cte2 as ( select b.fiureid, count(distinct a.batchid::text || a.rptsernum::text) anamoly_efts from monthly_eft.mar23_eft_anamoly_9d a inner join monthly_eft.mar23_batch_eft b on  a.batchid = b.batchid group by fiureid ), cte3 as ( select c1.fiureid, total_efts, anamoly_efts from     cte1 c1 inner join cte2 c2 on c1.fiureid = c2.fiureid       )  select c3.fiureid, c4.entityname entity_name, c3.total_efts, c3.anamoly_efts from cte3 c3 inner join  monthly_report.combined_remaster_mar23 c4 on c3.fiureid = c4.fiureid --group by c3.fiureid, entity_name order by 3 desc")
        colnames = [desc[0] for desc in cursor.description]
        #print(colnames)
        for row in cursor:
            data.append(row)
eft_anolamy_9d = pd.DataFrame(data,columns=[colnames])

In [72]:
eft_anolamy_9d.columns = [i[0] for i in eft_anolamy_9d.columns]
eft_anolamy_9d = eft_anolamy_9d.sort_values('anamoly_efts',ascending= False).reset_index()

In [73]:
eft_anolamy_9d['index'] = eft_anolamy_9d['index']+1
eft_anolamy_9d = eft_anolamy_9d.rename(columns={'index':'sl. no.'})
eft_anolamy_9d = eft_anolamy_9d.reset_index()

In [74]:
eft_anolamy_9d = eft_anolamy_9d[['index','fiureid','entity_name','total_efts','anamoly_efts']]
eft_anolamy_9d['index'] = eft_anolamy_9d['index']+1
eft_anolamy_9d = eft_anolamy_9d.rename(columns={'index':'sl. no.'})

eft_anolamy_9d.to_csv(output_dir + f'EFT_Anamoly_9-d_{month}.csv')
eft_anolamy_9d.head(5)

,sl. no.,fiureid,entity_name,total_efts,anamoly_efts
0,1,BASCB00047,Punjab National Bank,24576,15978
1,2,BASCB00061,Axis Bank,62267,14946
2,3,BASCB00089,Yes Bank Limited,48523,13697
3,4,BASCB00069,The Federal Bank Ltd,15846,7895
4,5,BASCB00083,RBL Bank Ltd(Formerly The Ratnakar Bank Limited),10925,5382

##### 9e. Cases where REs have not reported transaction state for Indian legs of transactions and used 'XX' instead

In [75]:
colnames = []
data = []

with conn as connection:
    with connection.cursor() as cursor:        
        cursor.execute(f"with cte1 as (select y.fiureid,  count(distinct x.batchid::text || rptsernum::text) total_efts  from monthly_eft.mar23_trftrn_eft x  inner join monthly_eft.mar23_batch_eft y on  x.batchid = y.batchid  group by fiureid ), cte2 as ( select b.fiureid, count(distinct a.batchid::text || a.rptsernum::text) anamoly_efts from monthly_eft.mar23_eft_anamoly_9e a inner join monthly_eft.mar23_batch_eft b on  a.batchid = b.batchid group by fiureid ), cte3 as ( select c1.fiureid, total_efts, anamoly_efts from     cte1 c1 inner join cte2 c2 on c1.fiureid = c2.fiureid       )  select c3.fiureid, c4.entityname entity_name, c3.total_efts, c3.anamoly_efts from cte3 c3 inner join  monthly_report.combined_remaster_mar23 c4 on c3.fiureid = c4.fiureid --group by c3.fiureid, entity_name order by 3 desc")
        colnames = [desc[0] for desc in cursor.description]
        #print(colnames)
        for row in cursor:
            data.append(row)
eft_anolamy_9e = pd.DataFrame(data,columns=[colnames])

In [76]:
eft_anolamy_9e.columns = [i[0] for i in eft_anolamy_9e.columns]
eft_anolamy_9e = eft_anolamy_9e.sort_values('anamoly_efts',ascending= False)
eft_anolamy_9e = eft_anolamy_9e.reset_index()
eft_anolamy_9e['index'] = eft_anolamy_9e['index']+1
eft_anolamy_9e = eft_anolamy_9e.reset_index()
eft_anolamy_9e['index'] = eft_anolamy_9e['index']+1
eft_anolamy_9e['level_0'] = eft_anolamy_9e['level_0']+1
eft_anolamy_9e = eft_anolamy_9e.rename(columns={'level_0':'sl. no.'})
eft_anolamy_9e = eft_anolamy_9e[['sl. no.','fiureid','entity_name','total_efts','anamoly_efts']]
eft_anolamy_9e.to_csv(output_dir + f'EFT_Anamoly_9-e_{month}.csv')
eft_anolamy_9e.head(5)

   sl. no.     fiureid                entity_name  total_efts  anamoly_efts
0        1  BASCB00072         ICICI Bank Limited      368752         19409
1        2  BASCB00069       The Federal Bank Ltd       15846          6050
2        3  BASCB00043                Indian Bank        4440          4440
3        4  BASCB00086  South Indian Bank Limited        6947          3185
4        5  BASCB00061                  Axis Bank       62267          1852

##### 9f. Cases where amount reported less than 5 Lakhs

##### Purchase (P)

In [77]:
colnames = []
data = []

with conn as connection:
    with connection.cursor() as cursor:        
        cursor.execute(f"with cte1 as (select y.fiureid,  count(distinct x.batchid::text || rptsernum::text) total_efts  from monthly_eft.mar23_trftrn_eft x  inner join monthly_eft.mar23_batch_eft y on  x.batchid = y.batchid  group by fiureid ), cte2 as ( select b.fiureid, count(distinct a.batchid::text || a.rptsernum::text) anamoly_efts from monthly_eft.mar23_eft_anamoly_9f_p a inner join monthly_eft.mar23_batch_eft b on  a.batchid = b.batchid group by fiureid ), cte3 as ( select c1.fiureid, total_efts, anamoly_efts from     cte1 c1 inner join cte2 c2 on c1.fiureid = c2.fiureid       )  select c3.fiureid, c4.entityname entity_name, c3.total_efts, c3.anamoly_efts from cte3 c3 inner join  monthly_report.combined_remaster_mar23 c4 on c3.fiureid = c4.fiureid --group by c3.fiureid, entity_name order by 3 desc")
        colnames = [desc[0] for desc in cursor.description]
        #print(colnames)
        for row in cursor:
            data.append(row)
eft_anolamy_9f_P = pd.DataFrame(data,columns=[colnames])
eft_anolamy_9f_P.to_csv(output_dir + f'EFT_Anamoly_9-f_{month}_P.csv')
eft_anolamy_9f_P.head()

,fiureid,entity_name,total_efts,anamoly_efts
0,BASCB00008,Bank of America National Association,17223,43
1,BASCB00015,Citibank N A,11796,219
2,BASCB00019,Hongkong and Shanghai Banking Coporation Limit...,16579,1
3,BASCB00089,Yes Bank Limited,48523,1
4,BASCB00120,Doha Bank Q P S C,553,12

In [78]:
eft_anolamy_9f_P.columns = [i[0] for i in eft_anolamy_9f_P.columns]
eft_anolamy_9f_P = eft_anolamy_9f_P.sort_values('anamoly_efts',ascending= False)
eft_anolamy_9f_P = eft_anolamy_9f_P.reset_index()
#eft_anolamy_9f_P['index'] = eft_anolamy_9f_P['index']+1
eft_anolamy_9f_P = eft_anolamy_9f_P.reset_index()
eft_anolamy_9f_P['index'] = eft_anolamy_9f_P['index']+1
eft_anolamy_9f_P['level_0'] = eft_anolamy_9f_P['level_0']+1
eft_anolamy_9f_P = eft_anolamy_9f_P.rename(columns={'level_0':'sl. no.'})
eft_anolamy_9f_P = eft_anolamy_9f_P[['sl. no.','fiureid','entity_name','total_efts','anamoly_efts']]
eft_anolamy_9f_P.to_csv(output_dir + f'EFT_Anamoly_9-e_{month}.csv')
eft_anolamy_9f_P.head(5)

,sl. no.,fiureid,entity_name,total_efts,anamoly_efts
0,1,BASCB00015,Citibank N A,11796,219
1,2,BASCB00008,Bank of America National Association,17223,43
2,3,BASCB00120,Doha Bank Q P S C,553,12
3,4,BASCB00019,Hongkong and Shanghai Banking Coporation Limit...,16579,1
4,5,BASCB00089,Yes Bank Limited,48523,1

##### Redemption (R)

In [79]:
colnames = []
data = []

with conn as connection:
    with connection.cursor() as cursor:        
        cursor.execute(f"with cte1 as (select y.fiureid,  count(distinct x.batchid::text || rptsernum::text) total_efts  from monthly_eft.mar23_trftrn_eft x  inner join monthly_eft.mar23_batch_eft y on  x.batchid = y.batchid  group by fiureid ), cte2 as ( select b.fiureid, count(distinct a.batchid::text || a.rptsernum::text) anamoly_efts from monthly_eft.mar23_eft_anamoly_9f_r a inner join monthly_eft.mar23_batch_eft b on  a.batchid = b.batchid group by fiureid ), cte3 as ( select c1.fiureid, total_efts, anamoly_efts from     cte1 c1 inner join cte2 c2 on c1.fiureid = c2.fiureid       )  select c3.fiureid, c4.entityname entity_name, c3.total_efts, c3.anamoly_efts from cte3 c3 inner join  monthly_report.combined_remaster_mar23 c4 on c3.fiureid = c4.fiureid --group by c3.fiureid, entity_name order by 3 desc")
        colnames = [desc[0] for desc in cursor.description]
        #print(colnames)
        for row in cursor:
            data.append(row)
eft_anolamy_9f_R = pd.DataFrame(data,columns=[colnames])

In [80]:
eft_anolamy_9f_R.head()

,fiureid,entity_name,total_efts,anamoly_efts
0,BASCB00008,Bank of America National Association,17223,43
1,BASCB00015,Citibank N A,11796,219
2,BASCB00019,Hongkong and Shanghai Banking Coporation Limit...,16579,1
3,BASCB00089,Yes Bank Limited,48523,1
4,BASCB00120,Doha Bank Q P S C,553,12

In [81]:
eft_anolamy_9f_R.columns = [i[0] for i in eft_anolamy_9f_R.columns]
eft_anolamy_9f_R = eft_anolamy_9f_R.sort_values('anamoly_efts',ascending= False)
eft_anolamy_9f_R = eft_anolamy_9f_R.reset_index()
#eft_anolamy_9f_P['index'] = eft_anolamy_9f_P['index']+1
eft_anolamy_9f_R = eft_anolamy_9f_R.reset_index()
eft_anolamy_9f_R['index'] = eft_anolamy_9f_R['index']+1
eft_anolamy_9f_R['level_0'] = eft_anolamy_9f_R['level_0']+1
eft_anolamy_9f_R = eft_anolamy_9f_R.rename(columns={'level_0':'sl. no.'})
eft_anolamy_9f_R = eft_anolamy_9f_R[['sl. no.','fiureid','entity_name','total_efts','anamoly_efts']]
eft_anolamy_9f_R.to_csv(output_dir + f'EFT_Anamoly_9-e_{month}.csv')
eft_anolamy_9f_R.head(5)

,sl. no.,fiureid,entity_name,total_efts,anamoly_efts
0,1,FIAPR00122,Thomas Cook,1349,1349
1,2,BASCB00015,Citibank N A,11796,219
2,3,BASCB00008,Bank of America National Association,17223,43
3,4,BASCB00120,Doha Bank Q P S C,553,12
4,5,BASCB00019,Hongkong and Shanghai Banking Coporation Limit...,16579,1

### RAW Data for EFT Anomalies

###### 9a. Report with single transaction type either only P (Purchase) or only R (Redemption)

In [82]:
colnames = []
data = []

with conn as connection:
    with connection.cursor() as cursor:        
        cursor.execute(f"with cte1 as ( SELECT * FROM monthly_eft.{month}_eft_anamoly_9a  ), \
                       cte2 as ( select batchid,a.fiureid, coalesce(a.entityname,b.entityname) as entityname \
                       from monthly_eft.{month}_batch_eft a \
                       inner join monthly_report.combined_remaster_{month} b on a.fiureid = b.fiureid)\
                       select c1.batchid,c2.fiureid, c2.entityname, c1.* \
                       from cte1 c1 inner join cte2 c2 on c1. batchid = c2.batchid")
        colnames = [desc[0] for desc in cursor.description]
        #print(colnames)
        for row in cursor:
            data.append(row)
eft_anolamy_9a_raw = pd.DataFrame(data,columns=[colnames])

eft_anolamy_9a_raw.columns = [i[0] for i in eft_anolamy_9a_raw.columns]
eft_anolamy_9a_raw = eft_anolamy_9a_raw.iloc[:,1:]
eft_anolamy_9a_raw.to_csv(output_dir + f'EFT_Anamoly_9a_{month}_RAW.csv')
eft_anolamy_9a_raw.shape[0]

0

* <b>Cross Validation of Raw Data</b>

In [83]:
int(eft_anolamy_9a['anamoly_efts'].sum()) == ((eft_anolamy_9a_raw['batchid'].astype(str) + eft_anolamy_9a_raw['rptsernum'].astype(str)).nunique())

False

###### 9b - EFTs with same amount in INR and foreign currency

In [84]:
colnames = []
data = []

with conn as connection:
    with connection.cursor() as cursor:        
        cursor.execute(f"with cte1 as ( SELECT * FROM monthly_eft.{month}_eft_anamoly_9b  ), \
                       cte2 as ( select batchid,a.fiureid, coalesce(a.entityname,b.entityname) as entityname \
                       from monthly_eft.{month}_batch_eft a \
                       inner join monthly_report.combined_remaster_{month} b on a.fiureid = b.fiureid)\
                       select c1.batchid,c2.fiureid, c2.entityname, c1.* \
                       from cte1 c1 inner join cte2 c2 on c1. batchid = c2.batchid")
        colnames = [desc[0] for desc in cursor.description]
        #print(colnames)
        for row in cursor:
            data.append(row)
eft_anolamy_9b_raw = pd.DataFrame(data,columns=[colnames])
eft_anolamy_9b_raw.columns = [i[0] for i in eft_anolamy_9b_raw.columns]
eft_anolamy_9b_raw = eft_anolamy_9b_raw.iloc[:,1:]
eft_anolamy_9b_raw.to_csv(output_dir + f'EFT_Anamoly_9b_{month}_RAW.csv')
eft_anolamy_9b_raw.shape[0]

0

* <b>Cross Validation of Raw Data</b>

In [85]:
int(eft_anolamy_9b['anamoly_efts'].sum()) == ((eft_anolamy_9b_raw['batchid'].astype(str) + eft_anolamy_9b_raw['rptsernum'].astype(str)).nunique())

False

###### 9c - EFTs with transaction Country only IN (India) or no IN counterpart

In [86]:
#### 9c
colnames = []
data = []

with conn as connection:
    with connection.cursor() as cursor:        
        cursor.execute(f"with cte1 as ( SELECT * FROM monthly_eft.{month}_eft_anamoly_9c  ), \
                       cte2 as ( select batchid,a.fiureid, coalesce(a.entityname,b.entityname) as entityname \
                       from monthly_eft.{month}_batch_eft a \
                       inner join monthly_report.combined_remaster_{month} b on a.fiureid = b.fiureid)\
                       select c1.batchid,c2.fiureid, c2.entityname, c1.* \
                       from cte1 c1 inner join cte2 c2 on c1. batchid = c2.batchid")
        colnames = [desc[0] for desc in cursor.description]
        #print(colnames)
        for row in cursor:
            data.append(row)
eft_anolamy_9c_raw = pd.DataFrame(data,columns=[colnames])
eft_anolamy_9c_raw.columns = [i[0] for i in eft_anolamy_9c_raw.columns]
eft_anolamy_9c_raw = eft_anolamy_9c_raw.iloc[:,1:]
eft_anolamy_9c_raw.to_csv(output_dir + f'EFT_Anamoly_9c_{month}_RAW.csv')
eft_anolamy_9c_raw.shape[0]

0

* <b>Cross Validation of Raw Data</b>

In [87]:
int(eft_anolamy_9c['anamoly_efts'].sum()) == ((eft_anolamy_9c_raw['batchid'].astype(str) + eft_anolamy_9c_raw['rptsernum'].astype(str)).nunique())

False

###### 9d - EFTs with missing account number or Identification number

In [88]:
#### 9d
colnames = []
data = []

with conn as connection:
    with connection.cursor() as cursor:        
        cursor.execute(f"with cte1 as ( SELECT * FROM monthly_eft.{month}_eft_anamoly_9d  ), \
                       cte2 as ( select batchid,a.fiureid, coalesce(a.entityname,b.entityname) as entityname \
                       from monthly_eft.{month}_batch_eft a \
                       inner join monthly_report.combined_remaster_{month} b on a.fiureid = b.fiureid)\
                       select c1.batchid,c2.fiureid, c2.entityname, c1.* \
                       from cte1 c1 inner join cte2 c2 on c1. batchid = c2.batchid")
        colnames = [desc[0] for desc in cursor.description]
        #print(colnames)
        for row in cursor:
            data.append(row)
eft_anolamy_9d_raw = pd.DataFrame(data,columns=[colnames])
eft_anolamy_9d_raw.columns = [i[0] for i in eft_anolamy_9d_raw.columns]
eft_anolamy_9d_raw = eft_anolamy_9d_raw.iloc[:,1:]
eft_anolamy_9d_raw.to_csv(output_dir + f'EFT_Anamoly_9d_{month}_RAW.csv')
eft_anolamy_9d_raw.shape[0]

0

* <b>Cross Validation of Raw Data</b>

In [89]:
int(eft_anolamy_9d['anamoly_efts'].sum()) == ((eft_anolamy_9d_raw['batchid'].astype(str) + eft_anolamy_9d_raw['rptsernum'].astype(str)).nunique())

False

###### 9e - EFTs with missing transaction state code for Indian legs

In [90]:
colnames = []
data = []

with conn as connection:
    with connection.cursor() as cursor:        
        cursor.execute(f"with cte1 as ( SELECT * FROM monthly_eft.{month}_eft_anamoly_9e  ), \
                       cte2 as ( select batchid,a.fiureid, coalesce(a.entityname,b.entityname) as entityname \
                       from monthly_eft.{month}_batch_eft a \
                       inner join monthly_report.combined_remaster_{month} b on a.fiureid = b.fiureid)\
                       select c1.batchid,c2.fiureid, c2.entityname, c1.* \
                       from cte1 c1 inner join cte2 c2 on c1. batchid = c2.batchid")
        colnames = [desc[0] for desc in cursor.description]
        #print(colnames)
        for row in cursor:
            data.append(row)
eft_anolamy_9e_raw = pd.DataFrame(data,columns=[colnames])
eft_anolamy_9e_raw.columns = [i[0] for i in eft_anolamy_9e_raw.columns]
eft_anolamy_9e_raw = eft_anolamy_9e_raw.iloc[:,1:]
eft_anolamy_9e_raw.to_csv(output_dir + f'EFT_Anamoly_9e_{month}_R_RAW.csv')
eft_anolamy_9e_raw.shape[0]

0

* <b>Cross Validation of Raw Data</b>

In [91]:
int(eft_anolamy_9e['anamoly_efts'].sum()) == ((eft_anolamy_9e_raw['batchid'].astype(str) + eft_anolamy_9e_raw['rptsernum'].astype(str)).nunique())

False

###### 9f_P - EFTs with Inward/Outward Amount less than 5 lakhs - PURCHASE

In [92]:
colnames = []
data = []

with conn as connection:
    with connection.cursor() as cursor:        
        cursor.execute(f"with cte1 as ( SELECT * FROM monthly_eft.{month}_eft_anamoly_9f_P  ), \
                       cte2 as ( select batchid,a.fiureid, coalesce(a.entityname,b.entityname) as entityname \
                       from monthly_eft.{month}_batch_eft a \
                       inner join monthly_report.combined_remaster_{month} b on a.fiureid = b.fiureid)\
                       select c1.batchid,c2.fiureid, c2.entityname, c1.* \
                       from cte1 c1 inner join cte2 c2 on c1. batchid = c2.batchid")
        colnames = [desc[0] for desc in cursor.description]
        #print(colnames)
        for row in cursor:
            data.append(row)
eft_anolamy_9f_P_raw = pd.DataFrame(data,columns=[colnames])
eft_anolamy_9f_P_raw.columns = [i[0] for i in eft_anolamy_9f_P_raw.columns]
eft_anolamy_9f_P_raw = eft_anolamy_9f_P_raw.iloc[:,1:]
eft_anolamy_9f_P_raw.to_csv(output_dir + f'EFT_Anamoly_9f_{month}_P_RAW.csv')
eft_anolamy_9f_P_raw.shape[0]

0

* <b>Cross Validation of Raw Data</b>

In [93]:
int(eft_anolamy_9f_P['anamoly_efts'].sum()) == ((eft_anolamy_9f_P_raw['batchid'].astype(str) + eft_anolamy_9f_P_raw['rptsernum'].astype(str)).nunique())

False

###### 9f_R - EFTs with Inward/Outward Amount less than 5 lakhs - REDEMPTION

In [94]:
colnames = []
data = []

with conn as connection:
    with connection.cursor() as cursor:        
        cursor.execute(f"with cte1 as ( SELECT * FROM monthly_eft.{month}_eft_anamoly_9f_R  ), \
                       cte2 as ( select batchid,a.fiureid, coalesce(a.entityname,b.entityname) as entityname \
                       from monthly_eft.{month}_batch_eft a \
                       inner join monthly_report.combined_remaster_{month} b on a.fiureid = b.fiureid)\
                       select c1.batchid,c2.fiureid, c2.entityname, c1.* \
                       from cte1 c1 inner join cte2 c2 on c1. batchid = c2.batchid")
        colnames = [desc[0] for desc in cursor.description]
        #print(colnames)
        for row in cursor:
            data.append(row)
eft_anolamy_9f_R_raw = pd.DataFrame(data,columns=[colnames])
eft_anolamy_9f_R_raw.columns = [i[0] for i in eft_anolamy_9f_R_raw.columns]
eft_anolamy_9f_R_raw = eft_anolamy_9f_R_raw.iloc[:,1:]
eft_anolamy_9f_R_raw.to_csv(output_dir + f'EFT_Anamoly_9f_{month}_R_RAW.csv')
eft_anolamy_9f_R_raw.shape[0]

0

* <b>Cross Validation of Raw Data</b>

In [95]:
int(eft_anolamy_9f_R['anamoly_efts'].sum()) == ((eft_anolamy_9f_R_raw['batchid'].astype(str) + eft_anolamy_9f_R_raw['rptsernum'].astype(str)).nunique())

False

### 10A - Credit files creation

In [96]:
reporttype = 'ctr'
reporttype

'ctr'

* **Main File : 10A-Top 500 PANs-CREDIT_CTR Excluding (Banks, Govt. Entities and Cash Management)**

* **Create an ouput directory**

In [97]:
from re import sub

def Camel_Case(st):
    st = st[:-(len(st)-1)].upper()+st[1:len(st)].lower()
    return st

In [98]:
month_cc = Camel_Case(month)
month_cc

'Apr23'

In [99]:
#month_report_format = format(month_cc[0:4] +' '+str(datetime.now().year))
month_report_format = format(month_cc[0:3] +' '+'20'+month[3:5])
month_report_format

'Apr 2023'

In [100]:
ctr_main_list = [ ' GOVT ','GOVT ',' GOVT','GOVERNMENT','BANK ',' BANK', ' BANK ',' CIS ',' CMS ' ,' CASH ',' BHARAT PETROLEUM CORPORATION LTD ',' BHARAT ELECTRONICS LIMITED ',                  'SMALL INDUSTRIES DEVELOPMENT BANK OF INDIA', ' UTTAR PRADESH POWER CORPORATION LTD ',                  'BHARAT PETROLEUM CORPORATION LIMITED','INDRAPRASTHA GAS LIMITED',                              ' LIC HOUSING FINANCE LTD ', ' PNB ', ' LIFE INSURANCE CORPORATION ',' GAIL ',' UTTAR PRADESH ',                  ' PNB ',' UPPCL ',' UP POWER CORPO ','BANK OF BARODA', 'THE HONGKONG AND SHANGHAI BANKING CORPORATION LTD','DAKSHIN BIHAR GRAMIN BANK','BANGIYA GRAMIN VIKASH BANK',                  'UTTAR BIHAR GRAMIN BANK','PUNJAB NATIONAL BANK','ALLAHABAD BANK','BANK OF INDIA','VIJAYA BANK',                  'JHARKHAND RAJYA GRAMIN BANK','INDORE PREMIER CO OP BANK','PUNJAB GRAMIN BANK', 'HIMACHAL PRADESH GRAMIN BANK','CORPORATION BANK','SYNDICATE BANK','UTTARBANGA KSHETRIYA GRAMIN BANK',                  'ANDHRA BANK','THE MEHASANA DISTIC CENTER CO OPERATIVE BANK','FEDBANK FINANCIAL SERVICES LTD', 'ARYAVART BANK','CHHATTISGARH RAJYA GRAMIN BANK','BARODA GUJARAT GRAMIN BANK',                  'RAJASTHAN MARUDHARA GRAMIN BANK','INDIAN BANK','PASCHIM BANGA GRAMIN BANK','CITIBANK N A', 'CHAITANYA GODAVARI GRAMEENA BANK','PRATHAMA UP GRAMIN BANK','VIDHARBHA KONKAN GRAMIN BANK', 'ODISHA GRAMYA BANK','BARODA U P BANK','JANATHA SEVA CO OP BANKLTD','JANATA SAHAKARI BANK', 'AXIS BANK LTD','GOVERNMENT OF AP, ACCOUNT OF','GREEN CHANNEL BANKING ACCOUNT',                 'JILA SAHKARI KENDRIYA BANK MARYADIT','AU SMALL FINANCE BANK LIMITED','BANK OF BARODA','JILA SAHAKARI KENDRIYA BANK MARYADIT DURG CG','INDUSIND BANK LTD','REPCO BANK LTD','EQUITAS SMALL FINANCE BANK LIMITED','UJJIVAN SMALL FINANCE BANK LIMITED','SHRI BASAVESHWAR SAHAKARI BANK NIYAMITA BAGALKOT','THE HONGKONG AND SHANGHAI BANKING CORPORATION LTD','BARCLAYS BANK PLC','SOLAPUR JANATA SAHAKARI BANK LTD','DAKSHIN BIHAR GRAMIN BANK','BANGIYA GRAMIN VIKASH BANK','CENTRAL BANK OF INDIA','UTTAR BIHAR GRAMIN BANK','PUNJAB NATIONAL BANK','RBL BANK LTD','AIRTEL PAYMENTS BANK LIMITED','THE SOUTH INDIAN BANK LTD','HDFC BANK LIMITED','THE YAVATMAL URBAN CO-OP BANK LTD','SURYODAY SMALL FINANCE BANK LIMITED','ALLAHABAD BANK','ABHYUDAYA CO OP BANK LTD','NEW URBAN CO OPERATIVE BANK  LTD','FINCARE SMALL FINANCE BANK LTD','BANK OF INDIA','THE BHARAT CO-OPERATIVE BANK (MUMBAI) LTD','VIJAYA BANK','VIDYANAND CO OP BANK LTD SOLAPUR BRANCH PHALTAN','PUSAD URBAN CO-OP BANK LTD','KOLLAM DIST CO OP BANK LTD','BOMBAY MERCANTILE CO-OPERATIVE BANK LTD','ICICI BANK LTD','SAMARTH SAHAKARI BANK LTD','JHARKHAND RAJYA GRAMIN BANK','THE MALAPPURAM DISTRICT CO OP BANK LTD   AYIKARAPADY','DCB BANK LIMITED','THE MUGBERIA CENTRAL COOPERATIVE BANK LTD','KARNATAKA BANK LTD','THE AKOLA URBAN CO-OP BANK LTD','NORTH EAST SMALL FINANCE BANK LIMITED','THE BARODA CENTRAL CO OPERATIVE BANK LTD','THE MYSORE MERCHANTS CO OP BANK LTD','JANA SMALL FINANCE BANK LIMITED','THE KOTTAYAM DISTRICT COOPERATIVE BANK LTD','THE SOUTH CANARA DISTRICT CENTRAL CO-OPERATIVE BANK LTD','VYAVSAYIK SAHKARI BANK LTD','AXIS BANK LTD','INDORE PREMIER CO OP BANK','BASSEIN CATHOLIC CO OP BANK LTD','NUTAN NAGARIK SAHAKARI BANK LTD','TAMILNAD MERCANTILE BANK LTD','THE AHMEDABAD DIST CO OP BANK LTD','UP SAHKARI GRAM VIKAS BANK LTD MISC A/C','SBPP CO-OPERATIVE BANK LIMITED','HDFC BANK LTD','KERALA STATE CO OP BANK LTD','THE PANDHARPUR URBAN CO OP BANK LTD','KERALA STATE CO-OPERATIVE BANK LTD','OSMANABAD JANTA SAH BANK LTD','THE TIRUCHIRAPALLI  DISTRICT CENTRAL CO-OPERATIVE BANK LTD','PUNJAB GRAMIN BANK','SONALI BANK LIMITED','APNA SAHAKARI BANK LTD','THE SURAT PEOPLE`S CO OP BANK LTD','THE NASIK MERCHANTS CO OP BANK LTD','THE DAHOD MERCANTILE CO OP BANK LTD','SUCO SOUHARDHA SAHAKARI BANK LTD','THE BIHAR STATE CO-OPERATIVE BANK LTD BIHAT','MAHESH SAHAKARI BANK LIMITED PUNE','TUMKUR GRAIN MERCHANTS CO - OPERATIVE BANK LIMITED','THE CHIKHLI URBAN CO-OP BANK LTD','LOKMANGAL CO OPERATIVE BANK LIMITED','KERALA STATE CO OPERATIVE BANK LTD','SOPANKAKA SAHAKARI BANK LTD','CONTAI  COOP BANK LTD','MALVIYA URBAN CO OPERATIVE BANK LIMITED','THE VARACHHA CO OP BANK LIMITED','SANGOLA URBAN CO OP BANK LTD','THE PANIPAT URBAN CO-OP BANK LTD','THE HASSAN DISTRICT CO-OPERATIVE CENTRAL BANK LIMITED','SURAT NATIONAL CO OP BANK LTD','THE KHAMGAON URBAN CO-OP BANK LTD','THE SURAT DISTRICT CO-OPARETIVE BANK LTD','HIMACHAL PRADESH GRAMIN BANK','ORIENTAL BANK OF COMMERCE','SHIVALIK SMALL FINANCE BANK LIMITED','KALLAPPANNA AWADE ICHALKARANJI JANATA SAHAKARI BANK LTD','THE KALYAN JANATA SAHAKARI BANK LTD','THE THRISSUR DISTRICT CO-OPERATIVE BANK LIMITED','DHANLAXMI BANK LIMITED','THE UDAIPUR URBAN CO OP BANK LTD','CAPITAL SMALL FINANCE BANK LIMITED','THE JANATA  CO - OP  BANK  LTD.GODHRA','CORPORATION BANK','RATANCHAND SHAH SAHAKARI BANK LTD','THE HINDUSTHAN COOP BANK LTD','SARASPUR NAGRIK CO OP BANK LTD','LAKHIMPUR URBAN CO-OPERATIVE BANK LTD','THE MODASA NAGRIK SAHKARI BANK LTD','SYNDICATE BANK','RAJKOT PEOPLES CO OP BANK LTD','THE KOTA CENTRAL COOPERATIVE BANK LIMITED','THE WAI URBAN CO OP BANK LTD WAI','UNITED BANK OF INDIA','UTTARBANGA KSHETRIYA GRAMIN BANK','RAIGANJ CENTRAL COOPERATIVE BANK LTD UK ILPARA BRANCH','THE NAVANAGAR CO OPERATIVE BANK LTD','THE BUSINESS CO OPERATIVE BANK LTD','OMPRAKASH DEORA PEOPLES CO OPERATIVE BANK LTD HINGOLI','VYSYA CO-OPERATIVE BANK LTD','ANDHRA BANK','THE MEHASANA DISTIC CENTER CO OPERATIVE BANK','THE GODHRA URBAN CO OP BANK LTD','GANDHINAGAR NAGRIK CO OP BANK LTD','THE KALOL NAGARIK SAHAKARI BANK LTD','THE BAGALKOT DISTRICT CENTRAL CO-OPERATIVE BANK LTD,BAGALKOT','FEDBANK FINANCIAL SERVICES LTD','MUMBAI DISTRICT CENTRAL  CO OP BANK LTD','SHARAD SAHAKARI BANK LTD','THE RAICHUR DISTRICT CENTRAL CO OPERATIVE BANK LIMITED','CENTRAL CO-OPERATIVE BANK LTD ARA','THE BURDWAN CENTRAL CO OPERATIVE BANK LTD','THE SATARA SAHAKARI BANK LTD','THE SIWAN CENTRAL CO-OPRATIVE BANK LIMITED','THE SIRSI URBAN SAHAKARI BANK LTD','THE SIVAGANGAI DISTRICT CENTRAL CO-OPERATIVE BANK LTD','RAMPUR ZILA SAHKARI BANK LTD-RAMPUR','THE MEHSANA URBAN CO OP BANK LTD','JANASEVA SAHAKARI BANK LTD','ARYAVART BANK','G P PARSIK SAHAKARI BANK LTD','THE RAMANATHAPURAM DISTRICT CENTRAL COOPERATIVE BANK LTD','SHRI ARIHANT CO OPERATIVE BANK LTD','THE GOA STATE CO OPERATIVE BANK LTD','CHHATTISGARH RAJYA GRAMIN BANK','ILKAL CO OP BANK LTD ILKAL','THE MALEGAON MERCHANTS CO OP BANK LTD','THESUVARNYUG SAHAKARI BANK LTD','BARAN NAGRIK SAHKARI BANK LTD','JANTA SAHKARI BANK LTD GONDIA','THE NASIK ROAD DEOLALI VYAPARI SAHAKARI BANK LTD','LONAVLA SAHAKARI BANK LTD','THE JUNAGADH COMMERCIAL CO OP BANK LTD . ','BARODA GUJARAT GRAMIN BANK','MAGADH CENTRAL CO-OPERATIVE BANK LT','THE GANDHI GUNJ PRIMARY CO OP BANK LTD','THE KURLA NAGARIK SAHAKARI BANK LIMITED','TAMLUK GHATAL CENTRAL CO-OPERATIVE BANK LTD','RAJASTHAN MARUDHARA GRAMIN BANK','THE BARDOLI NAGRIK SAHAKARI BANK LTD','THE BHATKAL URBAN CO-OPERATIVE BANK LIMITED,BHATKAL','THE BHUJ MERCANTILE CO OPERATIVE BANK LTD','THE BARMER CENTRAL CO-OP BANK LTD','VIDARBHA MERCHANTS URBAN CO OP BANK LTD','G.M.URBAN CO-OPERATIVE BANK LTD','THE WEST BENGAL STATE COOPERATIVE BANK LTD','INDIAN BANK','THE AHMEDABAD MERCHANTILE CO OP BANK LIMITED','THE AGRASEN CO OPERATIVE URBAN BANK LTD','THE MEHSANA NAGRIK SAHAKARI BANK LTD','THE CHEMBUR NAGARIK SAHAKARI BANK LTD','THE KARNATAKA STATE CO-OP APEX BANK LTD','BELAGAVI SHREE BASAVESHWAR CO OP BANK LTD','TUMKUR DCC BANK LIMITED','CHITTORGARH KENDRIYA SAHAKARI BANK LTD','SOLAPUR SOCIAL URBAN CO OP BANK LTD SOLAPUR','THE MUSLIM CO OPERATIVE BANK LIMITED','BARODA GUJARAT GRAMIN BANK','ZILA  SAHAKARI BANK LTD  DUDHI ','THE KERALA STATE CO-OPERATIVE BANK LTD','PASCHIM BANGA GRAMIN BANK','JHARNESHWAR NAGRIK SAHAKARI BANK MARYADIT','CITIBANK N A','DAVANGERE DCC BANK LTD','THE VAIDYANATH URBAN CO OP BANK LTD','PUNE PEOPLE CO OP BANK LTD','ASSAM CO OP APEX BANK LTD','JIVAN COMMERCIAL CO OPERATIVE BANK LTD','THE SITAMARHI CENTRAL COOPERETIVE BANK LTD SITAMARHI BR SHEOHAR','JILA SAHAKARI BANK GORMI','BAVLA NAGRIK SAH BANK LTD','KANCHEEPURAM CENTRAL CO - OPERATIVE BANK LIMITED','THE VAISHALI DISTRICT CENTRAL CO OPERATIVE BANK LIMITED','KASHIPUR URBAN COOPERATIVE BANK LTD'                 , 'POST OFFICE','POST MASTER','GOVERNMENT OF AP, ACCOUNT OF','AXIS BANK LTD','AU SMALL FINANCE BANK LIMITED','BARCLAYS BANK P L C','THE AHMEDNAGAR MERCHANTS CO OP BANK LTD','INDUSIND BANK LTD','BANK OF BARODA','JILA SAHKARI KENDRIYA BANK MARYADIT','UJJIVAN SMALL FINANCE BANK LIMITED','BANGIYA GRAMIN VIKASH BANK','EQUITAS SMALL FINANCE BANK LIMITED','UTTAR BIHAR GRAMIN BANK','DAKSHIN BIHAR GRAMIN BANK','THE SURAT DIST  CO OP BANK LTD','RBL BANK LTD','KANNUR DISTRICT COOPERATIVE BANK LTD','AIRTEL PAYMENTS BANK LIMITED','CENTRAL BANK OF INDIA','JILA SAHAKARI KENDRIYA BANK MARYADIT DURG','JANA SMALL FINANCE BANK LIMITED','FINCARE SMALL FINANCE BANK LTD','ALLAHABAD BANK','REPCO BANK LTD','THE YAVATMAL URBAN CO-OP BANK LTD','PUNJAB NATIONAL BANK','THE AKOLA URBAN CO-OP BANK LTD','SURYODAY SMALL FINANCE BANK LIMITED','VIJAYA BANK','AHMEDNAGAR SHAHAR SAHAKARI BANK LTD','CAPITAL SMALL FINANCE BANK LIMITED','THE BHARAT CO-OPERATIVE BANK (MUMBAI) LTD','SMRITI NAGRIK SAHAKARI BANK MARYADIT','JHARKHAND RAJYA GRAMIN BANK','METRO CASH AND CARRY INDIA PRIVATE LIMITED','HINDUSTHAN COOPERATIVE BANK LTD.MUMBAI','TAMILNAD MERCANTILE BANK LTD','THE MUGBERIA CENTRAL COOPERATIVE BANK LTD','KARNATAKA BANK LTD','THRISSUR DISTRICT CO OP  BANK','THE SANGAMNER MERCHANTS CO OP BANK LTD','UBKGRAMIN BANK HEAD OFFICE','THE SURAT PEOPLES COOP BANK LTD','BASSEIN CATHOLIC CO OP BANK LTD','SOLAPUR JANATA SAHAKARI BANK LTD','ICICI BANK LTD','SURAT NATIONAL CO OP BANK LTD','NORTH EAST SMALL FINANCE BANK LIMITED','BANK OF INDIA','PUSAD URBAN CO-OP BANK LTD','SHRI BASAVESHWAR SAHAKARI BANK NIYAMITA BAGALKOT','THE SOUTH INDIAN BANK LTD','THE MYSORE MERCHANTS CO OP BANK LTD',\
                  'SBPP CO-OPERATIVE BANK LIMITED','TAMILNADU GRAMA BANK','HDFC BANK','VYAVSAYIK SAHKARI BANK LTD RAIPUR','THE  VARACHHA CO OP  BANK  LTD','BOMBAY MERCANTILE CO-OPERATIVE BANK LTD','NUTAN NAGARIK SAHAKARI BANK LTD','CONTAI COOPERATIVE BANK LTD','ABHYUDAYA CO OP BANK LTD','SAMARTH SAHAKARI BANK LTD','THE KOLAR AND CHIKBALLAPURA DISTRICT COOPERATIVE CENTRAL BANK LTD KOLAR','JANAKALYAN SAHAKARI BANK LTD','KERALA STATE COOPERATIVE BANK LIMITED','DCB BANK LIMITED','KALLAPPANNA AWADE ICHALKARANJI JANATA SAHAKARI BANK LTD','VIDYANAND CO OP BANK AKLUJ','THE CHIKHLI URBAN CO-OP BANK LTD','NEW URBAN CO OPERATIVE BANK  LTD','MALAPPURAM DISTRICT COOP BANK L EDAPPAL','THE DAHOD MERCANTILE CO OP BANK LTD','HIMACHAL PRADESH GRAMIN BANK','KOTTAYAM DISTRICT CO-OPERATIVE BANK LTD-1','RAJKOT PEOPLES CO OP BANK LTD','KOPARGAON  PEOPLE COOP BANK LTD','SUCO SOUHARDHA SAHAKARI BANK LTD','SHRI ARIHANT CO OPERATIVE BANK LIMITED','THE NASIK MERCHANTS CO-OP BANK LTD','HOOGHLY DISTRICT CENTRAL CO-OPERATIVE BANK LTD - ARAMBAGH BRANCH','THE KHAMGAON URBAN CO-OP BANK LTD','PUNE PEOPLE CO OP BANK LIMITED','UP SAHKARI GRAM VIKAS BANK LTD MISC A/C','VIKAS SOUHARDA CO OP BANK LTD','GULBARGA AND YADGIR DISTRICT CO OPERATIVE CENTRAL BANK LTD','BARODA GUJARAT GRAMIN BANK','SOPANKAKA SAHAKARI BANK LTD','THE MODASA NAGRIK SAHKARI BANK LTD','THE URBAN CO OPERATIVE BANK LTD CUTTACK, JAJPUR ROAD BRANCH','RAIGANJ CENTRAL CO-OPERATIVE BANK LTD.','SRI GANESH CO OPERATIVE BANK LTD KALBURG I','TUMKUR GRAIN MERCHANTS CO - OPERATIVE BANK LIMITED','KERALA STATE CO-OPERATIVE BANK LTD','THE MUZ C.C.BANK LTD.MINAPUR','ARYAVART BANK','WARANGAL URBAN CO-OP BANK LTD.','CHAITANYA GODAVARI GRAMEENA BANK','LAKHIMPUR URBAN CO-OPERATIVE BANK LTD','THE HASSAN DISTRICT CENTRAL CO-OPERATIVE BANK LTD','THE COMMERCIAL CO-OP BANK LTD','VASAI JANATA SAHAKARI BANK LTD','APNA SAHAKARI BANK LTD','THE PANIPAT URBAN CO-OP BANK LTD','THE SIWAN CENTRAL CO-OPRATIVE BANK LIMITED','SARASPUR NAGRIK CO OP BANK LTD','ODISHA GRAMYA BANK','SADHANA SAHAKARI BANK LTD','VIDHARBHA KONKAN GRAMIN BANK','THE KAKINADA CO-OPERATIVE TOWN BANK LTD, KAKINADA','FEDBANK FINANCIAL SERVICES LTD','SYNDICATE BANK','THE SATARA SAHAKARI BANK LTD','THE BHAGALPUR CENTRAL CO-OPERATIVE BANK LTD.','URBAN COPRATIVE BANK LIMITED BAREILY','MAHESH SAHAKARI BANK LTD PUNE','THE RAICHUR DISTRICT CENTRAL CO OPERATIVE BANK LIMITED','THE GAYATRI COOPERATIVE URBAN BANK LIMITED','DHANLAXMI BANK LTD','PUNJAB GRAMIN BANK','THE NASHIK ROAD DEOLALI VYAPARI SAHAKARI BANK LTD','THE AGRASEN CO OPERATIVE URBAN BANK LTD','THE SIRSI URBAN SAHAKARI BANK LTD','SHARAD SAHAKARI BANK LTD','THE GODHRA URBAN CO OP BANK LTD','THE SOUTH CANARA DISTRICT CENTRAL CO-OPERATIVE BANK LTD','THE GOA URBAN CO OP BANK LTD','THE BHATKAL URBAN CO-OPERATIVE BANK LIMITED,BHATKAL','ANDHRA BANK','THE WAI URBAN CO OP BANK LTD WAI','A.P.STATE CO-OPERATIVE BANK LTD','MAHARANA PRATAP CO-OP URBAN BANK LTD,HYDERABAD','THE PANDHARPUR URBAN CO OP BANK LTD','THE INDUSTRIAL CO OPERATIVE BANK LTD','SARDARGANJ MERCANTILE CO-OP BANK LTD','DBS BANK INDIA LIMITED','SHIVALIK SMALL FINANCE BANK LIMITED','JANTA SAHKARI BANK LTD GONDIA','PRAVARA  SAH BANK LTD LONI BDK','THE KANYAKUMARI DISTRICT CENTRAL COOPERATIVE BANK LTD','JANASEVA SAHAKARI BANK LTD','THE VAIDYANATH URBAN CO OP BANK LTD','THE MEHSANA URBAN CO OP BANK LTD','THE KANAKAMAHALAKSHMI CO-OPERATIVE BANK LTD','KANCHEEPURAM CENTRAL CO - OPERATIVE BANK LIMITED','THE GOA STATE CO OPERATIVE BANK LTD','VALSAD DIST.CENTRAL CO-OP.BANK LTD.','THE UMRETH URBAN  CO OP  BANK LTD','HIMATNAGAR NAGRIK SAHAKARI BANK LIMITED','THE BANASKANTHA MERCANTILE COOP BANK LTD','THE KURLA NAGARIK SAHAKARI BANK LIMITED','HEAD POST OFFICE AURANGABAD','KERALA STATE CO OP BANK LTD','OSMANABAD JANATA SAHAKAR BANK LTD BDR','OMPRAKASH DEORA PEOPLES CO OPERATIVE BANK LTD HINGOLI','UNITED BANK OF INDIA','THE KALOL NAGARIK SAHAKARI BANK LTD.','JIVAN COMMERCIAL CO OPERATIVE BANK LIMITED','LONAVALA SAHAKARI BANK LTD','ANAND MERCANTILE CO. OP.  THE ANAND MERCANTILE CO OP  BANK LTD.','ZILA SAHKARI BANK LTD','ORIENTAL BANK OF COMMERCE','ORISSA STATE CO-OP BANK LTD','THE BARDOLI NAGRIK SAHAKARI BANK LTD','THESUVARNYUG SAHAKARI BANK LTD','BALAGERIA CENTRAL CO-OP. BANK LTD.','THE VIRUDHUNAGAR DISTRICT CENTRAL CO-OPERATIVE BANK LTD','THE HASTI CO OP BANK LTD','THE BAGALKOT DISTRICT CENTRAL CO-OPERATIVE BANK LTD,BAGALKOT','CENTRAL CO-OPERATIVE BANK LTD ARA','PRATHAMA UP GRAMIN BANK','BELAGAVI SHREE BASAVESHWAR CO OP BANK LTD','THE WEST BENGAL STATE COOPERATIVE BANK LTD','THE GANDHI GUNJ PRIMARY CO OP BANK LTD','THE MALEGAON MERCHANTS CO OPERATIVE BANK LTD MALEGAON','STATE BANK OF SIKKIM','BARODA GUJARAT GRAMIN BANK','THE JAIPUR CENTRAL COOPERATIVE BANK LTD                     ','CORPORATION BANK','THE MUSLIM CO OPERATIVE BANK LIMITED','TNCSARD BANK','THE KALYAN JANATA SAHAKARI BANK LTD','BIRBHUM DISTRICT CENTRAL CO OPERATIVE BANK LIMITED','KASHIPUR URBAN COOPERATIVE BANK LTD','AGRA ZILA SAHKARI BANK LTD BRANCH JAITPUR KALAN','NADIA DISTRICT CENTRAL CO OPERATIVE BANK','RAJGURUNAGAR SAHAKARI BANK LTD','LOKMANGAL CO OP BANK SOLAPUR','THE MOTIHARI CENTRAL CO OP BANK LTD','THE DAVANGERE-HARIHAR URBAN SAHAKARA BANK NIYAMITA','NAGARIK SAMABAY BANK LTD','A P R BANK DAPORIJO',     'WRITER SAFEGUARD PVT LTD','SECURE VALUE INDIA LIMITED','JILA SAHKARI KENDRIYA BANK MARYADIT','SIS CASH SERVICES PRIVATE LIMITED','KERALA STATE COOPERATIVE BANK LIMITED','JILA SAHAKARI KENDRIYA BANK MARYADIT RAJNANDGAON','THE KOTTAYAM DISTRICT COOPERATIVE BANK LTD','CHAITANYA GODAVARI GRAMEENA BANK','JILA SAHAKARI KENDRIYA BANK MARYADIT DURG','SWARNA BHARATHI SAHAKARA BANK NIYAMITHA','THE GONDIA DISTRICT CENTRAL CO-OPERATIVE BANK LTD','KERALA STATE CO - OPERATIVE BANK LTD,KAY AMKULAM MAIN BRANC','PAYTM PAYMENTS BANK LTD','SANGLI DIST CE CO OP BANK','JILA SAHAKARI KENDRIYA BANK MARYADIT JAGDALPUR','BARODA GUJARAT GRAMIN BANK','PUNJAB GRAMIN BANK','BANK OF AMERICA N.A','THE SALEM DISTRICT CENTRAL CO-OPERATIVE BANK LIMITED','BANK OF BARODA','ARYAVART BANK','THE BELGAUM DISTRICT CENTRAL CO-OP BANK LTD','LATUR DISTRICT CENTRAL CO OPERATIVE BANK LTD','ASSAM GRAMIN VIKASH BANK','THE DISTRICT CO-OPERATIVE CENTRAL BANK LTD','AGV BANK  BRANCH COLLAC','REPCO BANK LTD','BARODA GUJARAT GRAMIN BANK','THE CHANDRAPUR DIST.CENTRAL COOP BANK L','MARKETYARD COMM COOP BANK LTD.','THE COSMOS CO OP BANK LTD','TAMILNADU GRAMA BANK','HDFC BANK LTD','RAIGANJ CENTRAL CO-OPERATIVE BANK LTD.','THE SARASWAT CO-OPERATIVE BANK LTD','TAMILNAD MERCANTILE BANK LTD','VIJAYA BANK','BANK OF INDIA','ALAPPUZHA  DIST CO-OP BANK','THE SOLAPUR DISTRICT CENTRAL CO OPERATIVE BANK LIMITED','VYAVSAYIK SAHKARI BANK LTD RAIPUR','MANDYA DISTRICT CO-OPERATIVE CENTRAL BANK LTD','SURYODAY SMALL FINANCE BANK LTD','RATNAGIRI DIST.CENTRAL CO.OP BANK LTD','THE HASSAN DISTRICT CO-OPERATIVE CENTRAL BANK LIMITED','M/S THE NAWANSHAHR CENTRAL CO-OP BANK LTD','KARNATAKA GRAMIN BANK','THE MYSORE AND CHAMARAJANAGAR DISTRICT CO-OPERATIVE CENTRAL BANK LTD','THE KANARA DISTRICT CENTRAL CO- OPERATIVE BANK LTD','THE KOZHIKODE DISTRICT CO-OPERATIVE BANK','THE BHANDARA DISTRICT CENTRAL CO-OPERATIVE BANK LTD BHANDARA','STATE BANK OF INDIA','AURANGABAD DISTRICT CENTRAL COOP BANK LTD','THE BANASKANTHA DIST CENTRAL CO-OP BANK LTD','AMRAVATI DISTRICT CENTRAL CO-OP.BANK LTD.','THE PALAKKAD DISTRICT CO OPERATIVE BANK LTD','VIDHARBHA KONKAN GRAMIN BANK','THE THRISSUR DISTRICT CO-OPERATIVE BANK LIMITED','THE YAVATMAL DISTRICT CENTRAL CO-OP BANK LTD','KERALA GRAMIN BANK','THE PATHANAMTHITTA DISTRICT CO-OPERATIVE BANK LTD BRANCH ADOOR','KERALA STATE CO-OPERATIVE BANK LTD','THE DISTRICT COOPERATIVE CENTRAL BANK LIMITEDELURU','STATE TRANSPORT CO OP BANK LTD','RAIGAD DIST CENTRAL CO BANK','THE SABARKANTHA DISTRICT CENTRAL CO OPERATIVE BANK LTD','HEAD POST OFFICE ,POST MASTER','UJJIVAN SMALL FINANCE BANK LIMITED','JILA SAHAKARI KENDRIYA BANK MYDT VIDISHA','JILA SAHAKARI KENDRIYA BANK MARYADIT','THE GOA STATE CO-OPERATIVE BANK LTD','JILA SAHAKARI KENDRIYA BANK MARYADIT DEWAS','THE JALANDHAR CENTRAL CO-OPERATIVE BANK LTD NAKODAR','NAGPUR MAHANAGARPALIKA KARMACHARI SAH. BANK','THE WEST BENGAL STATE COOPERATIVE BANK LTD','DOMBIVLI NAGARI SAHAKARI BANK LTD','THE PUDUKOTTAI DISTRICT CENTRAL CO-OPERATIVE BANK LTD','THE ERODE DISTRICT CENTRAL CO-OPERATIVE BANK LTD','THE BARMER CENTRAL CO-OPERATIVE BANK LIM ITED','CUTTACK CENTRAL COOP BANK LIMITED','JILA SAHKARI KENDRIYA BANK MYDT KHANDWA','NKGSB CO-OPERATIVE BANK LTD','THE RAILWAY EMPLOYEES COOPERATIVE BANK LIMITED','JILA SAHAKARI KENDRIYA BANK MRYDT UJJAIN','SREE MAHAYOGI LAKSHMAMMA COOPERATIVE BANK LTD','THE TARN TARAN CENTRAL COOPERATIVE BANK LIMITED TARN TARAN','KARNATAKA GRAMIN BANK','THE MODASA NAGRIK SAHKARI BANK LTD','THE KODAGU DISTRICT CO-OPERATIVE CENTRAL BANK LIMITED, MADIKERI','ANZ BANKING GROUP LTD','KRISHNA BHIMA SAMRUDDHI LOCAL AREA BANK LIMITED','SHRI GAJANAN MAHARAJ URBAN CO OP BANK L','DAUSA KENDRIYA SAHAKARI BANK LTD','SHREE WARANA SAHAKARI BANK LTD','THE GURDASPUR CENTRAL CO-OPERATIVE BANK LTD','SRI POTTI SRIRAMULU NELLORE DISTRICT COOPERATIVE CENTRAL BANK LTD','THE ADARSH COOPERATIVE URBAN BANK LIMITED','THE BARODA CENTRAL CO OPERATIVE BANK LTD','THE BHARAT CO-OPERATIVE BANK (MUMBAI) LTD','THE FATEHGARH SAHIB CENTRAL CO-OP BANK LTD','JILA SAHKARI KENDRIYA BANK MARYADIT','CENTRAL BANK OF INDIA','THE SURAT MERCANTILE CO OP BANK LTD 242341824109332429310','AMRITSAR CENTRAL CO OP BANK ASR','M/S A D C C BANK LTD -TOWN BR','THE BALASORE BHADRAK CENTRAL CO-OPERATIVE BANK LTD','THE SOUTH INDIAN BANK LTD','THE BELLARY DISTRICT CO OPERATIVE CENTRAL BANK LTD','JILA SAHAKARI KENDRIYA BANK MARYADIT MANDSAUR','BARODA U P BANK','DARJEELING DISTRICT CENTRAL CO-OPERATIVE BANK LTD','AP GRAMEENA VIKAS BANK','ZILA SAHKARI BANK LTD SWARGASHRAM','THE S D C C BANK LTD','THE MURSHIDABAD DISTRICT CENTRAL CO-OP BANK LTD.-JANGIPUR BRANCH','VIKAS CO OP  BANK LTD','IDFC FIRST BANK LIMITED','KARNATAKA GRAMIN BANK','SINDHUDURG DIST CENTRAL CO OP BANK LTD','THE SIRCILLA CO OPERATIVE URBAN BANK LTD','KALLAPPANNA AWADE ICHALKARANJI JANATA SAHAKARI BANK LTD',\
                  'ASHOK SAHAKARI BANK LTD','THE KURUKSHETRA CENTRAL CO OP BANK LTD','THE MEHSANA URBAN CO OP BANK LTD','THE FAZILKA CENTRAL COOPERATIVE BANK LTD','JOWAI CO-OPRATIVE URBAN BANK LTD','MEGHALAYA CO-OP APEX BANK LTD','RAJAPUR URBAN CO OP BANK LTD RAJAPUR','MADHYANCHAL GRAMIN BANK WAIDHAN','BHAVNAGAR DISTRICT CO OPERATIVE BANK LTD','BHAWANIPATNA CENTRAL CO-OP.BANK LTD','JILA SAHAKARI KENDRIYA BANK MARYADIT SEONI','THE CENTRAL CO-OPERATIVE BANK LTD','SH.MALOJIRAJE SA.BANK LTD BR.RAMNAGAR','MUZAFFAR NAGAR DISTRICT CO OPERATIVE BANK LIMITED','THE ANANTAPUR DISTRICT COOPERATIVE CENTRAL BANK LTD','MADHESHWARI URBAN DEV CO OP BANK LTD MAD HA','KRISHANA SAHAKARI BANK LTD RETHARE BK','THE SIRSA CENTRAL CO-OP BANK LTD','THE RADDI SAHAKARA BANK NIYAMITHA','THE KANAKAMAHALAKSHMI CO-OPERATIVE BANK LTD','TRIPURA STATE CO OPERATIVE BANK LTD DHARMANAGAR BRANCH','THE DISTRICT COOPERATIVE CENTRAL BANK LTD MEDAK','THE SUTEX CO OPERATIVE BANK LTD','KERALA STATE CO OPERATIVE BANK LTD','SIKKIM STATE CO-OPERATIVE BANK LTD','THE PANCHMAHAL DIST CO OP BANK LTD','THE VAIDYANATH URBAN CO-OPERATIVE BANK LTD','THE HOSHIARPUR CENTRAL CO-OP BANK BHUNGA','H P STATE COOP BANK LTD','THE KAVIL SCB LTD NO 2093','MIZORAM CO OPERATIVE APEX BANK LTD','POST MASTER CHANNAPATNA 40025','SHREE RAJKOT DISTRICT CO-OP BANK LTD','YES BANK LTD','THE CHIKMAGALUR DISTRICT CO-OPERATIVE CENTRAL BANK LIMITED','THE FARIDABAD CENTRAL CO-OPERATIVE BANK LTD','POORNAWADI NAGRIK SAHAKARI BANK LTD BEED BR PARBHANI','SHRI BASAVESHWAR SAHAKARI BANK NIYAMITA BAGALKOT','ODISHA GRAMYA BANK','TRIPURA GRAMIN BANK, KAILASHAHAR BRANCH','JILA SAHKARI KENDRIYA BANK MARYADIT SATN A (M P) BR UNCHEHA','DHULE AND NANDURBAR DISTRICT CENTRAL CO OP BANK LTD','DAVANGERE DISTRIC CO-OP BANK','PRAVARA SAHAKARI BANK LTD','MEGHALAYA RURAL BANK','KARNATAKA GRAMIN BANK','THE NAWADA CENTRAL CO-OPERATIVE BANK LTD','BANDA URBAN CO-OPERATIVE BANK LTD','BHAVANI URBAN CO OPERATIVE BANK LTD','PUNJAB NATIONAL BANK','THE JAMPETA CO-OPERATIVE URBAN BANK LTD','JILA SHAHKARI KENDRIYA BANK MARYADIT-SHAKHA AGAR SHAHAR','ODISHA GRAMYA BANK','THE VISAKHAPATNAM CO-OP. BANK LTD','JILA SHAKARI KENDRIY BANK GOTEGAON','CENTRAL GOVT POSTAL - 20151','DEUTSCHE BANK AG','THE BIJAPUR DISTRICT CENTRAL CO OPERATIV E BANK LTD','T D C C BANK','CSB BANK LTD','THE BANSWARA CENTRAL COOP BANK LTD PARTA PUR','DHANLAXMI BANK LTD','THE SANGHAMITRA CO-OPERATIVE URBAN BANK LTD','UTTAR BIHAR GRAMIN BANK','MUGBERIA CENTRAL CO-OPERATIVE BANK LTD','UTTARAKHAND GRAMIN BANK','AHMEDNAGAR  ZILHA PRATHMIK SHIKSHAK SAH BANK','THE AJARA URBAN COOP BANK LTD AJARA','KARNATAK CENTRAL CO OPERATIVE BANK LTD','ADARSH CO-OPERATIVE BANK LTD.  .','VIDYASAGAR CENTRAL CO OPERATIVE BANK LTD','MIZORAM RURAL BANK','THE GUNTUR DISTRICT CO-OPERATIVE CENTRAL BANK LIMITED , NARASARAOPET BRANCH','BDCC BANK LTD'     'THE KERALA STATE FINANCIAL ENTERPRISES LTD','JHARKHAND STATE BEVEREGES CORPORATION LTD EAL','DELHI TOURISM  TRANSPORTATION DEVELOPMENT CORPORATION LTD','KERALA STATE BEVERAGES CORPORATION LTD','COMMISSIONER COIMBATORE MUNICIPAL CORP','BANGALORE METRO RAIL CORPORATIONBMRCL','TELANGANA STATE POLICE WELFARE SOCIETY','BHARAT SANCHAR NIGAM LIMITED', 'AXIS BANK LIMITED','AU SMALL FINANCE BANK LIMITED','THE KERALA STATE FINANCIAL ENTERPRISES LTD','BANK OF BARODA','INDUSIND BANK LTD','THE HONGKONG AND SHANGHAI BANKING CORPORATION LIMITED','UJJIVAN SMALL FINANCE BANK LIMITED','BARCLAYS BANK P L C','THE SURAT DIST  CO OP BANK LTD','JHARKHAND STATE BEVEREGES CORPORATION LTD EAL','JILA SAHAKARI KENDRIYA BANK MARYADIT DURG (CG)','EQUITAS SMALL FINANCE BANK LIMITED','STATE SMART CITY PROJECT UNIT (E-SUVIDHA) GOVT. OF U.P.','REPCO BANK LTD','RBL BANK LTD','BHARAT PETROLEUM CORPORATION LIMITED','AIRTEL PAYMENTS BANK LIMITED','CAPITAL SMALL FINANCE BANK LIMITED','THE BHARAT CO-OPERATIVE BANK (MUMBAI) LTD','RAJKOT NAGRIK SAHKARI BANK LTD.','TAMILNAD MERCANTILE BANK LTD','ICICI BANK LTD','UTTAR BIHAR GRAMIN BANK','DAKSHIN BIHAR GRAMIN BANK','DELHI TOURISM  TRANSPORTATION DEVELOPMENT CORPORATION LTD','ABHYUDAYA CO OP BANK LTD','KALLAPPANNA AWADE ICHALKARANJI JANATA SAHAKARI BANK LTD','VIJAYA BANK','THE AHMEDNAGAR MERCHANTS CO OP BANK LTD','THE AKOLA URBAN CO-OP BANK LTD','MUGBERIA CENTRAL CO-OPERATIVE BANK LTD','BANGIYA GRAMIN VIKASH BANK','ALLAHABAD BANK','PUNJAB NATIONAL BANK','THE SOUTH INDIAN BANK LTD','KERALA STATE CO-OP BANK LTD.','CENTRAL BANK OF INDIA','THE YAVATMAL URBAN CO-OP BANK LTD','THE HINDUSTHAN CO OP BANK LTD','THE GOA STATE CO-OPERATIVE BANK LTD','GP PARSIK SAHAKARI BANK LTD','KERALA STATE CO OP BANK LTD','BANK OF INDIA','SMRITI NAGRIK SAHAKARI BANK MARYADIT','BASSEIN CATHOLIC CO OP BANK LTD','BOMBAY MERCANTILE CO-OPERATIVE BANK LTD','GOVERNMENT OF AP, ACCOUNT OF','THE BIHAR STATE CO-OPERATIVE BANK LTD SAHARSA','CHAITANYA GODAVARI GRAMEENA BANK','KERALA STATE BEVERAGES CORPORATION LTD','KERALA STATE CO-OPERATIVE BANK LTD','SOLAPUR JANATA SAHAKARI BANK LTD','THE NASIK MERCHANTS CO OP BANK LTD','SUCO SOUHARDHA SAHAKARI BANK LTD','SAMARTH SAHAKARI BANK','THE PALAKKAD DISTRICT CO-OPERATIVE BANK LTD','SURAT  NATIONAL CO OP BANK LTD','THE JANATA  CO OP BANK LTD','FINCARE SMALL FINANCE BANK LIMITED','UP SAHKARI GRAM VIKAS BANK LTD MISC A/C','THE KALYAN JANATA SAHAKARI BANK LTD','THE NAWANAGAR CO-OP BANK LTD','SURYODAY SMALL FINANCE BANK LTD','PUSAD URBAN CO-OP BANK LTD','THE THRISSUR DISTRICT CO-OPERATIVE BANK LIMITED','NUTAN NAGARIK SAHAKARI BANK LTD','THE BURDWAN CENTRAL CO OPERATIVE BANK LTD-KATWA BRANCH','THE KOLAR AND CHIKBALLAPURA DISTRICT COOPERATIVE CENTRAL BANK LTD KOLAR','THE AHMEDABAD MERCANTILE CO OP BANK LTD','HDFC BANK LTD.','JHARKHAND RAJYA GRAMIN BANK','FEDBANK FINANCIAL SERVICES LTD','SBPP CO-OPERATIVE BANK LIMITED','THE DAHOD MERCANTILE CO OP BANK LTD','SYNDICATE BANK','THE KRISHNA DISTRICT CO-OPERATIVE CENTRAL BANK LTD','TUMKUR GRAIN MERCHANTS CO - OPERATIVE BANK LIMITED','SOPANKAKA SAHAKARI BANK LTD','THE KHEDA DISTRICT CENTRAL CO OP BANK LTD','CONTAI CO-OPERATIVE BANK LTD','THE WEST BENGAL STATE COOPERATIVE BANK LTD','APNA SAHAKARI BANK LTD','PUNE PEOPLE CO OP BANK LTD','THESUVARNYUG SAHAKARI BANK LTD','RAIGANJ CENTRAL CO-OPERATIVE BANK LTD.','THE MODASA NAGARIK SAHAKARI BANK LTD.MODASA','VIDYANAND CO OP BANK LTD SOLAPUR BRANCH PHALTAN','KARNATAKA BANK LTD','NEW URBAN CO OPERATIVE BANK  LTD','THE VIJAY CO OP BANK LTD','RAJKOT PEOPLES CO-OPERATIVE BANK LTD','DCB BANK LIMITED','MALAPPURAM DT CO OP BANK LTD','SHRI BASAVESHWAR SAHAKARI BANK NIYAMITA BAGALKOT','THE SANGAMNER MERCHANTS CO OP BANK LTD','MAHESH SAHAKARI BANK LTD PUNE','THE KHAMGAON URBAN CO-OP BANK','VIKAS SOUHARDA CO OP BANK LTD','HIMACHAL PRADESH GRAMIN BANK','THE GODHRA CITY CO-OP BANK LTD.','THE KALUPUR COMMERCIAL CO OPERATIVE BANK LIMITED','THE HASTI CO OP BANK LTD DONDAICHA SHIRPUR BRANCH','THE PANIPAT URBAN COOPERATIVE BANK LTD','THE GODHRA URBAN CO OP BANK LTD','DHANLAXMI BANK LIMITED','THE CHIKHLI URBAN CO-OP BANK LTD','SHRI ARIHANT CO OPERATIVE BANK LTD','MALVIYA URBAN CO OPERATIVE BANK LIMITED','THE HASSAN DISTRICT CO-OPERATIVE CENTRAL BANK LIMITED','ARYAVART BANK','THE SUTEX CO OPERATIVE BANK LTD','ANDHRA BANK','COMMISSIONER COIMBATORE MUNICIPAL CORP','JANA SMALL FINANCE BANK LIMITED','THE BANASKANTHA MERCANTILE COOP BANK LTD','VYSYA CO-OPERATIVE BANK LTD','THE BHATKAL URBAN CO-OPERATIVE BANK LIMITED,BHATKAL','THE KOTTAKKAL CO-OP URBAN BANK LTD','BANGALORE METRO RAIL CORPORATIONBMRCL','SRI GANESH CO-OPERATIVE BANK LTD.GULBARGA','THE GAYATRI COOPERATIVE URBAN BANK LIMITED','THE AGRASEN CO OPERATIVE URBAN BANK LTD','VIDHARBHA KONKAN GRAMIN BANK','JANASEVA SAHAKARI BANK LTD','THE WAI URBAN CO OP BANK LTD WAI','THE SATARA SAHAKARI BANK LTD','NORTH EAST SMALL FINANCE BANK LIMITED','ANDHRA PRAGATHI GRAMEENA BANK','THE RAICHUR DISTRICT CENTRAL CO OPERATIVE BANK LIMITED','THE INDUSTRIAL CO OPERATIVE BANK LTD','THE VISAKHAPATNAM CO-OP. BANK LTD','THE KALOL NAGRIK SAHKARI BANK LTD','THE KAKINADA CO-OPERATIVE TOWN BANK LTD, KAKINADA','THE MUSLIM CO OPERATIVE BANK LIMITED','THE BUSINESS CO OPERATIVE BANK LTD','BHAGYALAXMI MAHILA CO OP BANK','TELANGANA STATE POLICE WELFARE SOCIETY','THE SIWAN CENTRAL CO-OPRATIVE BANK LIMITED','THE VARACHHA CO-OP BANK LTD','THE PANDHARPUR URBAN COOP BANK LTD PANDHARPUR','PATAN NAGRIK SAHKARI BANK LTD','URBAN CO OPERATIVE BANK LTD BAREILLY','THE KURLA NAGARIK SAHAKARI BANK LIMITED','THE BHAGALPUR CENTRAL CO-OPERATIVE BANK LTD.','SREE CHARAN SOUHARDHA CO-OP BANK LTD','BHARAT SANCHAR NIGAM LIMITED','INDORE PREMIER CO OPERATIVE BANK LIMITED','UMIYA URBAN CO OPERATIVE BANK MARYADIT NAGPUR','PUNJAB GRAMIN BANK','RAJGURUNAGAR SAHAKARI BANK LIMITED','SUNDARLAL SAWJI URBAN CO OP BANK LTD','TAMILNADU GRAMA BANK','THE BARDOLI NAGRIK SAHAKARI BANK LTD','EVEREST BANK','VASAI JANATA SAHAKARI BANK LTD','ANDHRA PRADESH GRAMEENA VIKAS BANK HEAD OFFICE','THE AHMEDABAD DIST CO OP BANK LTD','RAJASTHAN MARUDHARA GRAMIN BANK','THE URBAN COOPERATIVE BANK LTD','CENTRAL CO-OPERATIVE BANK LTD ARA','BAPUJI CO OPERATIVE BANK LIMITED DAVANGERE','OMPRAKASH DEORA PEOPLES CO OPERATIVE BANK LTD HINGOLI','SHARAD SAHAKARI BANK LTD','THE BAGHAT URBAN CO-OPERATIVE BANK LIMITED','CORPORATION BANK','THE JAIPUR CENTRAL CO OPERATIVE BANK LTD','THE ALAPPUZHA DIST CO OPERATIVE BANK(EVE NING BR)','THE BHAGYODAYA COOP BANK LTD','BHILWARA URBAN CO- OPERATIVE BANK LIMITED','THE EENADU CO-OPERATIVE URBAN BANK LTD','THE UMRETH URBAN  CO OP  BANK LTD','THE VAISHALI DISTRICT CENTRAL CO OPERATIVE BANK LIMITED','BELAGAVI SHREE BASAVESHWAR CO OP BANK LTD','KADI NAGARIK SAHKARI BANK LTD','THE MALEGAON MERCHANTS CO OPERATIVE BANK LTD MALEGAON','ODISHA GRAMYA BANK','AMBAJOGAI PEOPLES COOP BANK LTD','THE MUZAFFARPUR CENTRAL CO-OPERATIVE BANK LTD. , MUZAFFARPUR','THE MURSHIDABAD DISTRICT CENTRAL CO-OP BANK LTD.','THE  MEHSANA NAGARIK SAHAKARI BANK LTD','BALAGERIA CENTRAL CO-OP. BANK LTD.','THE MOTIHARI CENTRAL CO-OPERATIVE BANK LTD.,MOTIHARI','THE SARVODAYA SAHAKARI BANK LTD','ORISSA STATE CO-OPERATIVE BANK LTD','SONALI BANK LTD','THE COMMERCIAL CO-OP BANK LTD','KARNATAKA STATE COOP APEX BANK LTD',\
                  'VAISHYA NAGARI SAHAKARI BANK LTD  PARBHANI','ALIGARH ZILA SAHKARI BANK LTD','MAHARANA PRATAP CO-OP URBAN BANK LTD','POORNAWADI NAGRIK SAHAKARI BANK  M  B  LTD','LOKMANGAL CO.OP.BANK LTD.','SARDAR  VALLABHBHAI SAH BANK LTD','THE VAIDYANATH URBAN CO OP BANK LTD','THE KOTTAYAM DISTRICT COOPERATIVE BANK LTD','THE NASIK ROAD DEOLALI VYAPARI SAHAKARI BANK LTD','LATUR DISTRICT CENTRAL CO OP BANK LTD','THE KERALA STATE CO-OPERATIVE BANK LTD','SENIOR POST MASTER RAMESH NAGAR NEW DELH I','GANDHIDHAM CO-OP BANK LTD','JILA SAHAKARI KENDRIYA BANK MARYADIT UJJAIN','PRIYADARSHANI NAGARI SAHAKARI BANK LTD JALNA' 'WRITER SAFEGUARD PVT LTD','SECURE VALUE INDIA LIMITED','JILA SAHAKARI KENDRIYA BANK MARYADIT DURG (CG)','SIS CASH SERVICES PRIVATE LIMITED','JILA SAHKARI KENDRIYA BANK MARYADIT','THE BANASKANTHA DIST CENTRAL CO OP BANK','ARYAVART BANK','JILA SAHAKARI KENDRIYA BANK MARYADIT RAJNANDGAON','SANGLI DIST CE CO OP BANK','CHAITANYA GODAVARI GRAMEENA BANK','SWARNA BHARATHI SAHAKARA BANK NIYAMITHA','ASSAM GRAMIN VIKASH BANK','REPCO BANK LTD','PUNJAB GRAMIN BANK','LATUR DISTRICT CENTRAL CO OP BANK LTD','ASSAM GRAMIN VIKASH BANK','BARODA GUJARAT GRAMIN BANK','THE SALEM DISTRICT CENTRAL CO-OPERATIVE BANK LIMITED','JILA SAHAKARI KENDRIYA BANK MARYADIT JAGDALPUR','RAIGANJ CENTRAL CO-OPERATIVE BANK LTD.','KERALA STATE CO-OP BANK LTD.','THE DISTRICT CO-OPERATIVE CENTRAL BANK LTD','BANK OF INDIA','KARNATAKA GRAMIN BANK','THE SARASWAT CO-OPERATIVE BANK LTD','PAYTM PAYMENTS BANK LTD','THE HASSAN DISTRICT CO-OPERATIVE CENTRAL BANK LIMITED','THE DAHOD URBAN CO OP BANK LTD','SURYODAY SMALL FINANCE BANK LTD','IDFC FIRST BANK LIMITED','BARODA GUJARAT GRAMIN BANK','BANK.THE BELGAUM DIST. CENTRAL COOP BANK LTD','VIDYASAGAR CENTRAL CO OP BANK LTD MIDNAPUR','SAURASHTRA GRAMIN BANK','THE GONDIA DISTRICT CENTRAL CO-OPERATIVE BANK LTD','BANK OF BARODA','THE BHAVNAGAR DISTRICT CO-OPERATIVE BANK LIMITED','JILA SAHAKARI KENDRIYA BANK MARYADIT DEWAS','THE BHANDARA DISTRICT CENTRAL CO-OPERATIVE BANK LTD BHANDARA','STATE BANK OF INDIA','SREE MAHAYOGI LAKSHMAMMA CO OP BANK LTD','VIDHARBHA KONKAN GRAMIN BANK','ANDHRA PRADESH GRAMEENA VIKAS BANK HEAD OFFICE','NAWANSHAHR CENTRAL CO-OPERATIVE BANK','ODISHA GRAMYA BANK','BARODA U P BANK','THE SABARKANTHA DISTRICT CENTRAL CO OPERATIVE BANK LTD','JILA SAHAKARI KENDRIYA BANK MYDT VIDISHA','TAMILNADU GRAMA BANK','MANDYA DISTRICT CO-OPERATIVE CENTRAL BANK LTD','JILA SAHAKARI KENDRIYA BANK MARYADIT','AMRAVATI DISTRICT CENTRAL CO-OP.BANK LTD.','PRIYADARSHINI URBAN CO OP BANK LTD','MUGBERIA CENTRAL CO-OPERATIVE BANK LTD','A NAGAR DISTRICT CENTRAL CO-OP BANK LTD','CUTTACK CENTRAL COOP BANK LIMITED','KERALA GRAMIN BANK','PDCC BANK','JILA SAHAKARI KENDRIYA BANK MARYADIT','THE KANARA DISTRICT CENTRAL CO- OPERATIVE BANK LTD','DARJEELING DISTRICT CENTRAL CO-OPERATIVE BANK LTD','AURANGABAD DISTRICT CENTRAL COOP BANK LTD','THE ALAPPUZHA DIST CO OPERATIVE BANK(EVE NING BR)','THE BELLARY DISTRICT CO OPERATIVE CENTRAL BANK LTD','THE ROPAR CENTRAL CO OP BANK LTD','NAGPUR MAHANAGARPALIKA KARMACHARI SAH. BANK','THE WEST BENGAL STATE COOPERATIVE BANK LTD','DAUSA KENDRIYA SAHAKARI BANK LTD','THE YAVATMAL DISTRICT CENTRAL CO-OP BANK LTD','JILA SAHKARI KENDRIYA BANK BHAINSDEHI','MADHYANCHAL GRAMIN BANK','GOVERNMENT_CEBTRAL_POSTAL 20094','THE ERODE DISTRICT CENTRAL CO-OPERATIVE BANK LTD','THE BALASORE BHADRAK CENTRAL CO-OPERATIVE BANK LTD','PUNJAB NATIONAL BANK','THE SUTEX CO OPERATIVE BANK LTD','JILA SAHAKARI KENDRIYA BANK MARYADIT','ANZ BANKING GROUP LTD','KANCHEEPURAM CENTRAL CO - OPERATIVE BANK LIMITED','THE MODASA NAGARIK SAHAKARI BANK LTD.MODASA','KRISHNA BHIMA SAMRUDDHI LOCAL AREA BANK LIMITED','THE MURSHIDABAD DISTRICT CENTRAL CO-OP BANK LTD.','THE SOUTH INDIAN BANK LTD','THE JALANDHAR CENTRAL CO-OPERATIVE BANK LTD NAKODAR','THE DISTRICT COOPERATIVE CENTRAL BANK LTD MEDAK','CALCUTTA MAIN BRANCH(POST OFFICE)','WRITER SAFEGUARD PVT LTD','HDFC BANK LTD','STATE TRANSPORT CO OP BANK LTD','JILA SAHKARI KENDRIYA BANK MYDT KHANDWA','KARNATAKA GRAMIN BANK','HDFC BANK LTD.','UJJIVAN SMALL FINANCE BANK LIMITED','DHANLAXMI BANK LIMITED','JILA SAHAKARI KENDRIYA BANK MYDT RAISEN','THE CHANDRAPUR DIST.CENTRAL COOP BANK L','ALLAHABAD BANK','SIKKIM STATE CO-OPERATIVE BANK LTD','THE TARN TARAN CENTRAL CO-OP BANK LTD','ODISHA GRAMYA BANK','BIJAPUR DCC BANK LTD INDI','MARKETYARD COMMERCIAL CO OP BANK LTD','THE NILAMBUR CO-OPERATIVE URBAN BANK LTD .','SARVA HARYANA GRAMIN BANK','MADHYA PRADESH GRAMIN BANK','JILA SAHAKARI KENDRIYA BANK MARYADIT CHHINDWARA','KERALA STATE CO OP BANK LTD','ZILA SAHKARI BANK LTD KOTDWAR','VIJAYA BANK','JILA SAHKARI KENDRIYA BANK MARYADIT','UTTARAKHAND GRAMIN BANK','JILA SAHAKARI KENDRIYA BANK MYDT- B.O. ITARSI','ALLAHABAD UTTAR PRADESH GRAMIN BANK','THE NALGONDA DISTRICT CO-OPERATIVE CENTRAL BANK LIMITED','THE KANAKAMAHALAKSHMI CO-OPERATIVE BANK LTD','THE PANCHMAHAL DIST CO OP BANK LTD','JOWAI CO-OPRATIVE URBAN BANK LTD','JILA SAHAKARI KENDRIYA BANK MARYADIT UJJAIN','TRIPURA GRAMIN BANK,AMBASSA BRANCH','THE SIRCILLA CO-OP URBAN BANK LTD','MDCC BANK','KODAGU D C C BANK','DOMBIVLI NAGARI SAHAKARI BANK LTD','ZILA SAHAKARI BANK LIMITED HARDWAR','CENTRAL BANK OF INDIA','BARODA UP BANK','KALLAPPANNA AWADE ICHALKARANJI JANATA SAHAKARI BANK LTD','MADHYA PRADESH GRAMIN BANK','THE KUKARWADA NAGRIK SAHAKARI BANK LTD','KRISHANA SAHAKARI BANK LTD RETHARE BK','THE FATEHGARH SAHIB CENTRAL CO-OP BANK LTD HO SIRHIND','HIMACHAL PRADESH GRAMIN BANK','THE BATHINDA CENTRAL COOPRATIVE BANK','SUB TREASURY OFFICER, KERALA STATE GOVT','THE GURDASPUR CENTRAL CO-OP BANK LTD','JHARKHAND STATE COOPERATIVE BANK LIMITED','MIZORAM CO OPERATIVE APEX BANK LTD','INDUSIND BANK LTD','KARNATAKA GRAMIN BANK','STATE BANK OF SIKKIM','THE RAIGAD DISTRICT CENTRAL CO-OP.BANK LTD. H.O.ALIBAG','THE EASTERN RAILWAY EMPLOYEES CO-OPERATIVE BANK LTD.','MIZORAM RURAL BANK','BARODA U.P. BANK','KANGRA CO-OP BANK LTD.','MUZAFFAR NAGAR DISTRICT CO OPERATIVE BANK LIMITED','THE DISTRICT COOPERATIVE CENTRAL BANK LIMITEDELURU','THE KURUKSHETRA CENTRAL CO OP BANK LTD','IDBI BANK LTD','BHAUSAHEB BIRAJDAR NAGARI SAHAKARI BANK LIMITED','KARNATAKA BANK LTD','KERALA STATE CO OPERATIVE BANK LTD','THE COSMOS CO OP BANK LTD','SAMARTH SAHAKARI BANK MARYADIT JALNA.','THE CHITRADURGA DISTRICT CO-OPERATIVE CENTRAL BANK LTD','THE DAKSHIN DINAJPUR DISTRICT CENTRAL COOPERATIVE BANK LIMITED','THE UTKAL CO-OPERATIVE BANK LTD BHUBANESWAR','THE AMBALA CENTRAL COOPERATIVE BANK LTD','BANDA URBAN CO OPERATIVE BANK LTD','THE RADDI SAHAKARA BANK NIYAMITHA','DAUSA URBAN CO-OPERATIVE BANK LTD','D Y PATIL SAHAKARI BANK LTD','NADIA DISTRICT CENTRAL CO-OP BANK LTD. R ANAGHAT BRANCH','THE SURAT MERCANTILE CO OP BANK LTD 242341824109332429310','THE CHIKMAGALUR DISTRICT CO-OPERATIVE CENTRAL BANK LIMITED','THE KERALA STATE CO-OPERATIVE BANK LTD','KERALA STATE CO-OPERATIVE BANK LTD','THE NAGALAND STATE CO-OPERATIVE BANK LTD','SHREE WARANA SAHAKARI BANK LTD','UTKAL GRAMYA BANK','THE ASSAM CO OPERATIVE APEX BANK LTD','THE RAILWAY EMPLOYEES COOPERATIVE BANK LIMITED','H P STATE COOP BANK LTD','A P RURAL BANK NAHARLAGUN BRANCH','COASTAL LOCAL AREA BANK LTD','THE BURDWAN CENTRAL CO OPERATIVE BANK LTD-KATWA BRANCH','THE SOLAPUR D.C.C. BANK LTD','JILA SAHAKARI KENDRIYA BANK MARYADIT RATLAM','MADHESHWARI URBAN DEV CO OP BANK LTD MAD HA','BANKURA DISTRICT CENTRAL CO-OPERATIVE BANK LTD','MEGHALAYA RURAL BANK','SUNDARGARH DISTRICT CENTRAL CO-OPERATIVE BANK','PUNJAB NATIONAL BANK','OMERGA JANTA SAHAKARI BANK LTD OMERGA','SAHAKARMAHARSHI BHAUSAHEB THORAT AMRUTVAHINI SAHAKARI BANK LTD GHULEWADI','SHRIMANT MALOJIRAJE SAHAKARI BANK LTD','MEGHALAYA CO-OP APEX BANK LTD','THE BEED DISTRICT CENTRAL CO OP BANK LTD','SHRI BASAVESHWAR SAHAKARI BANK NIYAMITA BAGALKOT','THE ADARSH CO-OP URBAN BANK LIMITED','THE JAWHAR URBAN CO OP BANK LTD','SINDHUDURG SAHAKARI BANK LTD','THE HOWRAH DISTRICT CENTRAL CO-OPERATIVE BANK LTD','NKGSB CO-OPERATIVE BANK LTD','THE BHARAT CO-OPERATIVE BANK (MUMBAI) LTD','BALITIKURI-CO-OP.BANK LIMITED','DBS BANK INDIA LTD','THE HOSHIARPUR CENTRAL CO-OP BANK BHUNGA','DURG RAJNANDGAON GRAMIN BANK  .','BANGIYA GRAMIN VIKASH BANK','INDIAN BANK','THE INCOMETAX DEPT CO OP BANK LTD','THE CUDDALORE DISTRICT CENTRAL CO-OPERATIVE BANK LIMITED','BARODA RAJASTHAN KSHETRIYA GRAMIN BANK','RAJARAMBAPU SAHAKARI BANK LTD PETH','MAHALAKSHMI BANKING SERVICES','RAJE VIKRAMSINH GHATGE CO-OP BANK LTD KAGAL','ASSAM GRAMIN VIKASH BANK','THE VISAKHAPATNAM CO-OP. BANK LTD','THE CENTRAL CO-OPERATIVE BANK LTD','THE KAITHAL CENTRAL CO-OPERATIVE BANK LTD KAITHAL BRANCH 841','FINO PAYMENTS BANK LIMITED','THE HONGKONG AND SHANGHAI BANKING CORPORATION LIMITED','ADARNIYA P D PATILSAHEB SAHAKARI BANK LTD KARAD','THESONEPAT CENTRAL COOP BANK LTD','SHRI GAJANAN MAHARAJ URBAN CO OP BANK L','GULBARGA AND YADGIR DISTRICT CO OPERATIVE CENTRAL BANK LTD','THE BARMER CENTRAL CO-OP BANK LTD','PRATHAMA UP GRAMIN BANK','JILA SAHAKARI KENDRIYA BANK MARYADIT','THE PUNE DIST. CENTRAL CO-OP. BANK LTD,PUNE',
                 'AXIS BANK LIMITED,THE KERALA STATE FINANCIAL ENTERPRISES LTD,BARCLAYS BANK P L C,INDUSIND BANK LTD,GOVERNMENT OF AP, ACCOUNT OF,UJJIVAN SMALL FINANCE BANK LIMITED,BANK OF BARODA,AU SMALL FINANCE BANK LIMITED,THE HONGKONG  SHANGHAI BANKING CORPORATION LTD,EQUITAS SMALL FINANCE BANK LIMITED,DSIIDC LTD,BANGIYA GRAMIN VIKASH BANK,AIRTEL PAYMENTS BANK LIMITED,MPSTATE COOP MARKETING FEDERATION LTD,DAKSHIN BIHAR GRAMIN BANK,THE SOUTH INDIAN BANK LTD,JILA SAHAKARI KENDRIYA BANK MARYADIT DURG,ICICI BANK LIMITED,UTTAR BIHAR GRAMIN BANK,THE AHMEDNAGAR MERCHANTS CO OP BANK LTD,URBAN COOP BAN,THE KOZHIKODE DISTRICT CO-OPERATIVE BANK LTD,CENTRAL BANK OF INDIA,CAO FA BMTC BANGALORE,ALLAHABAD BANK,REPCO BANK LTD,THE BHARAT CO-OPERATIVE BANK (MUMBAI) LTD,THRISSUR DISTRICT CO OP  BANK,PUNJAB NATIONAL BANK,G P PARSIK SAHAKARI BANK LTD,ABHYUDAYA CO OP BANK LTD,RBL BANK LTD,BASSEIN CATHOLIC CO OP BANK LTD,THE DAHOD MERCANTILE CO OP BANK LTD,THE SURAT DIST CO BANK LTD,THE SURAT PEOPLES COOP BANK LTD,FINCARE SMALL FINANCE BANK LIMITED,VIJAYA BANK,SOLAPUR JANATA SAHAKARI BANK LTD,BANK OF INDIA,SURYODAY SMALL FINANCE BANK LTD,THE BIHAR STATE COOPRATIVE BANK LIMITED,THE MUGBERIA CENTRAL COOPERATIVE BANK LTD,THE YAVATMAL URBAN CO-OP BANK LTD,TAMILNAD MERCANTILE BANK LTD,RAJKOT PEOPLES COOP BANK,DHANLAXMI BANK LIMITED,NUTAN NAGARIK SAHAKARI BANK LTD,THE GODHRA URBAN CO OP BANK LTD,BOMBAY MERCANTILE CO-OPERATIVE BANK LTD,VIDYANAND CO OP BANK LTD SOLAPUR BRANCH PHALTAN,KARNATAKA BANK LTD,SAMARTH SAHAKARI BANK,NEW URBAN CO OPERATIVE BANK  LTD,MALVIYA URBAN CO OPERATIVE BANK LIMITED,HDFC BANK,JHARKHAND RAJYA GRAMIN BANK,PUSAD URBAN CO-OP BANK LTD,KERALA STATE CO-OPERATIVE BANK LTD,JANAKALYAN SAHAKARI BANK LTD,UNION BANK OF INDIA,SIS PROSEGUR CASH LOGISTICS PRIVATE LIMITED,SBPP CO-OPERATIVE BANK LIMITED,THE KOLAR AND CHIKBALLAPURA DISTRICT COOPERATIVE CENTRAL BANK LTD KOLAR,THE KALYAN JANATA SAHAKARI BANK LTD,KALLAPPANNA AWADE ICHALKARANJI JANATA SAHAKARI BANK LTD,NORTH EAST SMALL FINANCE BANK LIMITED,JANA SMALL FINANCE BANK LIMITED,THE SANGRUR CENTRAL CO OP BANK LTD,RAJASTHAN MARUDHARA GRAMIN BANK,THE BURDWAN CENTRAL CO OPERATIVE BANK LTD,JILA SAHKARI KENDRIYA BANK MARYADIT,SONALI BANK LIMITED,THE PANDHARPUR URBAN COOP BANK LTD PANDHARPUR,KERALA STATE CO OPERATIVE BANK LTD,THE AKOLA URBAN CO-OP BANK LTD,FEDBANK FINANCIAL SERVICES LTD,CONTAI CO-OPERATIVE BANK LTD,DCB BANK LIMITED,SHRI BASAVESHWAR SAHAKARI BANK NIYAMITA BAGALKOT,THE SANGAMNER MERCHANTS CO OP BANK LTD,RAIGANJ CENTRAL CO-OPERATIVE BANK LTD.,ANDHRA PRADESH GRAMEENA VIKAS BANK, CHURCH ROAD BRANCH,VYAVSAYIK SAHKARI BANK LTD,THE VIJAY CO.OP BANK LTD,SURAT NATIONAL CO OP BANK LTD,VYSYA CO-OPERATIVE BANK LTD,THE JANATA CO OP BANK LTD GODHRA,APNA SAHAKARI BANK LTD,THE SUTEX CO OPERATIVE BANK LTD,THESUVARNYUG SAHAKARI BANK LTD,RAJKOT NAGARIK SAHAKARI BANK LIMITED,THE KOTTAKKAL CO-OP URBAN BANK LTD,THE MEHSANA NAGRIK SAHAKARI BANK LTD.,HIMACHAL GRAMIN BANK,TELANGANA STATE POLICE WELFARE SOCIETY,AHMADNAGAR  SHAHAR SAHKARI BANK LTD,LOKMANGAL CO OP BANK SOLAPUR,SUCO SOUHARDHA SAHAKARI BANK LTD,THE MYSORE MERCHANTS CO-OP BANK LTD,CORPORATION BANK,TAMILNADU GRAMA BANK,THE AHMEDABAD MERCHANTILE CO OP BANK LIMITED,BSNL COLLECTION AS AOCASH PGMTD BSNL,SRI GANESH CO-OPERATIVE BANK LTD.GULBARGA,THE AKOLA JANATA COMMIRCIAL BANKDG,INDIAN BANK,THE AGRASEN CO OPERATIVE URBAN BANK LTD,THE MURSHIDABAD DISTRICT CENTRAL CO-OP BANK LTD.,THE SIWAN CENTRAL CO-OPRATIVE BANK LIMITED,UNITY SMALL FINANCE BANK LIMITED,DBS BANK INDIA LTD,THE MALEGAON MERCHANTS CO OP BANK LTD,JANTA SAHKARI BANK LTD GONDIA,THE SIRSI URBAN SAHAKARI BANK LTD,CENTRAL CO-OPERATIVE BANK LTD ARA,SARASPUR NAGRIK CO OP BANK LTD,ZILA SAHAKARI BANK LTD.LUCKNOW,LAKHIMPUR URBAN COOPERATIVE BANK LTD.,THE MOTIHARI CENTRAL CO-OPERATIVE BANK LTD.,MOTIHARI,CHAITANYA GODAVARI GRAMEENA BANK,THE PANIPAT URBAN CO-OP BANK LTD,THE BHATKAL URBAN CO OPERATIVE BANK LIMI .,MD UTC DEHRADUN DRF,CHITTORGARH KENDRIYA SAHAKARI BANK LTD,UP SAHKARI GRAM VIKAS BANK LTD MISC A/C,STATE BANK OF INDIA,THE WAI URBAN CO OP BANK LTD WAI,SALEM DISTRICT CENTRALCO OP BANK LTD,ALIGARH ZILA SAHKARI BANK LTD,JILA SAHAKARI KENDRIYA BANK MARYADIT UJJAIN,THE KURLA NAGARIK SAHAKARI BANK LIMITED,UMIYA URBAN COOPERATIVE BANK MARYADIT NAGPUR,THE JUNAGADH COMMERCIAL CO-OP BANK LTD,UTTARBANGA KSHETRIYA GRAMIN BANK,THE AHMEDABAD DIST CO OP BANK LTD,THE PATHANAMTHITTA DISTRICT CO-OPERATIVE BANK LTD,THE KOTTAYAM DISTRICT COOPERATIVE BANK LTD,PRAVARA SAHAKARI BANK LTD,GUJARAT STATE CO-OP A.& R.D.BANK LTD  .,SYNDICATE BANK,BARODA GUJARAT GRAMIN BANK,COASTAL LOCAL AREA BANK LIMITED,PRATHAMA U.P GRAMIN BANK,STATE BANK OF SIKKIM,THE URBAN CO OP BANK LTD,PASCHIM BANGA GRAMIN BANK,THE BUSINESS CO OPERATIVE BANK LTD,ZILA SAHKARI BANK LTD., MORADABAD,GANDHIDHAM CO-OP BANK LTD,FIROZABAD ZILA SAHAKARI BANK LTD,THE INDUSTRIAL CO OPERATIVE BANK LTD,SANGOLA URBAN CO OPERATIVE BANK LTD SANGOLA,SARDAR VALLABHBHAI SAHAKARI BANK LTD,JANASEVA SAHAKARI BANK LIMITED HADAPSAR PUNE,THE ERODE DISTRICT CENTRAL CO-OPERATIVE BANK LTD,OMPRAKASH DEORA PEOPLES COOP BANK LTD,DENA BANK,THE LUDHIANA CENTRAL COOP BANK LTD,THE MOGA CENTRAL CO OPERATIVE BANK,THE WEST BENGAL STATE COOPERATIVE BANK LTD,EVEREST BANK,URBAN COOPERATIVE BANK LIMITED,PATAN NAGRIK SAHKARI BANK LTD,HYDERABAD METROPALITAN WATER SUPPLY AND SEWAGE BOARD,THE RANUJ NAGARIK SAHAKARI BANK LIMITED,P V V N L MODINAGAR,DEOGIRI NAGARI SAHAKARI BANK LTD AURANGA BAD BR- PACHORA,DOMBIVLI NAGARI SAHAKARI BANK LTD,PAYTM PAYMENTS BANK LTD,BELAGAVI SHREE BASAVESHWAR CO OP BANK LTD,TUMKUR VEERASHAIVA COOPERATIVE  BANK LIMITED,THE PANCHMAHAL DIST CO OP BANK LTD,JILA SAHAKARI KENDRIYA BANK MARYADIT,THE BICHOLIM URBAN CO-OPERATIVE BANK LTD,JILA SAHAKARI KENDRIYA BANK,MAGADH CENTRAL COOPERATIVE BANK LIMITED,THE ANAND MERCANTILE CO OP  BANK LTD.,PUNJAB GRAMIN BANK,THE SATARA SAHAKARI BANK LTD,RATANCHAND SHAH SAHAKARI BANK LTD,ASSAM CO OP APEX BANK LTD,SHREE KADI NAGRIK SAHKARI BANK LTD'
                'WRITER SAFEGUARD PVT LTD,JILA SAHKARI KENDRIYA BANK MARYADIT,JILA SAHAKARI KENDRIYA BANK MARYADIT RAJNANDGAON,JILA SAHAKARI KENDRIYA BANK MARYADIT DURG,NANDED DIST CEN CO-OP BANK LTD,SIS CASH SERVICES PRIVATE LIMITED,CHAITANYA GODAVARI GRAMEENA BANK,PUNJAB GRAMIN BANK,JILA SAHAKARI KENDRIYA BANK MARYADIT JAGDALPUR,THE BANASKANTHA DIST CENTRAL CO OP BANK,SWARNA BHARATHI SAHAKARA BANK NIYAMITHA,THE YAVATMAL DISTRICT CENTRAL CO-OP BANK LTD,BANK OF BARODA,ASSAM GRAMIN VIKASH BANK,ASSAM GRAMIN VIKASH BANK,ARYAVART BANK,JALNA MERCHANTS CO OP BANK LTD,SANGLI DISTRICT CENTRAL CO-OP BANK LTD,THE OSMANABAD DISTRICT CENTRAL CO-OP BANK LTD OSMANABAD,PATAN NAGRIK SAHKARI BANK LTD,THE CHANDRAPUR DISTRICT CENTRAL CO OP BANK LTD CHANDRAPUR,AURANGABAD DISTRICT CENTRAL COOP BANK LTD,HOOGHLY DISTRICT CENTRAL CO-OPERATIVE BANK LTD KHANAKUL BR,BARODA GUJARAT GRAMIN BANK,UTKAL GRAMEEN BANK,THE KUKARWADA NAGRIK SAHAKARI BANK LTD,SHRI SHIDDHESHWAR  CO-OPERATIVE BANK LTD,VIDYASAGAR CENTRAL CO OP BANK LTD MIDNAPUR,J D C C BANK LTD ERANDOL,PAYTM PAYMENTS BANK LTD,SURYODAY SMALL FINANCE BANK LTD,THE GONDIA DISTRICT CENTRAL CO-OPERATIVE BANK LTD,REPCO BANK LTD,LATUR DISTRICT CENTRAL CO OP BANK LTD,BARODA GUJARAT GRAMIN BANK,RAIGANJ CENTRAL CO-OPERATIVE BANK LTD.,THE KANARA DISTRICT CENTRAL CO- OPERATIVE BANK LTD,IDFC FIRST BANK LIMITED,SOLAPUR DCC BANK LTD,THE DAHOD URBAN CO-OPERATIVE BANK LTD,TAMILNAD MERCANTILE BANK LTD,DAUSA URBAN CO-OP.  BANK LTD.,THE DISTRICT CO-OPERATIVE CENTRAL BANK LTD,MDCC BANK,KARNATAKA GRAMIN BANK,THE DHANERA MERCHANTILE CO OPP BANK LTD,SALEM DISTRICT CENTRALCO OP BANK LTD,DISTRICT COOPERATIVE CENTRAL BANK LTD,BANK OF AMERICA N.A,THE DISTRICT COOPERATIVE CENTRAL BANK LIMITEDELURU,PRIYADARSHINI URBAN CO-OP BANK LTD,KERALA GRAMIN BANK,ODISHA GRAMYA BANK,JHALAWAR NAGRIK SAHAKARI BANK,R K 10 THE VIRUDHUNAGAR DISTRICT CENTRAL COOPERATIVE BANK LTD VIRUDHUNAGAR,STATE BANK OF INDIA,PUNJAB NATIONAL BANK,BANK OF INDIA,TAMILNADU GRAMA BANK,OMPRAKASH DEORA PEOPLES COOP BANK LTD,CENTRAL BANK OF INDIA,PDCC BANK,THE CHIKHLI URBAN CO-OP BANK LTD,VYAVSAYIK SAHKARI BANK LTD,CAPITAL SMALL FINANCE BANK LTD,THE ROPAR CENTRAL CO OP BANK LTD,DAUSA KENDRIYA SAHAKARI BANK LTD,MEGHALAYA COOPERATIVE APEX BANK LTD. GOE RAGRE BRANCH,JILA SAHAKARI KENDRIYA BANK MARYADIT,THE BELLARY DISTRICT CO OPERATIVE CENTRAL BANK LTD,THE DISTRICT COOPERATIVE CENTRAL BANK LTD MEDAK,MANIPUR RURAL BANK,THE COSMOS CO OP BANK LTD,MIZORAM CO OPERATIVE APEX BANK LTD,THE HASSAN DISTRICT CO-OPERATIVE CENTRAL BANK LIMITED,MAHARASHTRA GRAMIN BANK,THE MYSORE AND CHAMARAJANAGAR DISTRICT COOPERATIVE CENTRAL BANK LTD.,,NAGPUR MAHANAGARPALIKA KARMACHARI SAH. BANK,THE PRAGATI URBAN CO OP BANK LTD,CUTTACK CENTRAL COOP BANK LIMITED,UTTARAKHAND GRAMIN BANK,AMT. Z.P. SHIKSHAK BANK TEOSA,THE WEST BENGAL STATE COOPERATIVE BANK LTD,THE RAILWAY EMPLOYEES COOPERATIVE BANK LIMITED,SIHOR MERCANTILE CO OP BANK LTD - BOTAD BRANCH,ANZ BANKING GROUP LTD,THE AKOLA URBAN CO-OP BANK LTD,ALLAHABAD BANK,WRITER SAFEGUARD PVT LTD,COASTAL LOCAL AREA BANK LIMITED,BARAN NAGARIK SAHAKARI BANK LTD. ANTAH,THE SARASWAT CO OPERATIVE BANK LIMITED,THE SOUTH CANARA DISTRICT CENTRAL CO-OPERATIVE BANK LTD,BIJAPUR D C C BANK KALKERI,KARNATAKA BANK LTD,MADHYANCHAL GRAMIN BANK,MEGHALAYA RURAL BANK,VIJAYA BANK,KARNATAKA GRAMIN BANK,KODAGU D C C BANK,SREE MAHAYOGI LAKSHMAMMA CO-OP BANK LTD,VIDHARBHA KONKAN GRAMIN BANK,THE VISHWESHWAR SAHAKARI BANK LTD,SOLAPUR SIDDHESHWAR SAHAKARI BANK LTD,HDFC BANK,THE SOUTH INDIAN BANK LTD,BRAHMADEODADA MANE SAHAKARI BANK LTD,IDBI BANK LTD,THE BARMER CENTRAL CO-OP BANK LTD,JOWAI CO-OPRATIVE URBAN BANK LTD,THE UNAVA NAGRIK SAHAKARI BANK LTD,DEOGIRI NAGARI SAHAKARI BANK LTD AURANGA BAD BR- PACHORA,JILA SAHAKARI KENDRIYA BANK MARYADIT - VIDISHA,THE SONEPAT URBAN COOPERATIVE BANK LTD,HDFC BANK LTD,CALCUTTA MAIN BRANCH(POST OFFICE),THE BAGALKOT DISTRICT CENTRAL CO-OPERATIVE BANK LTD,BAGALKOT,THE ADARSH CO-OP URBAN  BANK LIMITED,UTTARKASHI ZILA SAHKARI BANK LTD,THE DAHOD MERCANTILE CO OP BANK LTD,BANKURA DISTRICT CENTRAL CO-OPERATIVE BANK LTD  (INDAS BRANCH),THE JALORE CENTRAL CO-OP BANK LTD,CEN GOVT,DEPT OF POST,KOL,NORTHERN RAILWAY PRIMARY CO-OPERATIVE BANK, MORADABDAB,THE CHOPDA PEOPLES CO OP BANK LTD,THE FATEHGARH SAHIB CENTRAL CO-OP BANK LTD HO SIRHIND,THE MUGBERIA CENTRAL COOPERATIVE BANK LTD,SHIVA SAHAKARI BANK NIYAMITA,AP STATE  CO-OP APEX BANK LTD,AXIS BANK LIMITED,CABINET SECTT. GOVT. OF INDIA,THE VAIDYANATH URBAN CO-OPERATIVE BANK LTD,HP STATE COPERATIVE BANK,THE MURSHIDABAD DISTRICT CENTRAL CO-OP BANK LTD.'
                ]

rstr = "|".join(ctr_main_list)

In [101]:
# Credit

colnames = []
data = []

with conn as connection:
    with connection.cursor() as cursor:
        cursor.execute(f"SELECT pan,max_freq as holder_name, credit_amount,cash_dep_ratio, cash_wid_ratio FROM monthly_{reporttype}.{month}_pans_credit where pan not in (select distinct pan from  monthly_{reporttype}.{month}_repeated_pans_credit) order by 3 desc ")
        
        colnames = [desc[0] for desc in cursor.description]
        for row in cursor:
            data.append(row)
df_credit = pd.DataFrame(data,columns=[colnames])
df_credit.to_csv(output_dir + f'10A-Credit_full_{reporttype}_{month}.csv')
credit_ctr = pd.read_csv(output_dir + f'10A-Credit_full_{reporttype}_{month}.csv')


#Handling the exponential numbers
credit_ctr['credit_amount'] = pd.to_numeric(credit_ctr['credit_amount'],errors='coerce').fillna(0).astype(np.int64)
credit_ctr = credit_ctr[['pan','holder_name','credit_amount','cash_dep_ratio', 'cash_wid_ratio']]

credit_ctr = credit_ctr.rename(columns={'pan':'PAN','holder_name':'HOLDER NAME','credit_amount':'CREDIT AMOUNT',
                                           'cash_dep_ratio':'CASH DEPOSIT RATIO',
                                           'cash_wid_ratio':'CASH WITHDRAWL RATIO'})
credit_ctr = credit_ctr[['PAN','HOLDER NAME','CREDIT AMOUNT','CASH DEPOSIT RATIO','CASH WITHDRAWL RATIO']]
credit_ctr = pd.DataFrame(credit_ctr.sort_values('CREDIT AMOUNT',ascending=False)).reset_index()

credit_ctr = credit_ctr.reset_index()
credit_ctr = credit_ctr[['level_0', 'PAN', 'HOLDER NAME', 'CREDIT AMOUNT', 'CASH DEPOSIT RATIO', 'CASH WITHDRAWL RATIO']]
credit_ctr['level_0'] = credit_ctr['level_0']+1
credit_ctr = credit_ctr.rename(columns={'level_0':'sl. no.'})
credit_main_1000 = credit_ctr.head(1000)
credit_main_1000.columns=[col.upper() for col in credit_main_1000.columns]

credit_main_1000.to_csv(output_dir + f'10A-Credit_1000_{reporttype}_{month}.csv')

# * **Converting the Credit Amount in Crores**
credit_main_1000['CREDIT AMOUNT'] = round(credit_main_1000['CREDIT AMOUNT']/10000000,2)
credit_main_1000.head(2)

,SL. NO.,PAN,HOLDER NAME,CREDIT AMOUNT,CASH DEPOSIT RATIO,CASH WITHDRAWL RATIO
0,1,CKNPD0055P,KUMAR UMESH CHANDRA DAS,7638022.01,100.000000,100.000000
1,2,AACCG4482F,IDFC FIRST BHARAT LIMITED,6914.03,95.641287,0.000891

##### Excluded PANS - CTR

In [102]:
reggy = '\s\s+'
reggy2 = re.compile(reggy)
pattern = re.compile(r'\.$')

In [103]:
colnames = []
data = []

with conn as connection:
    with connection.cursor() as cursor:
        cursor.execute(f"select * from  monthly_{reporttype}.{month}_excluded_pans_{reporttype}")
        
        colnames = [desc[0] for desc in cursor.description]
        for row in cursor:
            data.append(row)
excluded_ctr = pd.DataFrame(data,columns=[colnames])

excluded_ctr.to_csv(output_dir + f"10A-Credit excluded pans_{reporttype}_{month}.csv")
excluded_ctr_df = pd.read_csv(output_dir + f"10A-Credit excluded pans_{reporttype}_{month}.csv")
excluded_ctr_df.columns = [col.upper() for col in excluded_ctr_df.columns]
excluded_ctr_df.head(2)

excluded_ctr_df['HOLDERNAME'] = excluded_ctr_df['HOLDERNAME'].astype(str).apply(lambda x: str(re.sub(reggy2,' ', str(x).upper()).translate(str.maketrans('','',string.punctuation))).strip())


##### Cleaning on the basis of PANS and HolderName

# Cleaning on the basis of PANS
credit_main_1= credit_main_1000[~(credit_main_1000['PAN'].isin(excluded_ctr_df['PAN']))]

# Cleaning on the basis of HolderName
credit_main_2 = credit_main_1[~(credit_main_1['HOLDER NAME'].isin(excluded_ctr_df['HOLDERNAME']))]

# Cleaning of HolderName
credit_main_2['HOLDER NAME'] = credit_main_2['HOLDER NAME'].astype(str).apply(lambda x: str(re.sub(reggy2,' ', str(x).upper()).translate(str.maketrans('','',string.punctuation))).strip())
credit_main_2.head(2)

,SL. NO.,PAN,HOLDER NAME,CREDIT AMOUNT,CASH DEPOSIT RATIO,CASH WITHDRAWL RATIO
0,1,CKNPD0055P,KUMAR UMESH CHANDRA DAS,7638022.01,100.000000,100.000000
1,2,AACCG4482F,IDFC FIRST BHARAT LIMITED,6914.03,95.641287,0.000891

##### 10A- Top_500 PANs_CREDIT_CTR Excluding (Banks, Government Entities and Cash Management Companies)

In [104]:
credit_main_ctr = credit_main_2[~credit_main_2['HOLDER NAME'].str.contains(rstr)]
credit_main_ctr = credit_main_ctr.head(600)

credit_main_ctr = credit_main_ctr.reset_index()
credit_main_ctr = credit_main_ctr.reset_index()
credit_main_ctr = credit_main_ctr[['level_0', 'PAN', 'HOLDER NAME', 'CREDIT AMOUNT', 'CASH DEPOSIT RATIO', 'CASH WITHDRAWL RATIO']]
credit_main_ctr['level_0'] = credit_main_ctr['level_0']+1
credit_main_ctr = credit_main_ctr.rename(columns={'level_0':'sl. no.'})
credit_main_ctr.columns = [col.upper() for col in credit_main_ctr.columns]

credit_main_ctr.to_csv(output_dir + f"10A-Top_PANs_Credit_ctr_MAIN_{reporttype}_{month}.csv")
credit_main_ctr.head(2)

,SL. NO.,PAN,HOLDER NAME,CREDIT AMOUNT,CASH DEPOSIT RATIO,CASH WITHDRAWL RATIO
0,1,CKNPD0055P,KUMAR UMESH CHANDRA DAS,7638022.01,100.000000,100.000000
1,2,AACCG4482F,IDFC FIRST BHARAT LIMITED,6914.03,95.641287,0.000891

##### Appendix : 10A - TOP - CREDIT_CTR Appendix for - Banks, Govt. Entities, Cash Management & Transport Companies

In [105]:
credit_appendix_ctr = credit_main_1000[credit_main_1000['HOLDER NAME'].str.contains(rstr)]

credit_appendix_ctr = credit_appendix_ctr.reset_index()
credit_appendix_ctr = credit_appendix_ctr.reset_index()
credit_appendix_ctr = credit_appendix_ctr[['level_0', 'PAN', 'HOLDER NAME', 'CREDIT AMOUNT']]
credit_appendix_ctr['level_0'] = credit_appendix_ctr['level_0']+1
credit_appendix_ctr = credit_appendix_ctr.rename(columns={'level_0':'sl. no.'})
credit_appendix_ctr.columns = [col.upper() for col in credit_appendix_ctr.columns]
credit_appendix_ctr.to_csv(output_dir + f"10A-Top_PANs_Credit_ctr_APPENDIX_{reporttype}_{month}.csv")
credit_appendix_ctr.head(2)

   SL. NO.         PAN                   HOLDER NAME  CREDIT AMOUNT
0        1  AAACU2414K             AXIS BANK LIMITED        6046.43
1        2  AAPCA0034N  GOVERNMENT OF AP, ACCOUNT OF        5067.20

##### Repeated PANS : 10A TOP - CREDIT_CTR  Repeated PANS

In [106]:
# Credit repeated PANs

colnames = []
data = []

with conn as connection:
    with connection.cursor() as cursor:
        cursor.execute(f'SELECT pan, max_freq, max_len, credit_amount, cash_dep_ratio, cash_wid_ratio FROM monthly_{reporttype}.{month}_repeated_pans_credit order by credit_amount desc')
        
        colnames = [desc[0] for desc in cursor.description]
        for row in cursor:
            data.append(row)
df_credit_repeated_pans = pd.DataFrame(data,columns=[colnames])
df_credit_repeated_pans.to_csv(output_dir + f"10A-Credit_ctr_REPEATED_PANS_{reporttype}_{month}.csv")
credit_repeated_pans = pd.read_csv(output_dir + f"10A-Credit_ctr_REPEATED_PANS_{reporttype}_{month}.csv")


#Handling the exponential numbers
credit_repeated_pans['credit_amount'] = pd.to_numeric(credit_repeated_pans['credit_amount'],errors='coerce').fillna(0).astype(np.int64)
credit_repeated_pans = credit_repeated_pans[credit_repeated_pans['credit_amount'] > 0]

credit_repeated_pans = credit_repeated_pans.reset_index()
credit_repeated_pans['index'] = credit_repeated_pans['index']+1

credit_repeated_pans = credit_repeated_pans[['index','pan','max_freq','credit_amount','cash_dep_ratio', 'cash_wid_ratio']]
credit_repeated_pans = credit_repeated_pans.rename(columns={'index':'sl.','pan':'PAN','max_freq':'HOLDER NAME','credit_amount':'CREDIT AMOUNT'})
credit_repeated_pans = credit_repeated_pans[['sl.','PAN','HOLDER NAME','CREDIT AMOUNT']]
credit_repeated_pans.columns = [col.upper() for col in credit_repeated_pans.columns]

credit_repeated_pans['CREDIT AMOUNT'] = round(credit_repeated_pans['CREDIT AMOUNT']/10000000,2)
credit_repeated_pans = credit_repeated_pans.reset_index()
credit_repeated_pans['index'] = credit_repeated_pans['index']+1
credit_repeated_pans = credit_repeated_pans.rename(columns={'index':'SL. NO.'})
credit_repeated_pans = credit_repeated_pans[['SL. NO.','PAN','HOLDER NAME','CREDIT AMOUNT']]

credit_repeated_pans.to_csv(output_dir + f"10A-Credit_ctr_REPEATED_PANS_{reporttype}_{month}.csv")
credit_repeated_pans.head(2)

   SL. NO.         PAN                          HOLDER NAME  CREDIT AMOUNT
0        1  AAACL0582H  LIFE INSURANCE CORPORATION OF INDIA       21189.07
1        2  AABCR1718E              RELIANCE RETAIL LIMITED       11097.66

* **10B Debit Files creation**

In [107]:
rstr = "|".join(ctr_main_list)
pattern = re.compile(r'\.$')

In [108]:
# debit

colnames = []
data = []

with conn as connection:
    with connection.cursor() as cursor:
        cursor.execute(f"SELECT pan,max_freq as holder_name, debit_amount,cash_dep_ratio, cash_wid_ratio FROM monthly_{reporttype}.{month}_pans_debit where pan not in (select distinct pan from  monthly_{reporttype}.{month}_repeated_pans_debit) order by 3 desc")
        
        colnames = [desc[0] for desc in cursor.description]
        for row in cursor:
            data.append(row)
df_debit = pd.DataFrame(data,columns=[colnames])
df_debit.to_csv(output_dir + f"10B-Debit_{reporttype}_{month}.csv")
debit = pd.read_csv(output_dir + f"10B-Debit_{reporttype}_{month}.csv")


#Handling the exponential numbers
debit['debit_amount'] = pd.to_numeric(debit['debit_amount'],errors='coerce').fillna(0).astype(np.int64)
debit = debit[['pan','holder_name','debit_amount','cash_dep_ratio', 'cash_wid_ratio']]

debit = debit.rename(columns={'pan':'PAN','holder_name':'HOLDER NAME','debit_amount':'DEBIT AMOUNT',
                                           'cash_dep_ratio':'CASH DEPOSIT RATIO',
                                           'cash_wid_ratio':'CASH WITHDRAWL RATIO'})
debit = debit[['PAN','HOLDER NAME','DEBIT AMOUNT','CASH DEPOSIT RATIO','CASH WITHDRAWL RATIO']]
debit_ctr = pd.DataFrame(debit.sort_values('DEBIT AMOUNT',ascending=False)).reset_index()

debit_ctr = debit_ctr.reset_index()
debit_ctr = debit_ctr[['level_0', 'PAN', 'HOLDER NAME', 'DEBIT AMOUNT', 'CASH DEPOSIT RATIO', 'CASH WITHDRAWL RATIO']]
debit_ctr['level_0'] = debit_ctr['level_0']+1
debit_ctr = debit_ctr.rename(columns={'level_0':'sl. no.'})
debit_ctr.columns = [col.upper() for col in debit_ctr.columns]

debit_ctr_1000 = debit_ctr.head(1000)

# * **Converting the Debit Amount in Crores**
debit_ctr_1000['DEBIT AMOUNT'] = round(debit_ctr_1000['DEBIT AMOUNT']/10000000,2)
debit_ctr_1000.to_csv(output_dir + f'10B-Debit_1000_{reporttype}_{month}.csv')
debit_ctr_1000.head(5)

,SL. NO.,PAN,HOLDER NAME,DEBIT AMOUNT,CASH DEPOSIT RATIO,CASH WITHDRAWL RATIO
0,1,CKNPD0055P,KUMAR UMESH CHANDRA DAS,7638022.01,100.000000,100.000000
1,2,AADCB0396E,INDIA1 PAYMENTS LIMITED,13566.57,0.045105,42.743805
2,3,ASMPY9478L,CHANDRESH YADAV,2700.00,99.999999,99.999990
3,4,AARCS3659P,SECUREVALUE INDIA LIMITED,1749.61,0.305996,89.451046
4,5,AAAAT9426E,THE REPATRIATES CO-OPERATIVE FINANCE AND DEVEL...,1450.87,13.572353,6.159374

##### 10B. Debit Main File : Top_500 PANs_Debit_CTR Excluding (Banks, Government Entities and Cash Management Companies)

In [109]:
# Cleaning on the basis of PANS
debit_main_1= debit_ctr_1000[~(debit_ctr_1000['PAN'].isin(excluded_ctr_df['PAN']))]

# Cleaning on the basis of HolderName
debit_main_2 = debit_main_1[~(debit_main_1['HOLDER NAME'].isin(excluded_ctr_df['HOLDERNAME']))]

# Cleaning of HolderName
debit_main_2['HOLDER NAME'] = debit_main_2['HOLDER NAME'].astype(str).apply(lambda x: str(re.sub(reggy2,' ', str(x).upper()).translate(str.maketrans('','',string.punctuation))).strip())
debit_main_2.head(2)

,SL. NO.,PAN,HOLDER NAME,DEBIT AMOUNT,CASH DEPOSIT RATIO,CASH WITHDRAWL RATIO
0,1,CKNPD0055P,KUMAR UMESH CHANDRA DAS,7638022.01,100.000000,100.00000
2,3,ASMPY9478L,CHANDRESH YADAV,2700.00,99.999999,99.99999

In [110]:
#debit_ctr['HOLDER NAME'] = debit_ctr['HOLDER NAME'].apply(lambda x: str(x).rstrip('.'))
debit_main_ctr = debit_main_2[~debit_main_2['HOLDER NAME'].str.contains(rstr)]
debit_main_ctr = debit_main_ctr.head(600)

debit_main_ctr = debit_main_ctr.reset_index()
debit_main_ctr = debit_main_ctr.reset_index()
debit_main_ctr = debit_main_ctr[['level_0', 'PAN', 'HOLDER NAME', 'DEBIT AMOUNT', 'CASH DEPOSIT RATIO', 'CASH WITHDRAWL RATIO']]
debit_main_ctr['level_0'] = debit_main_ctr['level_0']+1
debit_main_ctr = debit_main_ctr.rename(columns={'level_0':'sl. no.'})
debit_main_ctr.columns = [col.upper() for col in debit_main_ctr.columns]

debit_main_ctr.to_csv(output_dir + f"10B-Debit main_{reporttype}_{month}.csv")
debit_main_ctr.head(2)

,SL. NO.,PAN,HOLDER NAME,DEBIT AMOUNT,CASH DEPOSIT RATIO,CASH WITHDRAWL RATIO
0,1,CKNPD0055P,KUMAR UMESH CHANDRA DAS,7638022.01,100.000000,100.00000
1,2,ASMPY9478L,CHANDRESH YADAV,2700.00,99.999999,99.99999

##### 10B. Appendix- TOP - Debit - CTR Appendix for - Banks, Govt. Entities, Cash Management & Transport Companies

In [111]:
debit_appendix_ctr = debit_ctr_1000[debit_ctr_1000['HOLDER NAME'].str.contains(rstr,na=False)]

debit_appendix_ctr = debit_appendix_ctr.reset_index()
debit_appendix_ctr = debit_appendix_ctr.reset_index()
debit_appendix_ctr = debit_appendix_ctr[['level_0', 'PAN', 'HOLDER NAME', 'DEBIT AMOUNT']]
debit_appendix_ctr['level_0'] = debit_appendix_ctr['level_0']+1
debit_appendix_ctr = debit_appendix_ctr.rename(columns={'level_0':'sl. no.'})
debit_appendix_ctr.columns = [col.upper() for col in debit_appendix_ctr.columns]

debit_appendix_ctr.to_csv(output_dir + f"10B-Debit appendix_{reporttype}_{month}.csv")
debit_appendix_ctr.head(2)

,SL. NO.,PAN,HOLDER NAME,DEBIT AMOUNT
0,1,AAAAT9426E,THE REPATRIATES CO-OPERATIVE FINANCE AND DEVEL...,1450.87
1,2,AAACW3405C,WRITER SAFEGUARD PVT LTD,778.59

In [112]:
debit_main_2[debit_main_2['HOLDER NAME'].str.contains(rstr)].shape

(2, 6)

##### 10B. Repeated PANS :TOP - DEBIT_CTR  Repeated PANS**

In [113]:
# debit

colnames = []
data = []

with conn as connection:
    with connection.cursor() as cursor:
        cursor.execute(f"SELECT pan, max_freq, max_len, debit_amount, cash_dep_ratio, cash_wid_ratio FROM monthly_ctr.{month}_repeated_pans_debit where debit_amount is not null order by debit_amount desc")
        
        colnames = [desc[0] for desc in cursor.description]
        for row in cursor:
            data.append(row)
df_debit_repeated_pans = pd.DataFrame(data,columns=[colnames])
df_debit_repeated_pans.to_csv(output_dir + f'10B-Debit repeated pans_{reporttype}_{month}.csv')
debit_repeated_pans = pd.read_csv(output_dir + f'10B-Debit repeated pans_{reporttype}_{month}.csv')


#Handling the exponential numbers
debit_repeated_pans['debit_amount'] = pd.to_numeric(debit_repeated_pans['debit_amount'],errors='coerce').fillna(0).astype(np.int64)
debit_repeated_pans = debit_repeated_pans.reset_index()
debit_repeated_pans['index'] = debit_repeated_pans['index']+1
debit_repeated_pans = debit_repeated_pans[['index','pan','max_freq','debit_amount','cash_dep_ratio', 'cash_wid_ratio']]
debit_repeated_pans = debit_repeated_pans.rename(columns={'index':'SL. NO.','pan':'PAN','max_freq':'HOLDER NAME','debit_amount':'DEBIT AMOUNT'})
debit_repeated_pans = debit_repeated_pans[['SL. NO.','PAN','HOLDER NAME','DEBIT AMOUNT']]

debit_repeated_pans['DEBIT AMOUNT'] = round(debit_repeated_pans['DEBIT AMOUNT']/10000000,2)
debit_repeated_pans.to_csv(output_dir + f'10B-Debit repeated pans_{reporttype}_{month}.csv')
debit_repeated_pans.head(2)

   SL. NO.         PAN                               HOLDER NAME  DEBIT AMOUNT
0        1  AAMCS2311K                  CMS INFO SYSTEMS LIMITED       6504.03
1        2  AABCI4082J  HITACHI PAYMENT SERVICES PRIVATE LIMITED       5037.79

### NTR

In [118]:
reporttype ='ntr'
print('Report type is:',reporttype)

Report type is: ntr

In [119]:
print('Verify Output directory:\n',output_dir)

Verify Output directory:
 C:\Users\FIU\Desktop\Ravi\Monthly Report\Apr 2023\Output\

In [120]:
reggy = '\s\s+'
reggy2 = re.compile(reggy)
pattern = re.compile(r'\.$')

#### NTR Credit Files Creation

In [122]:
# Credit

colnames = []
data = []

with conn as connection:
    with connection.cursor() as cursor:
        cursor.execute(f"SELECT pan, max_freq as holder_name, credit_amount, round(cash_dep_ratio,2) as cash_dep_ratio, round(cash_wid_ratio,2) as cash_wid_ratio FROM  monthly_{reporttype}.{month}_pans_credit where pan not in (select distinct pan from monthly_{reporttype}.{month}_repeated_pans_credit ) order by credit_amount desc ")
        
        colnames = [desc[0] for desc in cursor.description]
        for row in cursor:
            data.append(row)
df_credit = pd.DataFrame(data,columns=[colnames])
df_credit.to_csv(output_dir + f"11-Credit_{reporttype}_{month}.csv")
credit_ntr = pd.read_csv(output_dir + f"11-Credit_{reporttype}_{month}.csv")


#Handling the exponential numbers
credit_ntr['credit_amount'] = pd.to_numeric(credit_ntr['credit_amount'],errors='coerce').fillna(0).astype(np.int64)
credit_ntr = credit_ntr[['pan','holder_name','credit_amount','cash_dep_ratio', 'cash_wid_ratio']]

credit_ntr = credit_ntr.rename(columns={'pan':'PAN','holder_name':'HOLDER NAME','credit_amount':'CREDIT AMOUNT',
                                           'cash_dep_ratio':'CASH DEPOSIT RATIO',
                                           'cash_wid_ratio':'CASH WITHDRAWL RATIO'})
credit_ntr = credit_ntr[['PAN','HOLDER NAME','CREDIT AMOUNT','CASH DEPOSIT RATIO','CASH WITHDRAWL RATIO']]

credit_ntr = credit_ntr.reset_index()
credit_ntr = credit_ntr[['index', 'PAN', 'HOLDER NAME', 'CREDIT AMOUNT', 'CASH DEPOSIT RATIO', 'CASH WITHDRAWL RATIO']]
credit_ntr['index'] = credit_ntr['index']+1
credit_ntr = credit_ntr.rename(columns={'index':'SL. NO.'})
credit_ntr.to_csv(output_dir + f"11-NTR_Credit_full_data_{reporttype}_{month}.csv")
credit_ntr_1000 = credit_ntr.head(1000)
credit_ntr_1000['CREDIT AMOUNT'] = round(credit_ntr_1000['CREDIT AMOUNT']/10000000,2)
credit_ntr_1000.head(2)

,SL. NO.,PAN,HOLDER NAME,CREDIT AMOUNT,CASH DEPOSIT RATIO,CASH WITHDRAWL RATIO
0,1,AAFTS2164Q,S B ADANI FAMILY TRUST,22206.20,0.0,0.0
1,2,AAGAP7115C,PUNJAB GRAMIN BANK,8747.13,-1.0,-1.0

* **NTR list for Appendix**

In [125]:
ntr_main_list = [ ' GOVT ', 'GUJARAT URJA VIKAS','PUNJAB GRAMIN BANK','UTTARAKHAND GRAMIN BANK','ODISHA','PUNJAB STATE', 'BIHAR SCHOOL EXAMINATION BOARD PATNA', ' MUTUAL',' FUND ', 'BHARAT PETROLEUM CORPORATION LTD',                  'BHARAT ELECTRONICS LIMITED', 'SMALL INDUSTRIES DEVELOPMENT BANK OF INDIA', ' UTTAR PRADESH POWER CORPORATION LTD ',' LIC HOUSING FINANCE LTD ',                      ' PNB ', ' LIFE INSURANCE CORPORATION ',                 'GMR FAMILY FUND TRUST','TIRUMALA TIRUPATI DEVASTHANAMS EMPLOYEES PENSION FUND TRUST','PUNJAB STATE COOP SUPPLY MARKETING FEDER ATION LTD MARKFED','CREDIT GUARANTEE FUND TRUST FOR ANIMAL HUSBANDRY AND DAIRYING','SINGULARITY GROWTH OPPORTUNITIES FUND II','JM FINANCIAL MUTUAL FUND-REDEMPTION A/C','HVPNL EMPLOYEE PROVIDENT FUND TRUST','HUDA PENSION FUND TRUST','IE VENTURE INVESTMENT FUND II','BDA EMPLOYEES SUPER ANNUATION FUND TRUST','PUNJAB STATE E GOVERNANCE SOCIETY','XPONENTIA OPPORTUNITIES FUND II','AL AMEEN CHARITABLE FUND TRUST','M/S CREDIT GUARANTEE FUND FOR FACTORING','IA OPPORTUNITIES FUND SERIES 1','INDIA FOUNDATION FUND SERIES I','SINGULARITY GROWTH OPPORTUNITIES FUND I','SPANDANA MUTUAL BENEFIT TRUST','THE ADVOCATES MUTUALLY AIDED COOPERATIVE','XPONENTIA OPPORTUNITIES FUND 1','KARNATAKA SEMICONDUCTOR VENTURE CPITAL FUND KARSEMVEN FUND','GRAND ANICUT FUND 3','CANBANK VENTURE CAPITAL FUND LIMITED',                  'GUJARAT URJA VIKAS NIGAM LTD','PUNJAB GRAMIN BANK','INDIA SPECIAL ASSETS FUND III','TIRUMALA TIRUPATI DEVASTHANAMS EMPLOYEES PENSION FUND TRUST','NJ MUTUAL FUND PCM ACCOUNT','DIRECTORATE OF HEALTH AND FAMILY WELFARE','ICICI PRUDENTIAL LEAP FUND SERIES I','IIM BANGALORE','ASK REAL ESTATE SPECIAL OPPORTUNITIES FU','HVPNL EMPLOYEE PROVIDENT FUND TRUST','NABARD PENSION FUND TRUST','ODISHA COAL AND POWER LIMITED','TRIFECTA VENTURE DEBT FUND III','ASK REAL ESTATE SPECIAL OPPORTUNITIES FUNDIV','PUNJAB STATE COOP SUPPLY MARKETING FEDER ATION LTD MARKFED','PUNJAB STATE COOP BANK LTD','DTC EMPLOYEES PROVIDENT FUND TRUST','BLUME VENTURES OPPORTUNITIES  FUND II B','TNSTC EMPLOYEES PENSION FUND TRUST','CIF III SCHEME I','BIHAR RAJYA BEEJ NIGAM LIMITED','JM FINANCIAL MUTUAL FUND-REDEMPTION A/C','RKG FUND II','SBI FOUNDATION','XPONENTIA OPPORTUNITIES FUND II','CREDIT GUARANTEE FUND TRUST FOR ANIMAL HUSBANDRY AND DAIRYING','REAL ESTATE CREDIT OPPORTUNITIES FUND','UNIFI UMBRELLA AIF','CERESTRA SPECIAL SITUATION REAL ESTATE FUND','PROVIDENT FUND OF THE AXIS BANK LTD','ARTHA VENTURE FUND I','IE VENTURE FUND I','INDIA FOUNDATION FUND SERIES I','MOTILAL OSWAL GROWTH OPPORTUNITIES FUND SERIES II','INDIA BUSINESS EXCELLENCE FUND IV','ICICI HOME FINANCE COMPANY LTD EMPLOYEES PROVIDENT FUND PAYMENT ACCOUNT','PUNJAB STATE EGOVERNANCE SOCIETY','THE KOTTAKKAL COOPERATIVE URBAN BANK LIMITED','ORIENTAL INSURANCE CO LTD11','BLUME VENTURES INDIA FUND IV','INDIA OPPORTUNITIES FUND SSA SCHEME 1','TAMILNADU URBAN DEVELOPMENT FUND  ','MOBIL TRUST SERIES 19','UTTARAKHAND GRAMIN BANK','HUDA PENSION FUND TRUST','TIRUMALA TIRUPATI DEVASTHANAMS EMPLOYEES GENERAL PROVIDENT FUND TRUST','INDIA REALTY EXCELLENCE FUND IV','TKM EMPLOYEE S PROVIDENT FUND TRUST','EISAF II ONSHORE FUND','SUDA ODISHA','IFMR FINANCE FOR FREEDOM FUND III','EO SPECIAL SITUATIONS FUND','ANDHRA PRADESH GRAMEENA VIKAS BANK (EMPLOYEES) PENSION FUND TRUST','ICICI PRUDENTIAL GROWTH LEADERS FUND SERIES II','MOTILAL OSWAL INDIA EXCELLENCE FUND','NATIONAL INSTITUTE OF ELECTRONICS AND INFORMATION TECHNOLOGY NIELIT NEE DO','IE VENTURE INVESTMENT FUND II','WORLD WIDE FUND FOR NATURE INDIA','UNIV. DEVELOPMENT FUND A/C.','CANBANK VENTURE CAPITAL FUND LIMITED','SPARK EQUITIZED CREDIT SOLUTIONS FUND I','PUNJAB ENERGY DEVELOPEMENT AGENCY','BOI AXA MUTUAL FUND COMMON COLL.A/C','THE SECUNDERABAD MERC CO URBAN BANK LTD' 'GUJARAT URJA VIKAS NIGAM LTD','PNB EMPLOYEES PENSION FUND  TRUST AC','NATIONAL RURAL INFRASTRUCTURE DEVELOPMEN T AGENCY','RAJASTHAN MARUDHARA GRAMIN BANK','M/S CREDIT GUARANTEE FUND FOR EDUCATIONAL LOANS','NABARD PENSION FUND TRUST','ODISHA STATE RURAL ROAD AGENCY  OSRRA','UTTARAKHAND GRAMIN BANK','ICICI PRUDENTIAL LONG SHORT FUND - SERIES I','ICICI PRUDENTIAL CORPORATE CREDIT OPPORTUNITIES FUND AIF - I','ODISHA COAL AND POWER LIMITED','NATIONAL FUND FOR PERSONS WITH DISABILIT','KOTAK PREIPO OPPORTUNITIES FUND','RAJASTHAN RAJYA SAHAKARI BHOOMI VIKAS BANK LTD','CSEB GRATUITY   PENSION FUND TRUST','IIM BANGALORE','EMERGENCY CREDIT LINE GUARANTEE FUND SCHEME','INDIAN INST OF INFO TECH SOCIETY MANIPUR','IIFL SPECIAL OPPORTUNITIES FUND SERIES 7','DTC EMPLOYEES PROVIDENT FUND TRUST','M/S CREDIT GUARANTEE FUND FOR SKILL DEVELOPMENT','BEML GRATUITY FUND TRUST','MOTILAL OSWAL INDIA EXCELLENCE FUND','ICICI PRUDENTIAL GROWTH LEADERS FUND SERIES II','IIFL SPECIAL OPPORTUNITIES FUND SERIES 8','BOARD OF TRUSTEES HINDUSTAN STEEL PROVIDENT FUND (HO)','NATIONAL INSTITUTE OF FASHION TECHNOLOGY NIFT CHENNAI GENERAL A C','BANK OF BARODA PROVIDENT FUND TRUST','UTI MULTI OPPORTUNITIES FUND I','MOTILAL OSWAL INDIA EXCELLENCE FUND - MID TO MEGA - SERIES II','BHEL EMPLOYEES PROVIDENT FUND TRUST','HVPNL EMPLOYEE PROVIDENT FUND TRUST','PUNJAB STATE POWER CORPORATION PROVIDENT FUND TRUST','LOAN GURANTEE TRUST FUND FOR COVID AFFECTED SECTORS','KRIBHCO EMPLOYEES PROVIDENT FUND TRUST','CSEB PROVIDENT FUND TRUST','IIFL SECURITIES CAPITAL ENHANCER FUND','NMDC EMPLOYEES PROVIDENT FUND TRUST,GUJARAT URJA VIKAS NIGAM LTD,PUNJAB GRAMIN BANK,TVS SHRIRAM GROWTH FUND 3,THE HUBLI ELECTRICITY SUPPLY CO LTD,PNB EMPLOYEES PENSION FUND  TRUST AC,ICICI PRUDENTIAL CORPORATE CREDIT OPPORTUNITIES FUND AIF - I,INFOSYS LTD EMP PROVIDENT FUND TRUST,HSBC MUTUAL FUND,RAJASTHAN MARUDHARA GRAMIN BANK,NHM JHARKHAND PRIMARY A C,DIRECTOR NIPGR,NTPC LTD EMPLOYEES PROVIDENT FUND TRUST,NATIONAL RURAL INFRASTRUCTURE DEVELOPMEN T AGENCY,H P STATE COOPRATIVE BANK,ICICI PRUDENTIAL LONG SHORT FUND - SERIES II,NJ MUTUAL FUND PCM ACCOUNT,THE J AND K BANK EMPLOYEES GRATUITY FUND TRUST,MANUAL WORKERS GENERAL WELFARE FUND OF TNCWW BOARD,CREDIT GUARANTEE FUND FOR EDUCATIONAL LOANS CGFEL,NABARD PENSION FUND TRUST,NATIONAL INSTITUTE OF IMMUNOLOGY,INDIA ADVANTAGE FUND S4 I,ICICI PRUDENTIAL LONG SHORT FUND - SERIES I,CREDIT GUARANTEE FUND FOR SKILL DEVELOPMENT CGFSD,TNSTC EMPLOYEES PENSION FUND TRUST,THE GUJARAT INSTITUTE OF CHEMICAL TECH,UTTARAKHAND GRAMIN BANK,NSE INV PROTECTION FUND TRUST-CM SEGMENT,CSEB GRATUITY AND PENSION FUND TRUST,CENTRE FOR RAILWAY INFORMATION SYST,BLUME VENTURES FUND 1Y,TAMILNADU URBAN DEVELOPMENT FUND  ,REGISTRAR UNIVERSITY OF DELHI FEE COLLECTION ACCOUNT,TRUSTEES C P FUND JKPCC LTD,ASK REAL ESTATE SPECIAL OPPORTUNITIES FUNDIV,BLUME VENTURES INDIA FUND IV,R R V K  GRATUITY  FUND TRUST,INDIA OPPORTUNITIES FUND SSA SCHEME 1,AP TRANSCO PENSION AND GRATUITY TRUST,CIF III SCHEME I,ICICI PRUDENTIAL GROWTH LEADERS FUND SERIES II,EISAF II ONSHORE FUND,BLUME VENTURES OPPORTUNITIES  FUND II B,PROVIDENT FUND OF THE AXIS BANK LTD,ABAKKUS GROWTH FUND 2,INDIA ADVANTAGE FUND S5 I,FINANCE OFFICER VBS PUJNP,MARUTI SUZUKI INDIA LIMITED EMPLOYEES PROVIDENT FUND TRUST,BENGALURUSOLIDWASTEMANAGEMENTLIMITED,YSL ALTERNATES ALPHA PLUS FUND COLLECTION ACCOUNT,FRANKLIN TEMPLETON MUTUAL FUND,CENTRE FOR DEVELOPMENT OF TELEMATICS,MAHARASHTRA ENERGY DEVELOPMENT AGENCY,HUDA PENSION FUND TRUST,CSEB PROVIDENT FUND TRUST,INDIA REALTY EXCELLENCE FUND IV,TRIFECTA VENTURE DEBT FUND III,ORIOS FUND IIIA,HVPNL EMPLOYEE PENSION FUND TRUST,GUJARAT CANCER AND RESEARCH INSTITUTE,TIRUMALA TIRUPATI DEVASTHANAMS EMPLOYEES PENSION FUND TRUST,TKM EMPLOYEE S PROVIDENT FUND TRUST,ANANTA CAPITAL VENTURES FUND 1,SINGULARITY GROWTH OPPORTUNITIES FUND I,BLUME VENTURES (OPPORTUNITIES) FUND IIA,UP STATE POWER SECTOR EMPTRUST GPF AC,RKM PROVIDENT FUND (FORMERLY RAMAKRISHNA MISSION),NATIONAL DAIRY DEVELOPMENTBOARD,BHEL EMPLOYEES PROVIDENT FUND,ARMED FORCES FLAG DAY FUND (AFFDF),EDELWEISS INDIA SPECIAL SITUATIONS FUND,INSTITUTE OF BANKING PERSONNEL SELECTION,TRUSTEES MIDC ECPF,MD TSDDCF LTD,THE DIRECTOR NIMHANS,NATIONAL BRAIN RESEARCH CENTRE,RAJASTHAN GRAMEEN AA JEEVIKA VIKASH PARISHAD NRLM,KENDRIYA VIDYALAYA SANGATHAN FUND AC,DTC EMPLOYEES PROVIDENT FUND TRUST,ANTLER INNOVATION INDIA FUND -1,EIGHT INNOVATE FUND II,THE PUNJAB STATE CO OPERATIVE SUPPLY AND,MOTILAL OSWAL GROWTH OPPORTUNITIES FUND SERIES II,R V S HOSPITAL FUND . .,ORISSA INDUSTRIAL INFRASTRUCTURE DEVELOPMENT CORPORATION LAND BANK SCHEME,INDIAN INS OF MANAGMENT CAL,MOTILAL OSWAL INDIA EXCELLENCE FUND - MID TO MEGA - SERIES II,ODISHA STATE RURAL ROAD AGENCY  OSRRA,WBSEB EMPSCONTBPF,HINDUSTAN ZINC LIMITED EMPLOYEES CONTRIBUTORY PROVIDENT FUND TRUST,NIPPON INDIA LOW DURATION FUND SUBSCRIPTION ACCOUNT,MM TRUST SEP 22 I,GUJARAT STATE ROAD TRANSPORT CORPORATION,NORTHERN RAILWAY MULTI STATE PRIMARY COOPERATIVE BANK LIMITED,ODISHA COAL AND POWER LIMITED,BANK OF BARODA PROVIDENT FUND TRUST,ADECCO EMPLOYEES PROVIDENT FUND TRUST,THE PUNJAB STATE COOP AGR. DEV BANK,IE VENTURE FUND I']
ntr_main_list = "|".join(ntr_main_list)

###### 11. Main File : Top 500 PANs - NTR Excluding  (Mutual Funds, PSUs, Govt. Entities)

In [126]:
colnames = []
data = []

with conn as connection:
    with connection.cursor() as cursor:
        cursor.execute(f"select * from  monthly_{reporttype}.{month}_excluded_pans_{reporttype}")
        
        colnames = [desc[0] for desc in cursor.description]
        for row in cursor:
            data.append(row)
excluded_ntr = pd.DataFrame(data,columns=[colnames])

excluded_ntr.to_csv(output_dir + f"11-NTR excluded pans_{reporttype}_{month}.csv")
excluded_ntr_df = pd.read_csv(output_dir + f"11-NTR excluded pans_{reporttype}_{month}.csv")
excluded_ntr_df.columns = [col.upper() for col in excluded_ntr_df.columns]

excluded_ntr_df['HOLDERNAME'] = excluded_ntr_df['HOLDERNAME'].astype(str).apply(lambda x: str(re.sub(reggy2,' ', str(x).upper()).translate(str.maketrans('','',string.punctuation))).strip())
excluded_ntr_df.head(2)

   UNNAMED: 0         PAN                                         HOLDERNAME
0           0  AAATB0102C                  ADITYA BIRLA SUN LIFE MUTUAL FUND
1           1  AAATE3890L  THE CENTRAL BOARD OF TRUSTEES EMPLOYEES PROVID...

##### Cleaning on the basis of PANS and HolderName

In [127]:
# Cleaning on the basis of PANS
credit_ntr_main_1= credit_ntr_1000[~(credit_ntr_1000['PAN'].isin(excluded_ntr_df['PAN']))]

# Cleaning on the basis of HolderName
credit_ntr_main_2 = credit_ntr_main_1[~(credit_ntr_main_1['HOLDER NAME'].isin(excluded_ntr_df['HOLDERNAME']))]

# Cleaning of HolderName
credit_ntr_main_2['HOLDER NAME'] = credit_ntr_main_2['HOLDER NAME'].astype(str).apply(lambda x: str(re.sub(reggy2,' ', str(x).upper()).translate(str.maketrans('','',string.punctuation))).strip())
credit_ntr_main_2.head(2)

,SL. NO.,PAN,HOLDER NAME,CREDIT AMOUNT,CASH DEPOSIT RATIO,CASH WITHDRAWL RATIO
0,1,AAFTS2164Q,S B ADANI FAMILY TRUST,22206.20,0.0,0.0
3,4,AADTP1052E,PIONEER INVESTMENT FUND,4358.35,0.0,-1.0

In [ ]:
credit_ntr_main_2.shape

In [128]:
credit_main_ntr = credit_ntr_main_2[~credit_ntr_main_2['HOLDER NAME'].str.contains(ntr_main_list)]

credit_main_ntr = credit_main_ntr.reset_index()
credit_main_ntr = credit_main_ntr.reset_index()

credit_main_ntr = credit_main_ntr[['level_0', 'PAN', 'HOLDER NAME', 'CREDIT AMOUNT']]
credit_main_ntr['level_0'] = credit_main_ntr['level_0']+1
credit_main_ntr = credit_main_ntr.rename(columns={'level_0':'sl. no.'})
credit_main_ntr.columns = [col.upper() for col in credit_main_ntr.columns]

credit_main_ntr = credit_main_ntr.head(600)
credit_main_ntr.to_csv(output_dir + f"11-NTR_Credit_main_{reporttype}_{month}.csv")
credit_main_ntr.head(2)

   SL. NO.         PAN              HOLDER NAME  CREDIT AMOUNT
0        1  AAFTS2164Q   S B ADANI FAMILY TRUST       22206.20
1        2  AADTP1052E  PIONEER INVESTMENT FUND        4358.35

##### 11. Appendix: Mutual Funds, PSUs, Govt. Entities

In [129]:
ntr_appendix_list = ntr_main_list

In [130]:
rstr = "|".join(ntr_appendix_list)

In [131]:
credit_appendix_ntr = credit_ntr_1000[credit_ntr_1000['HOLDER NAME'].str.contains(ntr_main_list)]

credit_appendix_ntr = credit_appendix_ntr.reset_index()
credit_appendix_ntr = credit_appendix_ntr.reset_index()
credit_appendix_ntr = credit_appendix_ntr[['level_0', 'PAN', 'HOLDER NAME', 'CREDIT AMOUNT']]
credit_appendix_ntr['level_0'] = credit_appendix_ntr['level_0']+1
credit_appendix_ntr = credit_appendix_ntr.rename(columns={'level_0':'sl. no.'})
credit_appendix_ntr = credit_appendix_ntr[['sl. no.','PAN','HOLDER NAME','CREDIT AMOUNT']]
credit_appendix_ntr.columns = [col.upper() for col in credit_appendix_ntr.columns]
credit_appendix_ntr = credit_appendix_ntr.head(500)
credit_appendix_ntr.to_csv(output_dir + f"11-NTR_Credit appendix_{reporttype}_{month}.csv")

print(f'\nTotal appendix for {reporttype} {month} is :',credit_appendix_ntr.shape[0])
credit_appendix_ntr.head(2)

Total appendix for ntr apr23 is : 79

   SL. NO.         PAN                HOLDER NAME  CREDIT AMOUNT
0        1  AAGAP7115C         PUNJAB GRAMIN BANK        8747.13
1        2  AADTT1656Q  TVS SHRIRAM GROWTH FUND 3        1162.33

##### 11. NTR Repeated Pans

In [132]:
# Credit repeated PANs

colnames = []
data = []

with conn as connection:
    with connection.cursor() as cursor:
        cursor.execute(f"SELECT pan, max_freq, max_len, credit_amount, round(cash_dep_ratio,2) as cash_dep_ratio, round(cash_wid_ratio,2) as cash_wid_ratio FROM monthly_{reporttype}.{month}_repeated_pans_credit")
        
        colnames = [desc[0] for desc in cursor.description]
        for row in cursor:
            data.append(row)
df_credit_repeated_pans_ntr = pd.DataFrame(data,columns=[colnames])
df_credit_repeated_pans_ntr.to_csv(output_dir + f"11-NTR_Credit repeated pans_{reporttype}_{month}.csv")
credit_repeated_pans_ntr = pd.read_csv(output_dir + f"11-NTR_Credit repeated pans_{reporttype}_{month}.csv")


#Handling the exponential numbers
credit_repeated_pans_ntr['credit_amount'] = pd.to_numeric(credit_repeated_pans_ntr['credit_amount'],errors='coerce').fillna(0).astype(np.int64)

credit_repeated_pans_ntr = credit_repeated_pans_ntr.reset_index()
credit_repeated_pans_ntr['index'] = credit_repeated_pans_ntr['index']+1
credit_repeated_pans_ntr = credit_repeated_pans_ntr[['index','pan','max_freq','credit_amount','cash_dep_ratio', 'cash_wid_ratio']]
credit_repeated_pans_ntr = credit_repeated_pans_ntr.rename(columns={'index':'SL. NO.','pan':'PAN','max_freq':'HOLDER NAME','credit_amount':'CREDIT AMOUNT'})
#credit_repeated_pans_ntr.columns = [col.upper() for col in credit_repeated_pans_ntr.columns]
credit_repeated_pans_ntr = credit_repeated_pans_ntr[['SL. NO.','PAN','HOLDER NAME','CREDIT AMOUNT']]

credit_repeated_pans_ntr['CREDIT AMOUNT'] = round(credit_repeated_pans_ntr['CREDIT AMOUNT']/10000000,2)
credit_repeated_pans_ntr.to_csv(output_dir + f"11-NTR_Credit repeated pans_{reporttype}_{month}.csv")
print(f'\nTotal repeated pans for {reporttype} {month} is :',credit_repeated_pans_ntr.shape[0])
credit_repeated_pans_ntr.head(2)

Total repeated pans for ntr apr23 is : 324

   SL. NO.         PAN                           HOLDER NAME  CREDIT AMOUNT
0        1  AAATB0102C  ADITYA BIRLA SUN LIFE OVERNIGHT FUND     1125487.84
1        2  AAAAI0038F   ICICI PRUDENTIAL ETF COLLECTION A/C       28695.86

### EFT

* **Defining the report type**

In [134]:
reporttype='eft'
print('Report type is:',reporttype)

Report type is: eft

In [135]:
# try:
#     pengine = create_engine('postgresql+psycopg2://postgres:sal@123@localhost:5432/postgres')

#     conn = psycopg2.connect(database = 'postgres', user = 'postgres', password = 'sal@123',host = "localhost",port= 5432)
#     conn.autocommit = True

#     cursor = conn.cursor()
# except:
#     print("Unable to create the Postgres DB connection")

# db_conn=pengine.connect()
# print("\n Postgres database connected succesfully")

#### 12A. 
**Top 500 CBWTRs (CREDIT) filed in terms of amount reported in the CBWTR: RE name, account holder name, PAN, branch name, names of sender and receiver, country code of sending and receiving country, date of +transaction, purpose of payment, amount reported in descending order.descending order.**

In [137]:
# Credit

colnames = []
data = []

with conn as connection:
    with connection.cursor() as cursor:
        cursor.execute(f"select * from  monthly_{reporttype}.{month}_{reporttype}_credit where pan not in ( select  distinct pan from monthly_{reporttype}.{month}_{reporttype}_excluded_pans_without_repeated_pans_credit) and pan not in (select distinct pan from monthly_{reporttype}.{month}_{reporttype}_repeated_pans_credit )")
        
        colnames = [desc[0] for desc in cursor.description]
        for row in cursor:
            data.append(row)
df_credit_eft = pd.DataFrame(data,columns=[colnames])
df_credit_eft.to_csv(output_dir + f"12A-Credit_full_{reporttype}_{month}.csv")
credit_eft = pd.read_csv(output_dir + f"12A-Credit_full_{reporttype}_{month}.csv")

credit_eft = credit_eft.reset_index()
credit_eft = credit_eft.reset_index()
credit_eft = credit_eft[['level_0', 'pan', 'customername', 'amount', 'total_efts', 'total_accounts', 'pcodes', 'countries']]
credit_eft['level_0'] = credit_eft['level_0']+1
credit_eft = credit_eft.rename(columns={'level_0':'sl. no.'})
credit_eft.columns = [col.upper() for col in credit_eft.columns]
credit_eft_1000 = credit_eft.head(1000)
credit_eft_1000.columns=[col.upper() for col in credit_eft.columns]

# Converting to crores
credit_eft_1000['AMOUNT'] = round(credit_eft_1000['AMOUNT']/10000000,2)
credit_eft_1000.head(2)

,SL. NO.,PAN,CUSTOMERNAME,AMOUNT,TOTAL_EFTS,TOTAL_ACCOUNTS,PCODES,COUNTRIES
0,1,AAACH3235M,ACCENTURE SOLUTIONS PVT LTD,4754.93,80,3,"P0807,P1022",United States
1,2,AAACA4380N,ABU DHABI INVESTMENT AUTHORITY,4535.04,4207,4,"P0009,P0010",United Kingdom

In [138]:
eft_main_list = ['JP MORGAN INDIA',' RELIANCE ',' MORGAN ',' PETROL ', ' PETROLEUM ', ' BNY MELLON ', ' BANK OF NEWYORK ', ' BOFA ', ' GOVT ', ' BANK ',' BANKING ',' CIS ',' CMS ' ,' CASH ',' BHARAT PETROLEUM CORPORATION LTD ',' BHARAT ELECTRONICS LIMITED ',                  'SMALL INDUSTRIES DEVELOPMENT BANK OF INDIA', ' UTTAR PRADESH POWER CORPORATION LTD ',                  ' LIC HOUSING FINANCE LTD ', ' PNB ', ' LIFE INSURANCE CORPORATION ',' GAIL ',' UTTAR PRADESH ',                 ' PNB ',' UPPCL ',' UP POWER CORPO ','SUMITOMO MITSUI BANKING CORPORATION',                 'SUMITOMO MITSUI BANKING CORPORATION NEW DELHI BRANCH','RBL BANK LIMITED','EMIRATES NBD BANK PJSC INDIA BRANCH','PEOPLES BANK OF CHINA','CITY UNION BANK LTD','CITY UNION BANK LTD','THE BANK OF NEW YORK MELLON','HDFC BANK LIMITED-MUMBAI','FIRST ABU DHABI BANK-MUMBAI','AMERICAN EXPRESS BANKING CORP','STATE BANK OF INDIA-MUMBAI','THE MTBJ LTD AS TRUSTEE FOR GOVT PE NSION INVESTMENT FUND MTBJ40004584','BARCLAYS MERCHANT BANK (SINGAPORE) LIMITED','DEUTSCHE BANK AG, SINGAPORE','THE MTBJ LTD AS TRUST FOR GOVT PEN INVST FUND MUTB400045795','DEUTSCHE BANK AG, SINGAPORE','STATE STREET BANK AND TRUST CO','STATE STREET BANK AND TRUST CO','DEUTSCHE BANK AG, SINGAPORE','WOORI BANK - CHENNAI','STATE STREET BANK AND TRUST CO','THE BANK OF NEW YORK MELLON','THE BANK OF NEW YORK MELLON',                 'JP MORGAN SERVICES INDIA PRIVATE LI MITED','J.P. MORGAN SECURITIES ASIA PRIVATE LIMITED','FIRST ABU DHABI BANK-MUMBAI','THE MTBJ LTD AS TRUSTEE FOR GOVT PE NSION INVESTMENT FUND MTBJ40004584','DEUTSCHE BANK AG, SINGAPORE','THE MTBJ LTD AS TRUST FOR GOVT PEN INVST FUND MUTB400045795','DEUTSCHE BANK AG, SINGAPORE','J P MORGAN FUNDS','STATE STREET BANK AND TRUST CO','STATE STREET BANK AND TRUST CO','DEUTSCHE BANK AG, SINGAPORE','WOORI BANK - CHENNAI','STATE STREET BANK AND TRUST CO','THE BANK OF NEW YORK MELLON','THE BANK OF NEW YORK MELLON','DREYFUS BNY MELLON FUNDS INC DRE GLB EMER MAR FD','STATE STREET BANK AND TRUST CO','THE BANK OF NEW YORK MELLON','STATE STREET BANK AND TRUST CO','LLOYDS BANK PENSION SCHEME NO 1','THE BANK OF NEW YORK MELLON','STATE STREET BANK AND TRUST CO','STATE STREET BANK AND TRUST CO'                 'SUMITOMO MITSUI BANKING CORPORATION NEW DELHI BRANCH','RBL BANK LIMITED','EMIRATES NBD BANK PJSC INDIA BRANCH','HINDUSTAN ZINC LIMITED','PEOPLES BANK OF CHINA','BARCLAYS MERCHANT BANK (SINGAPORE) LIMITED','THE BANK OF NEW YORK MELLON','CITY UNION BANK LTD','AMERICAN EXPRESS BANKING CORP','XTRACKERS (IE) PLC-XTRKSINDIA GOVT BOND UCITSETF','FIRST ABU DHABI BANK PJSC MUMBAI','STATE BANK OF INDIA-MUMBAI','AUSTRALIA AND NEW ZEALAND BANKING LIMITED MUMBAI','OVERSEA-CHINESE BANKING CORPORATION LIMITED','DBS BANK LIMITED','HDFC BANK LIMITED-MUMBAI','INDUSIND BANK LIMITED-MUMBAI','GUJARAT STATE FERTILIZERS AND CHEMI','RASHTRIYA CHEMICALS  FERTILIZERS LTD','STATE STREET BANK AND TRUST CO.','THE FEDERAL BANK LIMITED-MUMBAI, BANK OF AMERICA SINGAPORE LIMITED,THE BANK OF NEW YORK MELLON,STANDARD CHARTERED BANK MAURITIUS LTD,THE BANK OF NEW YORK MELLON, ISHARES CORE EMERGING MRK MU CO,BHARAT OMAN REFINERIES LIMITED,PETRONET LNG LIMITED,GOOGLE INDIA PRIVATE LIMITED,HYUNDAI MOTOR INDIA LTD,ABU DHABI INVESTMENT AUTHORITY,COPTHALL MAURITIUS INVESTMENT LIMITED,CISCO SYSTEMS INDIA PRIVATE LIM,CITIGR GLOBAL MKT MU PVT LTD,HINDUSTAN UNILEVER LTD,FOXCONN HON HAI TECHNOLOGY INDIA,OPPO MOBILES INDIA PRIVATE LIMITED,MARUTI SUZUKI INDIA LIMITED,JSW STEEL LIMITED,HPCL MITTAL ENERGY LTD,INDIAN FARMERS FERTILISER COOPERATIVE LT D,STICHTING DEPOSITARY APG EMERGING MARKETS EQUITY POOL,APPLE INDIA PRIVATE LIMITED,NOMURASINGAPORELTD,TATA STEEL LTD,SHRIRAM TRANSPORT FINANCE COMPANY,TECH MAHINDRA LIMITED,KEC INTERNATIONAL LIMITED,MAERSK LINE INDIA PRIVATE LIMITED,MORGAN STANLEY MAURITIUS COMP LTD,MORGAN STAN INVEST MAUR LTD,RATEFIN INVESTMENTS LIMITED,CITIGROUP GLBL MKTS SG PTE LTD,THE TATA POWER COMPANY LIMITED,WIPRO LIMITED,GEMINI EDIBLES  FATS INDIA LIMITED,BC ASIA INVESTMENTS VII LIMITED MAURITUS,HOUSING DEVELOPMENT FIN CORPN LTD,FIVESTAR BUSINESS FINANCE LIMITED  IPO PUBLIC ISSUE ACCOUNT,CG POWER AND INDUSTRIAL SOLUTIONS LIMITE D,DELL INTERNATIONAL SERV IND PVT LTD,PHILIPS INDIA LIMITED,KIA INDIA PRIVATE LIMITED,UBS PRINCIPAL CAPITAL ASIA LTD,HCL TECH LTD TECH DIV SEZ FCY,VIVO MOBILE INDIA PRIVATE LIMITED,HIND COCA COLA HOLDINGS PVT LTD,JINDAL STEEL AND POWER LTD,OFI GLOBAL CHINA FUND LLC  FDI,CRESTA FUND LTD,FACEBOOK INDIA ONLINE SERVICES PL,NOKIA SOLUTIONS AND NETWORK INDIA PVT LTD,INVESCO DEVELOPING MARKETS FUND,BASF INDIA LIMITED  4549,MMTCPAMP INDIA PRIVATE LIMITED,SAGAREMPIRE JEWELS PRIVATE LIMITED,EMIRATES,AUGMONT ENTERPRISES PRIVATE LIMITED,JCB INDIA LIMITED,TOYOTA KIRLOSKAR MOTOR PVT LTD,JSW STEEL LIMITED,BC ASIA INVESTMENTS III LIMITED MAURITUS,ULTRATECH CEMENT LIMITED,TPG GROWTH IV SF PTE LTD FDI,ARTM BY SS GL ADVR AUS LTSUQO,EY GLOBAL DELIVERY SERVICES INDIA LLP,EMAMI AGROTECH LTD  WEF 270115,JOHN HANCOCK FD III INTL GRWT FD,BHARTI AIRTEL LIMITED,TATA TELESERVICES LIMITED,MINDTREE LIMITED,COASTAL GUJARAT POWER LIMITED,ADANI WILMAR LIMITED,NORDEA 1 SICAV  INDIAN EQUITY FUND,NESTLE INDIA LIMITED,M D OVERSEAS PVT LTD,VODAFONE SOUTH LIMITED,DBG TECHNOLOGY INDIA PRIVATE LTD,HARI KRISHNA EXPORTS PVT LTD,SMALLCAP WORLD FUND INC,SAUDICENTRALBANKREFAREASTEP1,OLAM AGRI INDIA PRIVATE LIMITED,UPL LIMITED,TATA INTERNATIONAL LIMITED,MYLAN LABORATORIES LIMITEDAGILA,KUNDAN REFINERY PVT LTD,RELIANCE JIO INFOCOMM LIMITED,VODAFONE IDEA LIMITED,CARGILL INDIA PRIVATE LIMITED,SANDOZ PRIVATE LIMITED,LOUIS DREYFUS COMPANY INDIA PRIVATE LIMITED,DENDANA INVEST MAURITIUS LTD,FIRST SI INV ICVC SIA PALEADERS SUSTAINABILITY F,TIGER GLOBAL EIGHT HOLDINGS,3M INDIA LIMITED,UNITED OVERSEAS BANKTHAI PUBLIC COMPANY LIMITED,BAJAJ FINANCE LIMITED,REDINGTON INDIA LIMITED,HBFSBISHMSCIINDMACO,EMERGING MARKETS TRUST,RHCGLOBAL EXPORTS PRIVATE LIMITED,RUNGTA MINES LTD,INDIA COKE AND POWER PVT LTD,CLSA GLOBAL MARKETS PTE LTD,ELARA INDIA OPPORTUNITIES FUND LTDUSD,CMA CGM AGENCIES INDIA PRIVATE LIMITED,DHARMANANDAN DIAMONDS PVT LTD,GRASIM INDUSTRIES LTD,GLAXOSMITHKLINE ASIA PVT LTD,KAILASH KUMAR KEDARNATH AGARWAL,ORACLE INDIA PRIVATE LIMITED,SBI MUTUAL FUND,MCPI PRIVATE LIMITED,ALBULA INVESTMENT FUNDLTD,POSCO MAHARASHTRA STEEL PRIVATE LIMITED,ADITYA BIRLA NUVO LIMITED,SKODA AUTO VOLKSWAGEN IND,CREDIT SUISSESINGAPORELTDDR AC,GALLAAZ FREIGHT FORWARDING PRIVAT,HAPAG LLOYD AKTIENGESELLSCHAFT,TRAFIGURA INDIA PRIVATE LIMITED,BP EXPLORATION ALPHA LTD,CA SWIFT INVESTMENTS,SBI SG GLOBAL SECURITIES SERVICES P LTD CLIENTS POOL ACCOU,AXIS WIND FARMS ANANTAPUR PRIVATE LIMITED,SCI GROWTH INVESTMENTS II,KIRAN GEMS PRIVATE LIMITED,AXIS WIND FARMS RAYALASEEMA PVT LTD,SBM BANKINDIALIMITED,RAWMET RESOURCES PRIVATE LIMITED,AMANSA HOLDINGS PRIVATE LIMITED,FRANKLIN TEMPLETON INVESTMENT FUNDS,CAP RSCH  NEW WORLD FUND INC,J B AND BROTHERS PVT LTD,SIEMENS LIMITED,FULLERTON INDIA CREDIT COMPANY LIMITED,SHELL MRPL AVIATION FUELS AND SERVICES L,MORGAN STANLEY INVESTMENT FUNDS ASIA OPPORTUNITY FUND,GOOGLE CLOUD INDIA PRIVATE LIMITED,SUNGROW DEVELOPERS INDIA PVT LTD,ELECTROSTEEL CASTINGS LTD,INTERNET FUND III PTE LTD,NAVITASYS INDIA PRIVATE LIMITED,GSF GS EM MAR CORE R EQU PORT,PLATINUM ASIA FUND,LARSEN AND TOUBRO LTD,APAR INDUSTRIES LTD,ABB INDIA LIMITED,SHREE RAMKRISHNA EXPORTS PVT LTD,BOSCH LIMITEDXX,VANGUARD INTERNATIONAL VALUE FUND,PRICEWATERHOUSECOOPERS SDCKOLPVT LTD,SHARANAM JEWELS LLP,VISHINDAS HOLARAM,INGRAM MICRO INDIA PRIVAT,WF ASIAN SMLR COMPANIES FD LTD,CMX GLOBAL LOGISTICS CHENNAI PRIVATE LIM ITED,ERICSSON INDIA PVT LTD,BAYER BIOSCIENCE PRIVATE LIMITED,SOVEREIGN METALS LIMITED,MONDELEZ INDIA FOODS PRIVATE LIMITED,BUENA VISTA ASIAN OPPORTUNITIES MASTER FUND LTD,AGARWAL COAL CORPORATION PVT LTD,POLYCAB INDIA LIMITED,APOLLO TYRES LTD,STERLING AND WILSON RENEWABLE ENERGY LIMITED,EATON INDIA INNOVATION CENTER LLP,SHEARWATER GEOSERVICES INDIA PVT LTD,MERCEDESBENZ GROUP AG,MAHINDRA AND MAHINDRA,BANK OF AMERICA SINGAPORE LIMITED,RELIANCE COMMUNICATIONS LIMITED,GOVERNMENT OF SINGAPORE,PEGATRON TECHNOLOGY INDIA PVT LTD,IBM INDIA PRIVATE LIMITED,RAJLAXMI TEXPORT,GO AIRLINES INDIALIMITED,MAHINDRAMAHINDRA FINANCIAL SERVICES LTD,DOW CHEMICAL INTERNATIONAL PVT LTD,LANDSTER GLOBAL EXPRESS FREIGHT PRIVATELIMITED,SBI CARDS  PAYMENT SERVICES LIMITED,HDFC CAPITAL AFFORDABLE REAL ESTATE FUND,STICH PENFD MET EN TECH RE UBS,BARCLAYS GLOBAL SERVICE CENTRE,KANPUR EDIBLES PVTLTD,OMGL REFINERY LLP,TATA AUTOCOMP SYSTEMS LIMITEDSCM,HERO MOTOCORP LTD' 
                ]

In [139]:
eft_main_list = "|".join(eft_main_list)
pattern = re.compile(r'\.$')

##### 12A. Top 500 EFT - INWARD TO INDIA Excluding (Banks,Treasuries, Petroleum companies & PSUs)

In [140]:
reggy = '\s\s+'
reggy2 = re.compile(reggy)
pattern = re.compile(r'\.$')

In [141]:
# Excluded PANS EFT

colnames = []
data = []

with conn as connection:
    with connection.cursor() as cursor:
        cursor.execute(f"select * from  monthly_{reporttype}.{month}_excluded_pans_{reporttype}")
        
        colnames = [desc[0] for desc in cursor.description]
        for row in cursor:
            data.append(row)
excluded_eft = pd.DataFrame(data,columns=[colnames])

excluded_eft.to_csv(output_dir + f"12-EFT excluded pans_{reporttype}_{month}.csv")
excluded_eft_df = pd.read_csv(output_dir + f"12-EFT excluded pans_{reporttype}_{month}.csv")
excluded_eft_df.columns = [col.upper() for col in excluded_eft_df.columns]

excluded_eft_df['HOLDERNAME'] = excluded_eft_df['HOLDERNAME'].astype(str).apply(lambda x: str(re.sub(reggy2,' ', str(x).upper()).translate(str.maketrans('','',string.punctuation))).strip())
excluded_eft_df.head(2)

   UNNAMED: 0         PAN                  HOLDERNAME
0           0  AAACB1536H  BANK OF NOVA SCOTIA MUMBAI
1           1  AAACB1537G   BANK OF AMERICA NA MUMBAI

##### Cleaning on PAN and HolderName

In [142]:
# Cleaning on the basis of PANS
credit_eft_main_1= credit_eft_1000[~(credit_eft_1000['PAN'].isin(excluded_eft_df['PAN']))]

# Cleaning on the basis of HolderName
credit_eft_main_2 = credit_eft_main_1[~(credit_eft_main_1['CUSTOMERNAME'].isin(excluded_eft_df['HOLDERNAME']))]

# Cleaning of HolderName
credit_eft_main_2['CUSTOMERNAME'] = credit_eft_main_2['CUSTOMERNAME'].astype(str).apply(lambda x: str(re.sub(reggy2,' ', str(x).upper()).translate(str.maketrans('','',string.punctuation))).strip())
credit_eft_main_2.head(2)

,SL. NO.,PAN,CUSTOMERNAME,AMOUNT,TOTAL_EFTS,TOTAL_ACCOUNTS,PCODES,COUNTRIES
0,1,AAACH3235M,ACCENTURE SOLUTIONS PVT LTD,4754.93,80,3,"P0807,P1022",United States
1,2,AAACA4380N,ABU DHABI INVESTMENT AUTHORITY,4535.04,4207,4,"P0009,P0010",United Kingdom

In [143]:
#credit_eft['CUSTOMERNAME'] = credit_eft['CUSTOMERNAME'].apply(lambda x: str(x).rstrip('.'))

credit_main_eft = credit_eft_main_2[~credit_eft_main_2['CUSTOMERNAME'].str.contains(eft_main_list)]
credit_main_eft = credit_main_eft[['PAN', 'CUSTOMERNAME', 'AMOUNT', 'TOTAL_EFTS', 'TOTAL_ACCOUNTS', 'PCODES', 'COUNTRIES']]
credit_main_eft = credit_main_eft.reset_index()
credit_main_eft = credit_main_eft.reset_index()
print(credit_main_eft.columns)

credit_main_eft['level_0'] = credit_main_eft['level_0'] + 1
credit_main_eft = credit_main_eft.rename(columns={'level_0':'sl. no.'})
credit_main_eft = credit_main_eft[['sl. no.','PAN', 'CUSTOMERNAME', 'AMOUNT', 'TOTAL_EFTS', 'TOTAL_ACCOUNTS', 'PCODES', 'COUNTRIES']]
credit_main_eft.columns = [col.upper() for col in credit_main_eft.columns]

credit_main_eft = credit_main_eft.head(500)
credit_main_eft.to_csv(output_dir + f"12A-Top 500 EFT-CREDIT main_{reporttype}_{month}.csv")
credit_main_eft.head(2)

Index(['level_0', 'index', 'PAN', 'CUSTOMERNAME', 'AMOUNT', 'TOTAL_EFTS',
       'TOTAL_ACCOUNTS', 'PCODES', 'COUNTRIES'],
      dtype='object')

,SL. NO.,PAN,CUSTOMERNAME,AMOUNT,TOTAL_EFTS,TOTAL_ACCOUNTS,PCODES,COUNTRIES
0,1,AAACH3235M,ACCENTURE SOLUTIONS PVT LTD,4754.93,80,3,"P0807,P1022",United States
1,2,AAACA4380N,ABU DHABI INVESTMENT AUTHORITY,4535.04,4207,4,"P0009,P0010",United Kingdom

##### 13A. Appendix for Banks,Treasuries, Petroleum companies & PSUs

In [144]:
credit_appendix_eft = credit_eft_1000[credit_eft_1000['CUSTOMERNAME'].str.contains(eft_main_list)]
#credit_appendix_eft = credit_eft_1000[credit_eft_1000['CUSTOMERNAME'].str.contains(eft_main_list)]
credit_appendix_eft = credit_appendix_eft.reset_index()
credit_appendix_eft = credit_appendix_eft.reset_index()
credit_appendix_eft['level_0'] = credit_appendix_eft['level_0'] + 1
credit_appendix_eft = credit_appendix_eft.rename(columns={'level_0':'sl. no.'})
credit_appendix_eft = credit_appendix_eft[['sl. no.','PAN', 'CUSTOMERNAME', 'AMOUNT', 'TOTAL_EFTS', 'TOTAL_ACCOUNTS', 'PCODES', 'COUNTRIES']]
credit_appendix_eft.columns = [col.upper() for col in credit_appendix_eft.columns]

credit_appendix_eft.to_csv(output_dir + f"12A-Top EFT-CREDIT appendix_{reporttype}_{month}.csv")

print(f'\nTotal appendix for {reporttype} {month} is :',credit_appendix_eft.shape[0])
credit_appendix_eft.head(2)

Total appendix for eft apr23 is : 0

Empty DataFrame
Columns: [SL. NO., PAN, CUSTOMERNAME, AMOUNT, TOTAL_EFTS, TOTAL_ACCOUNTS, PCODES, COUNTRIES]
Index: []

##### 13A. Repeated PANS - INWARD TO INDIA

In [145]:
# Credit repeated PANs

colnames = []
data = []

with conn as connection:
    with connection.cursor() as cursor:
        cursor.execute(f"select * from  monthly_{reporttype}.{month}_{reporttype}_repeated_pans_credit where pan not in ( select  pan from monthly_{reporttype}.{month}_{reporttype}_excluded_pans_without_repeated_pans_credit ) AND pan not in (   select pan from monthly_{reporttype}.{month}_{reporttype}_excluded_pans_without_repeated_pans_credit) ")
        
        colnames = [desc[0] for desc in cursor.description]
        for row in cursor:
            data.append(row)
df_credit_repeated_pans_eft = pd.DataFrame(data,columns=[colnames])
df_credit_repeated_pans_eft.to_csv(output_dir + f"12A-Top EFT-CREDIT repeated pans_{reporttype}_{month}.csv")
credit_repeated_pans_eft = pd.read_csv(output_dir + f"12A-Top EFT-CREDIT repeated pans_{reporttype}_{month}.csv")

credit_repeated_pans_eft = credit_repeated_pans_eft.reset_index()
credit_repeated_pans_eft = credit_repeated_pans_eft[['index','pan', 'customername', 'amount', 'total_efts', 'total_accounts', 'pcodes', 'countries']]
credit_repeated_pans_eft['index'] = credit_repeated_pans_eft['index'] +1
credit_repeated_pans_eft = credit_repeated_pans_eft.rename(columns={'index':'sl. no.'})
credit_repeated_pans_eft.columns=[col.upper() for col in credit_repeated_pans_eft.columns]

# Converting to crores
credit_repeated_pans_eft['AMOUNT'] = round(credit_repeated_pans_eft['AMOUNT']/10000000,2)

print(f'\nTotal repeated pans for INWARD TO INDIA for {month} is :',credit_repeated_pans_eft.shape[0])
credit_repeated_pans_eft.head(2)

Total repeated pans for INWARD TO INDIA for apr23 is : 32

,SL. NO.,PAN,CUSTOMERNAME,AMOUNT,TOTAL_EFTS,TOTAL_ACCOUNTS,PCODES,COUNTRIES
0,1,AAACR5055K,RELIANCE INDUSTRIES LTD,28168.26,701,18,"P0020,P0101,P0102,P0103,P0105,P0107,P0108,P010...","Armenia,Austria,Bangladesh,Belgium,Brazil,Cana..."
1,2,AAACR4849R,TATA CONSULTANCY SERVICES LTD,6367.23,707,9,"P0102,P0801,P0802,P0807,P0808","Australia,Austria,Bahrain,Barbados,Belgium,Bra..."

##### 12B. 
**Top 500 CBWTRs (DEBIT) filed in terms of amount reported in the CBWTR: RE name, account holder name, PAN, branch name, names of sender and receiver, country code of sending and receiving country, date of + transaction, purpose of payment, amount.**

In [146]:
# debit

colnames = []
data = []

with conn as connection:
    with connection.cursor() as cursor:
        cursor.execute(f"select * from  monthly_{reporttype}.{month}_{reporttype}_debit where pan not in ( select  distinct pan from monthly_{reporttype}.{month}_{reporttype}_excluded_pans_without_repeated_pans_debit) and pan not in (select distinct pan from monthly_{reporttype}.{month}_{reporttype}_repeated_pans_debit )")
        
        colnames = [desc[0] for desc in cursor.description]
        for row in cursor:
            data.append(row)
df_debit_eft = pd.DataFrame(data,columns=[colnames])
df_debit_eft.to_csv(output_dir + f"12B-DEBIT_full_{reporttype}_{month}.csv")
debit_eft = pd.read_csv(output_dir + f"12B-DEBIT_full_{reporttype}_{month}.csv")

debit_eft = debit_eft.reset_index()
#print(credit_eft.columns)
debit_eft = debit_eft[['index','pan', 'customername', 'amount', 'total_efts', 'total_accounts', 'pcodes', 'countries']]
debit_eft['index'] = debit_eft['index'] +1
debit_eft = debit_eft.rename(columns={'index':'sl. no.'})

debit_eft.columns=[col.upper() for col in debit_eft.columns]
debit_eft_1000 = debit_eft.head(1000)
debit_eft_1000['AMOUNT'] = round(debit_eft_1000['AMOUNT']/10000000,2)
debit_eft_1000.head(2)

,SL. NO.,PAN,CUSTOMERNAME,AMOUNT,TOTAL_EFTS,TOTAL_ACCOUNTS,PCODES,COUNTRIES
0,1,AAJCM3008N,MONETARY AUTHORITY OF SG ACC 9,5462.07,9,12,"S0006,S0009,S0010,S1412","United Kingdom,United States"
1,2,AAACA4380N,ABU DHABI INVESTMENT AUTHORITY,4119.94,282,7,"S0009,S0010,S1412",United Kingdom

##### 12B. Top 500 EFT- OUTWARD FROM INDIA Excluding (Banks,Treasuries, Petroleum companies & PSUs)

In [147]:
# Cleaning on the basis of PANS
debit_eft_main_1= debit_eft_1000[~(debit_eft_1000['PAN'].isin(excluded_eft_df['PAN']))]

# Cleaning on the basis of HolderName
debit_eft_main_2 = debit_eft_main_1[~(debit_eft_main_1['CUSTOMERNAME'].isin(excluded_eft_df['HOLDERNAME']))]

# Cleaning of HolderName
debit_eft_main_2['CUSTOMERNAME'] = debit_eft_main_2['CUSTOMERNAME'].astype(str).apply(lambda x: str(re.sub(reggy2,' ', str(x).upper()).translate(str.maketrans('','',string.punctuation))).strip())
debit_eft_main_2.head(2)

,SL. NO.,PAN,CUSTOMERNAME,AMOUNT,TOTAL_EFTS,TOTAL_ACCOUNTS,PCODES,COUNTRIES
0,1,AAJCM3008N,MONETARY AUTHORITY OF SG ACC 9,5462.07,9,12,"S0006,S0009,S0010,S1412","United Kingdom,United States"
1,2,AAACA4380N,ABU DHABI INVESTMENT AUTHORITY,4119.94,282,7,"S0009,S0010,S1412",United Kingdom

In [148]:
#debit_eft['CUSTOMERNAME'] = debit_eft['CUSTOMERNAME'].apply(lambda x: str(x).rstrip('.'))
debit_main_eft = debit_eft_main_2[~debit_eft_main_2['CUSTOMERNAME'].str.contains(eft_main_list)]
debit_main_eft = debit_main_eft.head(500)

debit_main_eft = debit_main_eft.reset_index()
debit_main_eft = debit_main_eft.reset_index()
debit_main_eft['level_0'] = debit_main_eft['level_0'] +1
debit_main_eft = debit_main_eft.rename(columns={'level_0':'sl. no.'})
debit_main_eft = debit_main_eft[['sl. no.', 'PAN', 'CUSTOMERNAME', 'AMOUNT', 'TOTAL_EFTS', 'TOTAL_ACCOUNTS', 'PCODES', 'COUNTRIES']]
debit_main_eft.columns = [col.upper() for col in debit_main_eft.columns]

debit_main_eft.to_csv(output_dir + f"12B-Top EFT-DEBIT main_{reporttype}_{month}.csv")
debit_main_eft.head(2)

,SL. NO.,PAN,CUSTOMERNAME,AMOUNT,TOTAL_EFTS,TOTAL_ACCOUNTS,PCODES,COUNTRIES
0,1,AAJCM3008N,MONETARY AUTHORITY OF SG ACC 9,5462.07,9,12,"S0006,S0009,S0010,S1412","United Kingdom,United States"
1,2,AAACA4380N,ABU DHABI INVESTMENT AUTHORITY,4119.94,282,7,"S0009,S0010,S1412",United Kingdom

In [149]:
debit_main_eft.shape

(500, 8)

##### 12B. Appendix for Banks,Treasuries, Petroleum companies & PSUs

In [150]:
debit_appendix_eft = debit_eft_1000[debit_eft_1000['CUSTOMERNAME'].str.contains(eft_main_list)]
#debit_appendix_eft = debit_eft_1000[debit_eft_1000['CUSTOMERNAME'].str.contains(rstr)]
debit_appendix_eft = debit_appendix_eft.reset_index()
debit_appendix_eft = debit_appendix_eft.reset_index()
debit_appendix_eft['level_0'] = debit_appendix_eft['level_0'] +1
debit_appendix_eft = debit_appendix_eft.rename(columns={'level_0':'sl. no.'})
debit_appendix_eft = debit_appendix_eft[['sl. no.', 'PAN', 'CUSTOMERNAME', 'AMOUNT', 'TOTAL_EFTS', 'TOTAL_ACCOUNTS', 'PCODES', 'COUNTRIES']]
debit_appendix_eft.columns = [col.upper() for col in debit_appendix_eft.columns]
debit_appendix_eft.to_csv(output_dir + f"12B-Top EFT-DEBIT appendix_{reporttype}_{month}.csv")

print(f'\nTotal appendix pans for {reporttype} {month} is :',debit_appendix_eft.shape[0])
debit_appendix_eft.head(2)

Total appendix pans for eft apr23 is : 1

,SL. NO.,PAN,CUSTOMERNAME,AMOUNT,TOTAL_EFTS,TOTAL_ACCOUNTS,PCODES,COUNTRIES
0,1,AAAAT2885P,THE SURAT PEOPLES CO-OP BANK LTD,45.57,80,1,"S0101,S0102,S0305","Belgium,Canada,China,Hong Kong,Italy,Japan,Kor..."

##### 12B. Repeated PANS - OUTWARD TO INDIA

In [151]:
# debit repeated PANs

colnames = []
data = []

with conn as connection:
    with connection.cursor() as cursor:
        cursor.execute(f"select * from  monthly_{reporttype}.{month}_{reporttype}_repeated_pans_debit where pan not in ( select  pan from monthly_{reporttype}.{month}_{reporttype}_excluded_pans_without_repeated_pans_debit ) AND pan not in (   select pan from monthly_{reporttype}.{month}_{reporttype}_excluded_pans_without_repeated_pans_debit) ")
        
        colnames = [desc[0] for desc in cursor.description]
        for row in cursor:
            data.append(row)
df_debit_repeated_pans_eft = pd.DataFrame(data,columns=[colnames])
df_debit_repeated_pans_eft.to_csv(output_dir + f"12B-Top EFT-DEBIT repeated pans_{reporttype}_{month}.csv")
debit_repeated_pans_eft = pd.read_csv(output_dir + f"12B-Top EFT-DEBIT repeated pans_{reporttype}_{month}.csv")

debit_repeated_pans_eft = debit_repeated_pans_eft.reset_index()
debit_repeated_pans_eft = debit_repeated_pans_eft[['index','pan', 'customername', 'amount', 'total_efts', 'total_accounts', 'pcodes', 'countries']]
debit_repeated_pans_eft['index'] = debit_repeated_pans_eft['index'] +1
debit_repeated_pans_eft = debit_repeated_pans_eft.rename(columns={'index':'sl. no.'})
debit_repeated_pans_eft.columns=[col.upper() for col in debit_repeated_pans_eft.columns]

debit_repeated_pans_eft['AMOUNT'] = round(debit_repeated_pans_eft['AMOUNT']/10000000,2)

print(f'\nTotal repeated pans for OUTWARD TO INDIA {reporttype} {month} is :',debit_repeated_pans_eft.shape[0])
debit_repeated_pans_eft.head(2)

Total repeated pans for OUTWARD TO INDIA eft apr23 is : 0

Empty DataFrame
Columns: [SL. NO., PAN, CUSTOMERNAME, AMOUNT, TOTAL_EFTS, TOTAL_ACCOUNTS, PCODES, COUNTRIES]
Index: []

### Report Generation

In [152]:
path_1 = path +f'\\{month_report_format}\\Submission\\'
path_1

'C:\\Users\\FIU\\Desktop\\Ravi\\Monthly Report\\Apr 2023\\Submission\\'

#### Insertion of Data into template

In [153]:
raw_file = [tot_batch_filed_raw,total_reports_raw, re_wise_total_reports_raw, category_wise_total_reports_raw, batch_without_trn_ctr_raw, arf_without_inplpe_raw, insufficient_gos_raw, ntr_non_receipts_raw, ntr_below_threshold_raw]

In [154]:
main_file = [REs_registered, tot_batch_filed, total_reports, re_wise_total_reports,
             category_wise_total_reports, batch_without_trn_ctr, arf_without_inplpe, insufficient_gos, 
             ntr_non_receipts, ntr_below_threshold_1, 
             credit_main_ctr, credit_appendix_ctr, credit_repeated_pans,
             debit_main_ctr, debit_appendix_ctr, debit_repeated_pans,
             credit_main_ntr, credit_appendix_ntr, credit_repeated_pans_ntr,
             credit_main_eft, credit_appendix_eft, credit_repeated_pans_eft,
             debit_main_eft, debit_appendix_eft, debit_repeated_pans_eft,
             eft_anolamy_9a,eft_anolamy_9b,eft_anolamy_9c,eft_anolamy_9d,eft_anolamy_9e,eft_anolamy_9f_P,eft_anolamy_9f_R]

In [155]:
eft_anomalies_raw_file = [eft_anolamy_9a_raw,eft_anolamy_9b_raw,eft_anolamy_9c_raw,eft_anolamy_9d_raw,eft_anolamy_9e_raw,eft_anolamy_9f_P_raw,eft_anolamy_9f_R_raw]

##### Main File

In [156]:
from datetime import datetime
wb=openpyxl.load_workbook(path + '\\Templates\\Monthly Report template_2.1.xlsx')
i=0
for ws in wb.worksheets:
    df=main_file[i]
    #print(df)
    i=i+1
    rows=dataframe_to_rows(df,index=False,header=False)
    for r_idx,row in enumerate(rows,5):
        #print(i)
        for c_idx,value in enumerate(row,1):
            ws.cell(row=r_idx,column=c_idx,value=value)
wb.save(path_1 + f'\\Monthly Report_{month_cc}_automated.xlsx')

##### Raw Data

In [157]:
from datetime import datetime
wb=openpyxl.load_workbook(path + '\\Templates\\Monthly Report Raw Data template.xlsx')
i=0
for ws in wb.worksheets:
    df=raw_file[i]
    #print(df)
    i=i+1
    rows=dataframe_to_rows(df,index=False,header=False)
    for r_idx,row in enumerate(rows,5):
        #print(i)
        for c_idx,value in enumerate(row,1):
            ws.cell(row=r_idx,column=c_idx,value=value)
wb.save(path_1 + f'\Monthly Report_{month_cc}_automated_Raw Data.xlsx')

In [158]:
eft_anolamy_9b_raw

Empty DataFrame
Columns: [fiureid, entityname, batchid, rptsernum, transactiondate, transactiontime, transactionrefnum, transactiontype, instrumenttype, transactioninstname, transactioninstrefnum, transactionstatecode, transactioncountrycode, pymtinstrumentnum, pymtinstrumentissueinstname, instrumentissueinstrefnum, instrumentcountrycode, amountrupees, amountforeigncurrency, currencyoftransaction, purposeoftransaction, purposecode, riskrating, customername, customerid, occupation, dob, gender, nationality, identificationtype, identificationnum, issuingauthority, placeofissue, pan, uin, address, city, statecode, pincode, countrycode, telephone, mobile, fax, email, accountnum, accountwithinstname, accountwithinstrefnum, relatedinstname, instrelationflag, relatedinstrefnum, remarks, deletedflag, creationdate, createdby, xmlindexid, reportxmlindexid, batchxmlindexid, country_in, tytype_in]
Index: []

[0 rows x 59 columns]

In [159]:
from datetime import datetime
wb=openpyxl.load_workbook(path_1 + '\\EFT Analomies\\test.xlsx')
i=0
for ws in wb.worksheets:
    df=eft_anomalies_raw_file[i]
    #print(df)
    i=i+1
    rows=dataframe_to_rows(df,index=False,header=False)
    for r_idx,row in enumerate(rows,5):
        #print(i)
        for c_idx,value in enumerate(row,1):
            ws.cell(row=r_idx,column=c_idx,value=value)
wb.save(path_1 + f'\EFT_Anomalies_Raw Data_{month_cc}.xlsx')

#### Formatting functions - Auto Column width and Number formatting

In [160]:
file_path =path +f'\\{month_report_format}\\Submission\\Monthly Report_{month_cc}_automated.xlsx'
file_path

'C:\\Users\\FIU\\Desktop\\Ravi\\Monthly Report\\Apr 2023\\Submission\\Monthly Report_Apr23_automated.xlsx'

In [161]:
# Change to number format

def change_to_number_format(file):
    #file_path='final.xlsx'
    wb=load_workbook(file)
    for ws in wb.worksheets:
        for row in ws.rows:
            for cell in row:
                 cell.number_format= '#,##0_);(#,##0.00);'
    wb.save(file)

In [162]:
change_to_number_format(file_path)

In [163]:
# # Auto Column Width

# def column_auto_size(file):
#     #file_path='Dummy.xlsx'
#     wb=load_workbook(file)
#     for ws in wb.worksheets:
#         dims={}
#         i=0
#         for row in ws.rows:
#             #print(row)
#             if i==0:
#                 i=i+5
#                 continue
#             for cell in row:
#                 #print(cell.value)
#                 if cell.value:
#                     dims[cell.column_letter]=max((dims.get(cell.column_letter,0),len(str(cell.value))))
#                     #print(max((dims.get(cell.column_letter,0),len(str(cell.value)))))
#         for col, value in dims.items():
#             ws.column_dimensions[col].width=value +5
#             #print(value*1.2)
#         wb.save(file)

# column_auto_size(file_path)

In [164]:
# * Time Consumed in reading the Data 
t2= datetime.now()
time_taken_in_file_creation = t2 - t1
print('Time taken in reading the data :',round((time_taken_in_file_creation.total_seconds()/60),2),'minutes')

Time taken in reading the data : 2796.47 minutes